[
  {
    "medication": "Kapvay",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "How long have you been on it? Any side effects? Is it only for hyperactive adhd or is it helping inattentive symptoms too?"
  },
  {
    "medication": "Kapvay",
    "comment": "Glad you posted this, my doctor suggested this might be the next thing to try for me but I couldn’t remember the name she said! Pretty sure my insurance doesn’t cover it from some quick research, though, they also don’t cover Vyvanse (even generic)."
  },
  {
    "medication": "Kapvay",
    "comment": "Well, the one month update is that I stopped it. \n\nI did feel some benefit the first few days, which is when I wrote the original post. \n\nI had some mild side effects at first that I assumed would get better and weren’t bad enough to make me want to stop, especially because it seem to be giving me some benefit. Dry mouth, constipation, and fatigue, but it wasn’t that bad.\n\nBut after about a week I started getting new side effects. Maybe as it built up in my system. It made me depressed. Felt down/blue and blah, but also felt slowed down mentally. I couldn’t think on my feet. And my physical reactions also felt slower which scared me about driving. I think these things that occurred later are signs that it actually was working in my brain the way it chemically should be. I think it’s supposed to slow you down. But for me, that slowing down was too much and hurt instead of helped me. \n\nThe initial improvement in hyperactivity / fidgeting I noticed didn’t seem to last after the first week. It definitely did not help me at all with any executive functions. I do think it made me less reactive to annoyances, but that may just be because it sedated me, and then later depressed me to not GAF enough to get annoyed or mad. I will say it did help me to sleep."
  },
  {
    "medication": "Kapvay",
    "comment": "Only two days.  Side effects so far have been very mild, although I’m only on low dose, 0.1 mg per night. Dry mouth, lowers blood pressure so when I get up from lying or sitting down, I feel a little woozy and not quite dizzy but just off balance for a couple seconds while my body adjusts. But then it goes away and I’m fine again. Very slight headache the first 2 days. Definitely milder than other meds I’ve tried.  \n\nIt really helped with hyperactivity symptoms! It was surprising just how much it helped with curbing the fidgeting, restlessness, interrupting myself, impulsivity, distractible stuff that has been plaguing me. I could….just….do something and finish it! \n\nInattentive symptoms, I do think it helps, but for me the improvement is not as obvious / more subtle. Maybe indirectly helped with some of the inattention just from reducing the hyperactivity? definitely was able to focus deeply and for longer, and I felt like I was more efficient just because I wasn’t interrupting myself with fidgeting or thoughts/ideas/tasks popping up in my brain that I have to write down. But I’ll have to pay attention to inattentive symptoms more and see if I can tell an improvement. I do think my working memory was a bit better.  \n\nI basically felt very similar to how that first dose of Adderall feels. I don’t know if it does that on its own, or if it actually makes the stimulant work better, since both were in my system.\n\nThe other pleasant affect is that I don’t feel as irritable as I had been feeling lately. Recently, I’ve been feeling SO annoyed by every little thing. No matter what it is or isn’t, I was irritated by it. I’ve been feeling overstimulated and not wanting to have any music on recently, and have been anxious and overwhelmed. All of that improved too. I had not realized how irritable I was until I didn’t feel it today."
  },
  {
    "medication": "Kapvay",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Guanfacine has greatly reduced my anxiety and emotional volatility. I think it’s responsible for one of the longest “okay streaks” in my adult life. Usually something happens that triggers a mood episode but the Guanfacine has seemingly reduced the frequency of that happening"
  },
  {
    "medication": "Kapvay",
    "comment": "Strattera has worked well for me, and I recently started Guanfacine, which has been life-changing. I can’t remember the last time I felt “normal” like I do right now."
  },
  {
    "medication": "Kapvay",
    "comment": "They can be great. My son has taken every one of those. Right now he is on Qelbree. Strattera was by far the best for him but it’s all going to vary person to person. Both Strattera and Qelbree are SNRIs too. \n\nMy son also had horrible side effects with stimulants too. It took like 7 or 8 years to find one that worked for him."
  },
  {
    "medication": "Kapvay",
    "comment": "I was on Qelbree and loved it, but insurance kicked me off\n\nTried stratera and it made me incredibly irritable and on edge all the time\n\nNow I'm on Wellbutrin and it works almost as well as Qelbree did for me"
  },
  {
    "medication": "Kapvay",
    "comment": "I’m on Atomoxetine. The stimulants definitely helped my symptoms way more, but I’ll take “good enough” with Straterra and NOT feel like I’m having a heart attack. I had awful side effects from stimulants. They just take a while to be effective compared to the immediacy of stimulants."
  },
  {
    "medication": "Kapvay",
    "comment": "Atomoxetine works very well for me. Stims didn’t."
  },
  {
    "medication": "Kapvay",
    "comment": "Strattera made me utterly exhausted, and was only mildly helpful for me symptoms. I'm on as-neede Focalin now, and I take it four days a week. No side effects for me, and four hours of focus is good enough for getting my work done"
  },
  {
    "medication": "Kapvay",
    "comment": "Just a heads up, I've tried Intuniv, but I suffer from low blood pressure without any medication and Intuniv lowered it even more to the point that I kept fainting. Also gave me the first and only migraine I've had in my life.\n\nIt works great when it works, but it did not work for me."
  },
  {
    "medication": "Kapvay",
    "comment": "I started on strattera, and only could do a month of it. Everyone reacts differently, but I felt like a zombie on it. No emotions, very exhausted. Felt like I was dragging my feet every day. \nI just started guanfacine a week ago and so far I am really liking it. I feel calm, but I can still genuinely  laugh. I’ve also noticed that “boring” conversations that I usually get irritated at are much easier to get through (like talking to coworkers at work). That’s my experience so far."
  },
  {
    "medication": "Kapvay",
    "comment": "Strattera gave me projectile vomiting. Guanfacine even taken at night was sedating in the afternoon. Clonidine taken at night… been on it two days but I feel fine."
  },
  {
    "medication": "Kapvay",
    "comment": "I’m excited to read this. I just started guanfacine a week ago and I am already feeling much calmer overall. Hoping it will last <3"
  },
  {
    "medication": "Kapvay",
    "comment": "Do you notice a difference between the two?"
  },
  {
    "medication": "Kapvay",
    "comment": "I was having a lot of anxiety, and the Guanfacine calms me down a lot. It also helps me not go into “ADHD rage.”"
  },
  {
    "medication": "Kapvay",
    "comment": "Hi, glad to hear about your improvement! Did you add Guanfacine to atomoxatine or swapped entirely?"
  },
  {
    "medication": "Kapvay",
    "comment": "I take both. The Guanfacine also helps me sleep."
  },
  {
    "medication": "Kapvay",
    "comment": "Damn, I'm on 0.1 mg rn to help me sleep but tbh I haven't noticed it helping much either that lately. I do get irritable though... maybe I should talk to my doc about taking it during the day to help regulate my mood instead lol."
  },
  {
    "medication": "Kapvay",
    "comment": "I already take clonidine to sleep but honestly I think I ought to up my dose of it helps with anxiety. I've been really bad with the anxious skin picking lately."
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks. I’m going to call my psychiatrist about this tomorrow. I’m still trying to find a working stimulant dose and my anxiety is off the charts with 70 mg Vyvanse to where I’m taking Ativan at night and that’s not sustainable. Adderall also made me anxious as it wore off and I am horrible at remembering mid-day meds."
  },
  {
    "medication": "Kapvay",
    "comment": "i cant recommend it enough myself. its made taking stimulants most days actually feasible for me. without it i was going days without sleep and my digestive system basically shutting down. you've got me considering taking a half dose during the day to help me with anxiety as i just take it at night currently so i can actually sleep!!\n\n\ni am also prescribed pizotifen / sandomigran for my migraines and have noticed its also helped me with stress, anxiety & heart intensity (feeling heartbeat really strongly) side effects from a few hours after taking my dexamphetamine."
  },
  {
    "medication": "Kapvay",
    "comment": "... Since 2014 I have struggled, so, so hard to want to be around, interact and talk with my fellow human beings.\n\nI really hope maybe this could help me."
  },
  {
    "medication": "Kapvay",
    "comment": "i preferred it over the guanfacine i was changed to. it was a smothering, calming sledgehammer, compared to the guanfacine’s subtle, targeted scalpel.\n\nAn all encompassing weighted blanket, vs some gloves and knee pads."
  },
  {
    "medication": "Kapvay",
    "comment": "Oh my god I can't live my life without that stuff. I was off my meds for 3 days and I didn't get a wink of sleep\n\nclonodine nearly cured my sleep anxiety and insomnia"
  },
  {
    "medication": "Kapvay",
    "comment": "Yes! I take the same combo and feel human. I need it to sleep, but it has had all arpund positive effects."
  },
  {
    "medication": "Kapvay",
    "comment": "I currently take .4mg of clonidine and have been on varying doses of it now for over a year. It has it been such a godsend!! Would really really recommend this med to fellow ADHD’rs. \n\nNot only has it totally helped my insomnia (my brain actually shuts off now…and the med puts me right to sleep), but it has done wonders for my sensory overload issues. I find that I can tolerate a lot more noise / commotion in general, and I feel on the regular so much more relaxed and much less agitated. All of this without any negative side effects that I can identify at least. Yay clonidine!"
  },
  {
    "medication": "Kapvay",
    "comment": "How long have you been taking it? Sorry if I missed that somewhere"
  },
  {
    "medication": "Kapvay",
    "comment": "Glad it helps you. It didn't help me. I get pockets of really intense anxiety that come and go in an instant. Usually by the time clonopin kicks in the anxiety is gone on its own."
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/OrangeNSilver and thanks for posting on /r/ADHD!\n\nIf you haven't already, please take a minute to [read our rules](/r/adhd/about/rules) - we will remove your post if it breaks one - and also check out our list of official megathreads [here](/r/adhd/wiki/megathreads). If your post fits into one of them, it is likely to be removed; if you think this might happen you can delete your post here and resubmit it there instead.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Ya I started on nights just to get acclimated to the med since it typically causes drowsiness at first (definitely noticed it the first few nights lol, sleep came easily). \n\nOnce I started taking it in the morning I was tired for a couple of days but then I noticed the benefits it does more. It helps alleviate the crash and intensity of vyvanse while also makes me feel much more attentive in conversation since I’m not nervously overthinking. \n\nCould be worth a shot? Mention it to your doctor and see what they think, chances are they won’t question it since it’s not a stimulant anyways.\n\nI never responded well to ssris for anxiety or depression, so this was a very unexpected victory."
  },
  {
    "medication": "Kapvay",
    "comment": "i was taking 0.2 twice a day eventually"
  },
  {
    "medication": "Kapvay",
    "comment": "I have issues with skin picking too. My entire upper torso is… not pretty. Thanks mom for the bacne and skin picking issues :(. \n\nBut it seems like I do it less. It’s not perfect but it’s progress!"
  },
  {
    "medication": "Kapvay",
    "comment": "In a similar position to you and possibly even more complicated, I take 70 mg of vyvanse daily and 1 dex with it, then a 2nd 4 hours later, then a 3rd another 4 hours later, and I’m almost never able to take it at the time I want to in the morning so most days it’s around 10 or 11, I can never eat and take them together consistently either and I haven’t slept in 3 days now. I have an unopened bottle of catapres (clonidine) but I’ve had so much anxiety over potential negative side effects that I still haven’t opened it 😅 so I’m hoping this post will leave me with enough encouragement to change that, because I would love to get some sleep at some point lol"
  },
  {
    "medication": "Kapvay",
    "comment": "Good to hear I’m not the only one. The stims seem to build up over days and get edgy. When I was on a low dose that wasn’t enough for college, I didn’t notice it as much but after upping it it’s gotten more intense. Clonodine has made it much more manageable. \n\nStrangely enough I take the same dose in morning as at night (0.1mg) and the morning dose doesn’t really fatigue me but the one at night does. Perhaps it’s taking it alongside vyvanse in the morning that keeps me from feeling sleepy?"
  },
  {
    "medication": "Kapvay",
    "comment": "It definitely helps me. When I started adderall and now moved to vyvanse, I got less social and more irritable I just didn’t notice it for a long time. \n\nI find myself enjoying talking to people for the first time in a long time. My friends have been nicer to be around, customers at my work, family, etc. it’s really nice to get that back especially when I didn’t notice how much socializing I lost."
  },
  {
    "medication": "Kapvay",
    "comment": "That’s good to hear! It’s definitely helped me fall asleep much sooner"
  },
  {
    "medication": "Kapvay",
    "comment": "It’s been great as a sleep aid. I take melatonin too every night but it usually isn’t enough to help me unwind"
  },
  {
    "medication": "Kapvay",
    "comment": "What made you go up in dosing? The only thing that worries me is feeling too tired. I’ve also read some people experience being out of breath easier, have you experienced that? I don’t think I have on my dosage."
  },
  {
    "medication": "Kapvay",
    "comment": "I have been taking it for about three weeks now"
  },
  {
    "medication": "Kapvay",
    "comment": "A potential side effect of clonodine to cause libido change and/or ED? I looked it up and both are listed as possible side effects but they’re rare. \n\nI personally haven’t noticed a difference. I already have had problems with ED after starting Strattera. I assume vyvanse worsens this, but I haven’t used vyvanse without Strattera to know. Strattera also lowered my sex drive a bit but I feel like vyvanse kind of counteracts that. I’m also 24 now so it’s possible my hormones are calmer.\n\nSadly I’ve had to buy over-the-counter supplements to help with erections during sex. L-citrulline and l-arginine combo does the trick for me and they’re both well studied and safe from what I read, but check for yourself first!\n\nI still have a relatively high sex drive though, which is nice because my girlfriend also does so I haven’t had a problem there. It’s mostly just performance for me which really really sucks but the meds are worth it."
  },
  {
    "medication": "Kapvay",
    "comment": "Just to verify, did you mean clonodine or klonopin? Very similar name, totally different drug"
  },
  {
    "medication": "Kapvay",
    "comment": "For sure. It seems like it must be a common companion to vyvanse, since that's my stimulant too lol! I'm just on a starting dose of it right now, working my way up to where I need to be with it through trial and error lol. I'll definitely bring it up in my next appointment!"
  },
  {
    "medication": "Kapvay",
    "comment": "Shit good to know!! They just added it to my adderall (on top of my lexapro!) to help with my skin picking, and I hope it works!!"
  },
  {
    "medication": "Kapvay",
    "comment": "Were you given a starting dose of the clonodine? It should be something like 0.1 mg. I’d say take one at night at the low dose, it may allow you to sleep. \n\nWas the 70 Vyvanse not working so you added the dex? Vyvanse isn’t helping with my motivation/executive function/etc so I’ve been wondering about dexamphetamine. Adderall doesn’t work either for me, at least not at 40 mg."
  },
  {
    "medication": "Kapvay",
    "comment": "Wow, that is amazing.\n\nHow much are you taking?"
  },
  {
    "medication": "Kapvay",
    "comment": "How ist it at the Moment ?"
  },
  {
    "medication": "Kapvay",
    "comment": "Best of luck to you on finding what works, it’s been a long haul for me but I think I’m finally getting close to where I want to be. \n\nAdvice for vyvanse: make sure you drink plenty of water. It took me awhile to convert to drinking something that isn’t sugar or soda lol, but water helps you not feel crappy from vyvanse. Also make sure you keep eating! I know it takes away hunger, but you cannot substitute meds for things your body needs, like sleep, food, or water. Good luck!"
  },
  {
    "medication": "Kapvay",
    "comment": "Clonodine? 0.1mg once in the morning and once before bed. Vyvanse I’m only on 30mg currently, but might be moving up yet as I’m still fine tuning it. The semester starts soon, so I imagine I’ll find out quick if I have to go up lol"
  },
  {
    "medication": "Kapvay",
    "comment": "Still works pretty great. Helps me fall asleep at night and allows me to slow down a little bit more during the day."
  },
  {
    "medication": "Kapvay",
    "comment": "Ya that one is more for panic attacks from what I recall. I don’t know much about it but I wish you the best :)"
  },
  {
    "medication": "Kapvay",
    "comment": "0.1mg, wow, is there a reason it's such a small amount?"
  },
  {
    "medication": "Kapvay",
    "comment": "How much vyvanse and strattera do you Take ? And when do you Take it ? \n\nAnd how much L-Arginin do you Take ?"
  },
  {
    "medication": "Kapvay",
    "comment": "I guess that’s all it takes for that medication. It’s also prescribed for people with high blood pressure, but their doses are only a little higher from what I read going up to 0.6mg, typically."
  },
  {
    "medication": "Kapvay",
    "comment": "I’m up to 40mg vyvanse now with good results in college. I might go up one more and see how 50 works, my appointment is tomorrow with my psychiatrist and I’m going to bring that up to her. \n\n60mg Strattera generic for about three years now. Strattera helps but not in the main sense of focus like vyvanse does. I wouldn’t manage well on just Strattera alone.\n\nL-arginine I am still experimenting with. Usually take about 4000-6000mg when I plan to be sexually active and that seems to do the trick. This I take shortly before so can be any time of the day but usually at night. \n\nAll my meds I take in the morning right when I wake up, Strattera, vyvanse, and clonodine. The only one I take at night is clonodine.\n\nIf I don’t take them in the morning it’s going to be hard for me to get out of bed lol, I always struggled before meds."
  },
  {
    "medication": "Kapvay",
    "comment": "I start With combination Escitalopram and strattera but i Had No Motivation and Drive so i added vyvanse.\n\nI think strattera makes me calm inside. \nVyvanse helps me with Motivation and Sometimes its easier to get Things done. \n\nEscitalopram i dont know.. Sometimes i think i need it because of my Bad Moos, in the other Side it makes me brainfog. \n\nI have to Research If clonodine ist available in Europe. \n\n\nI read that i have to take L-Arginin Evers day.. thank you for the Information that you only Take it when you need it. How Long does it Take that you are ready ? And how Long does it Help you ? \n\nThanks for your time !!"
  },
  {
    "medication": "Kapvay",
    "comment": "I have a similar experience with Strattera and Vyvanse to how you described it.\n\nI don’t have much knowledge on SSRIs like escitalopram I just know they are not for me whatsoever. Some people on this sub say they make them worse for adhd symptoms while others find certain ones perfect combinations with meds like vyvanse. Take that knowledge with a grain of salt because I’m not a doctor. It doesn’t hurt to look into or ask your doctor though. \n\nIf you aren’t able to get clonodine, there’s also Intuniv which is very similar and some people prefer. It’s less sedating in effect but still beneficial. I haven’t tried it personally though.\n\nI don’t know much about arginine either but I know it helps lol. I don’t think you have to take it everyday for erection quality but it probably does help more if it is consistent. I don’t really sweat it if I miss a day or two though, unlike my adhd meds. I think it helps pretty shortly after digesting but I never consciously checked time so I’m not sure. I’m also not sure how long it helps but I think it works for quite a while.\n\nNo problem, and good luck on your mental health and adhd treatment. It’s hard to stay afloat with the stress of life demands but it does get better. Just keep trying and do the best to treat your mental health, it is so important for everything in life."
  },
  {
    "medication": "Kapvay",
    "comment": "Thank you! Good luck too ! \n\nBest description for strattera ist maybe also perception and awareness.. \n\nIntuniv ist also an adhd Medication but only for children. We habe guafacin i think its Like clonodine bit this is only available for high blood pressure. \n\nYou Take clonodine for your ED or because of adhd ? Sorry thats the last question. ^^"
  },
  {
    "medication": "Kapvay",
    "comment": "Intuniv and guancafine are the same, just brand name vs chemical name.\n\nClonodine is for adhd, I think it’s off label but found to help. I don’t think it effects ED much, but it does lower blood pressure so I’m sure it does make it worse. I haven’t noticed though."
  },
  {
    "medication": "Kapvay",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Did you ever end up taking it? How was your experience? In the same situation right now!"
  },
  {
    "medication": "Kapvay",
    "comment": "I’ve been prescribed both Clonidine and Intuniv for my ADHD. I tried clonidine first and because it’s traditionally a blood pressure medication, it ended up making me feel super lightheaded and dizzy, so we switched to Intuniv. It has made a world of difference in my day-to-day life. I’m also on Wellbutrin, which helps manage my motivation and drive as well as depression. The Intuniv seems to help everything else. My focus has greatly improved, my memory retrieval is so much quicker, my impulsivity and irritability from overstimulation have been kept at bay. \n\nOn the Intuniv, I honestly feel like I’m functioning the way I could have been, all along."
  },
  {
    "medication": "Kapvay",
    "comment": "I take Dex & Guanfacine -- it's a game changing combo for me. Guanfacine builds up in your system and doesn't have the powerful \"time to work bitch\" energy that Dex has. But it has helped a lot with patience, working memory, and overall time management skills. I take both weekdays (work) and Guafacine only on weekends. I really like it, highly recommend, very few side effects once your body adjusts to the Guanfacine"
  },
  {
    "medication": "Kapvay",
    "comment": "I wanna know too. Unfortunately psychiatrists in my country don’t know about intuniv and clonidine is not even available here."
  },
  {
    "medication": "Kapvay",
    "comment": "I’d like to second this, I’d be very interested to know as well"
  },
  {
    "medication": "Kapvay",
    "comment": "I've been prescribed clonidine (but only the IR version) for insomnia. It's the only medication I've ever taken (including a bunch of antidepressants) that caused erectile dysfunction the next day - does Intuniv also have that risk?"
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/chickentenders222 and thanks for posting on /r/ADHD! If you haven't already, please take a minute to [read our rules](https://reddit.com/r/adhd/about/rules) and check out our list of official megathreads [here](https://www.reddit.com/r/ADHD/comments/nu534w/official_list_of_radhd_megathreads_please_check/). If your post fits into one of them, please resubmit your post as a reply to the relevant megathread instead. Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "I’m also curious about this. I was just prescribed Clonidine .1mg ER alongside my existing prescription for Adderall 15mg ER. My doctor suggested it after I told her that the Adderall wasn’t helping much with my hyperactivity (leg shaking, shifting in seat, can’t sit still, etc). Would love to hear more from people who take it alongside a stimulant."
  },
  {
    "medication": "Kapvay",
    "comment": "How long did it take for you to see improvements on Intuniv? I’m also on 2mg a day (plus lithium for my bipolar) and I have major brain fog, too tired to properly function but my impulsivity is down because I’m too tired most of the time."
  },
  {
    "medication": "Kapvay",
    "comment": "What intuniv dosage are you on?"
  },
  {
    "medication": "Kapvay",
    "comment": ">started noticing improvements in the first 5 days or so. My psychiatrist is having me work my way up to a higher dose, if needed, but from what she told me, 4mg is the typical dosage. Maybe talk to your doctor about upping yours?\n\nAre you on a extended release or IR? Also what time do you take it at? \n\nJust wondering have you had experience with typical ADHD stimulant medications ? I appreciate the in put, thanks!"
  },
  {
    "medication": "Kapvay",
    "comment": "Do you take intuniv with a stimulant alongside or just alone? That’s amazing that you’ve found something that works for you! X"
  },
  {
    "medication": "Kapvay",
    "comment": "Scrolling through dexedrine posts in the search and finally found someone on my exact med combo!! It’s such an amazing combination. The intuniv on its own used to make me so hypotensive I would see black spots every time I stood up, and on stimulants the cardiovascular side effects are always too much but they balance each other perfectly!!"
  },
  {
    "medication": "Kapvay",
    "comment": "For me, I started noticing improvements in the first 5 days or so. My psychiatrist is having me work my way up to a higher dose, if needed, but from what she told me, 4mg is the typical dosage. Maybe talk to your doctor about upping yours?"
  },
  {
    "medication": "Kapvay",
    "comment": "I’m currently on 2mg a day"
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks! I’m on day 8 atm and don’t see much improvement from when I first started. The dry mouth has disappeared but nothing else. Will have a talk with my psychiatrist in about a week when my prescription needs to be refilled. I’ve also heard that 4mg seems pretty common but probably depends on the person."
  },
  {
    "medication": "Kapvay",
    "comment": "I hope it works out well for you!"
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/Pristine_Neat_7178 and thanks for posting on /r/ADHD!\n\nIf you haven't already, please take a minute to [read our rules](/r/adhd/about/rules) - we will remove your post if it breaks one - and also check out our list of official megathreads [here](/r/adhd/wiki/megathreads). If your post fits into one of them, it is likely to be removed; if you think this might happen you can delete your post here and resubmit it there instead.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "how has it been working for you?"
  },
  {
    "medication": "Kapvay",
    "comment": "Upadate, I thought I got both meds but it’s only Kapvay, I Took it at night for a week then take one during the day I took one during the day and I was very lethargic and sleepy during work so I’m not doing that anymore"
  },
  {
    "medication": "Kapvay",
    "comment": "I used to be opiate dependent and clonidine saved my life in those times. I feel like clonidine addresses the H in ADHD but i dont know about the A i think focus can be easier to channel if you have now controlled hyperactivity but i think itll take a conscious input from you to do so. Where as many find stims auto focus them if that makes any sense."
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/hash-slingin_slashr and thanks for posting on /r/ADHD!\n\nIf you haven't already, please take a minute to [read our rules](https://reddit.com/r/adhd/about/rules) - we will remove your post if it breaks one - and also check out our list of official megathreads [here](https://www.reddit.com/r/ADHD/comments/nu534w/official_list_of_radhd_megathreads_please_check/). If your post fits into one of them, it is likely to be removed; if you think this might happen you can delete your post here and resubmit it there instead.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "I use clonidine at night and find it helpful for sure but I don’t have particularly bad anxiety. I can only take 1/2 tab because of low bp tho"
  },
  {
    "medication": "Kapvay",
    "comment": "So if you take it at night, do you notice it helps the next day with adhd?"
  },
  {
    "medication": "Kapvay",
    "comment": "No, it doesn’t do anything for my adhd really. I take Vyvanse, and short acting dex when I need it, for the adhd bit"
  },
  {
    "medication": "Kapvay",
    "comment": "Gynecomastia was reported in 1% of patients receiving clonidine epidural therapy. It was also reported with oral therapy but causality could not be determined. For guanfacine, there have not been reports of gynecomastia. Based on what I've found, it's extremely rare, even with methyldopa which appears to carry the greatest risk among the alpha-2 agonists."
  },
  {
    "medication": "Kapvay",
    "comment": ">I had male breast reduction surgery and it was very expensive, but it had great results, so I'm very wary of this issue. \n\nDid your surgeon not remove all of the glands? If they did then you're worrying for nothing. Impossible to grow back if all gland tissue was removed to begin with. \n\n>c) if gynecomastia did occur as a result of the med, would it be reversible upon discontinuing it?  \n\nOn it's own? Possible, depending on how far along they develop. With drugs? Entirely possible to reverse."
  },
  {
    "medication": "Kapvay",
    "comment": "Awesome. Also I know you said it's extremely rare, but just wondering in those rare cases, does the gynecomastia go away on its own upon discontinuation of the drug? Or is it irreversible without surgery?"
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks. I'm actually not totally sure if he did the gland removal part. I know my surgeon used liposuction, but I can't remember if he had to do an excision/gland removal in addition.\n\nSo if he only used liposuction, would I still be at risk for redeveloping gynecomastia if that's a side effect of these meds? If so, I'll have to call his office to find out the exact procedure he did.\n\nI'm also just a bit confused by your last sentence - are you saying that gynecomastia caused by drugs is entirely possible to reverse? Or are you saying that there are other drugs that can help reverse drug-induced gynecomastia?"
  },
  {
    "medication": "Kapvay",
    "comment": "Well I know gynecomastia is often used as a blanket term for any kind of \"man boobs,\" but true gyno is swelling of the actual breast tissue/glands. So if you had actual gyno, then some tissue removal was involved. Along with tissue removal, some degree of lipo is almost always involved as well. If you had just lipo, then you had pseudogynecomastia which just means you didn't have any growth of the glandular tissues, hence no need to remove them.\n\nThen, there are differing opinions from doctors on how much gland to remove. If they remove the entire thing, as I was alluding to before, then you should never have to worry again about gyno for any reason because there is no gland to grow.  \nMany (probably most) surgeons don't remove the whole gland, though. They'll remove something like 75-90% of it and leave the rest. The reason for this is that it makes it a lot easier to keep a normal chest shape. If the whole gland is removed there is a chance of having a crater under the nipple where it was.  \nBut this does technically mean that repeat gyno could be possible. The odds are probably lower since there isn't much gland left, but it's still possible nonetheless.\n\nAnd in the last sentence I mean that there are drugs that can reduce/reverse gyno in almost all cases (so long as they are started early enough). I don't want to say much more than that in the open because I think they're mostly off-label uses (and they're usually associated with steroid-induced gyno) and I don't wanna catch a ban for talking about them, haha.\n\nTell you what. I'd say give your doctors office a call when you get a chance to get a little clarification on exactly what was done during your procedure. If it turns out that they left all/some of your glands intact and you want to talk more about some of these potential situations, you are more than welcome to PM me and I'm happy to share what I know.  \nBut realistically, even with intact glands, I don't think you have much to worry about here. u/GoBlue81 already chimed in, but to reiterate, the occurrence of drug-induced gyno from these are very rare, if reported at all. And yes, if by chance you were that 1% that started developing gyno from them, discontinuing the drug is typically enough to stop/reverse it, as long as it's caught early enough."
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks a lot! This was really helpful."
  },
  {
    "medication": "Kapvay",
    "comment": "I use it for sleep. It's very effective and I can't sleep without it"
  },
  {
    "medication": "Kapvay",
    "comment": "Why are you looking to switch from the guanfacine?"
  },
  {
    "medication": "Kapvay",
    "comment": "Guanfacine made my stimulants heaven. Best addition ever. No anxiety, no spiking blood pressure... Smooth as butter. Doubled my a.m. dose and damn I'm feeling great. Its been 4 months and I would never go back.\n\nClonidine, I was on that for 6 months and every time I took it... Sleepy time."
  },
  {
    "medication": "Kapvay",
    "comment": "BP can be tricky.  Mine is always way higher when I get it taken at the Dr's because I get really anxious.  That being said, even at home I have really high blood pressure.  But its definitely more accurate than when I get it taken at a doctors office.  \n\nI would make sure you let your doctor know that all store machines (make sure you use a few different ones, make sure its not just that one machine or something) are giving you those lower readings.  \n\nIf you trust your doctor and he clears you to take those meds, then I would say its probably okay.  But like I said, express your concerns about your average readings outside the office and the fact the meds could lower it further.  Make sure to monitor it often and know the signs of really low blood pressure just in case.  \n\nI don't know how effective they are....I'm sure it varies between people.  I've heard people say they work, I've heard the opposite too...so you can't really know unless you try."
  },
  {
    "medication": "Kapvay",
    "comment": "I use both concerta and clonidine."
  },
  {
    "medication": "Kapvay",
    "comment": "Regarding your bp...why not buy a home bp monitor?  They're not too expensive and they're portable so you can take it into the doctor's office to calibrate it with his/her measurements."
  },
  {
    "medication": "Kapvay",
    "comment": "Remember, when making important decisions about your health it's important to seek the qualified opinion of random strangers on the internet. If you find yourself tempted to ask a professional with 7-10 years of training and 1000's of hours of experience don't do it! They'll only give you some random bullshit opinion on something that worked for them once, or that they read in a magazine while waiting to checkout their groceries. \nTrust your instincts! Go with the herd opinion! Cos how can one person be smarter than a whole bunch of people right! Right! AMIRITE OR WUT!!"
  },
  {
    "medication": "Kapvay",
    "comment": "Wait I have guanfacjne for night.... Weird never taken it in the day"
  },
  {
    "medication": "Kapvay",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Be careful with Benadryl.  I used to take the pills (a generic) for insomnia.  It caused a lot of problems."
  },
  {
    "medication": "Kapvay",
    "comment": "Perhaps the Benadryl decreases mast cell activation syndrome driven inflammation, which could contribute to ADHD symptoms."
  },
  {
    "medication": "Kapvay",
    "comment": "Is it possible that you are also dealing with some anxiety? Hydroxyzine is also an antihistamine that is sometimes prescribed for anxiety. It would likely have a similar effect as Benadryl. Not sure about the long-term effects of taking it."
  },
  {
    "medication": "Kapvay",
    "comment": "If you have allergies, Benadryl may reduce inflammation and thereby calm your nervous system. But it's also a sedative and anxiolytic\n\nIf you find it helpful, talk to your psychiatrist about taking another, safer drug in the same class. It would be great to live without the headaches of relying on a C2 drug."
  },
  {
    "medication": "Kapvay",
    "comment": "I have a combo of straterra and wellbutrin. I hate straterra but it gets the job mostly done.\nIf i took benadryl though id be unconscious for 2 days"
  },
  {
    "medication": "Kapvay",
    "comment": "I just started strattera today, 40 mg. I'm 46, and I was just diagnosed 3 months ago. About 30 mins after I took the strattera, I got the worst hot flash I've ever had and I thought my head was going to explode. Has anyone else experienced this? I am low key afraid to take it tomorrow."
  },
  {
    "medication": "Kapvay",
    "comment": "I’ve used both guanfacine and clonidine. The guanfacine was OK for calming but made my mouth so dry even at the lowest dose. I’m currently on clonidine and I’m not sure how much it’s helping anxiety. It does help sleep to some degree."
  },
  {
    "medication": "Kapvay",
    "comment": "It’s an interesting medication but certainly not one with any uses in treating ADHD. It is somewhat of an anticholinergic which does have similar effects to stimulants such as increased heart rate but it also has sedative effects"
  },
  {
    "medication": "Kapvay",
    "comment": "Benadryl’s active ingredient is also the active ingredient in most OTC sleeping pills. Are you taking it along with your adhd meds or instead of? \n\nIf you’re taking it with your stimulant, it may be that your stimulant dose is too high and Benadryl is reducing your side effects. \n\nIn either case, I think you’re right to consider trying a non-stimulant for adhd instead. There are several different types that work in different ways, so if the first one doesn’t help, try a different one, and keep trying. Every body is different, so sometimes trial and error is all we have. Good luck finding what works best for you!"
  },
  {
    "medication": "Kapvay",
    "comment": "Maybe you have allergies that is causing ADHD like symptoms or making it worse and the Benadryl is reducing symptoms"
  },
  {
    "medication": "Kapvay",
    "comment": "I wish! Complete opposite. I take the generic equate (Walmart) brand sometimes to help my insomnia and 2 knock me the fuck out! I mean I could be robbed and never know it. This coming from a light sleeper."
  },
  {
    "medication": "Kapvay",
    "comment": "It does not help with my adhd whatsoever but definitely helps with my allergies!"
  },
  {
    "medication": "Kapvay",
    "comment": "Might be some sort of mast cell disorder. I have some sort and my doc told me to take pepcid and Claritin. It feels like when ur sick and then u wake up one day and u realize ur not sick anymore. Like an insane amount of Clarity and focus. But not like ur high. Just more of a feeling that I'm in control. It honestly feels more effective then the 54 mg of concerta I'm on"
  },
  {
    "medication": "Kapvay",
    "comment": "I've briefly used clonidine. It takes time to build up in the system. You'll have much lesser anxiety and that takes work / home pressures much less stressful. you'll not notice the results when your on it. But once you stop it, you can feel that it was helping. Be careful with tapering and frequent monitoring of your blood pressure. (The usual stuff)"
  },
  {
    "medication": "Kapvay",
    "comment": "Just note that there has been research linking long-term use of Benadryl to an increased risk of dementia in older adults. I try not to use it unless absolutely necessary."
  },
  {
    "medication": "Kapvay",
    "comment": "Thank you all who mentioned Mass Cell Activation Syndrome. This would explain my life the last few years. I have a lot of other health stuff going on that wouldn’t really fit this subreddit. Stuff I thought was normal with me just getting older. I will be seeing an allergist for the first time in my life and see if I have something like that going on. I appreciate all of you."
  },
  {
    "medication": "Kapvay",
    "comment": "Yes! I'm clenchy, a lil shakey but quite productive.  I took a low dose adderall once from a friend and it feels the same.  I was quite productive that day but the next day it felt like a dream almost.  Im on 300mg of bupropion.  COMT fast metabilizer here. Too much of the Ben and it makes me restless and not sleep."
  },
  {
    "medication": "Kapvay",
    "comment": "If you don’t mind my asking: What kind of problems?"
  },
  {
    "medication": "Kapvay",
    "comment": "Definitely. It’s not something I plan on taking frequently or long term. I know back when I use to have regular panic attacks they were a life saver. Don’t really have that issue anymore though. Currently exploring for a healthier  alternative."
  },
  {
    "medication": "Kapvay",
    "comment": "Very possible honestly. I don’t really feel like an anxious person.. or maybe I’ve dealt with it for so long that I’m use to it?"
  },
  {
    "medication": "Kapvay",
    "comment": "I didn’t notice a whole lot of differences with Wellbutrin. But now that I don’t take it anymore I’m beginning to think otherwise lol"
  },
  {
    "medication": "Kapvay",
    "comment": "I was thinking of a mast cell disorder. But I like ur train of thought. I take pepcid and Claritin for mast cell issues and it feels more effective than my ADHD meds"
  },
  {
    "medication": "Kapvay",
    "comment": "Also worth noting this began around when Covid started."
  },
  {
    "medication": "Kapvay",
    "comment": "I'm prone to parasomnia.  \n\nI've walked, cooked, eaten meals, cut my toe nails until they bleed, had full conversations, walked into the wrong apartment in the middle of the night, had hallucinations, suffered intense sleep paralysis, suffered extremely intense nightmares, and much more, all while sleeping.  Benadryl greatly heightens the probability and severity of this for me.\n\nThe grogginess in the morning isn't great either.  But that's small beans compared to playing detective and putting together the pieces of my nocturnal activities.\n\nYou can also become quite dependent on the Benadryl pills.  For a while, it was the only way I could sleep.  And it was not a very satisfying sleep."
  },
  {
    "medication": "Kapvay",
    "comment": "The Hatman will come and you owe him $12"
  },
  {
    "medication": "Kapvay",
    "comment": "I took wellbutrin a few years ago prior to being diagnosed and it was the only antidepressant that made a dent in my depression. It makes a small change in the adhd but combined with the straterra makes a more significant change in depression while nothing else did. So basically I kept it around for the sad"
  },
  {
    "medication": "Kapvay",
    "comment": "Ive taken multiple types of meds before landing on what feels like the best for me.\n\nFirst off, ssri are the devil. Make me feel like a zombie and disconnected, more depressed and adhd than ever. I could not tolerate any of the ssri after a certain degree. \n\nLike the other commentor here, strattera/wellbutrin felt like the best combo for a minute, but i suddenly started experiencing anhedonia and nightmares that went away with discontinuing strattera. Sucks because it felt like nothing but then I was just ... Living. If i had kept feeling that way id likely have never swapped back to a stimulant.\n\nIve tried stimulants alone and they increased my anxiety and agitation... Mix in a trauma and i nearly went through psychosis. \n\nNow im on wellbutrin and vyvanse and i feel the closest to normal than i ever have. No insane anxiety, regular appetite, good focus, etc."
  },
  {
    "medication": "Kapvay",
    "comment": "Praise be the wellbutrin. My doctor threw me on a couple of SSRI/Anti Depressant/anxiety combos to no avail. Almost all of them just made me feel like i was disconnected. Like im watching the most boring, uneventful human being choose to not live life. ADHD catastrophized. \n\nWellbutrin however made me genuinely appreciated some of life again. Even if i didnt have stimulants to help me out, i think wellbutrin controlled my emotional regulation enough that life was wuitte alright."
  },
  {
    "medication": "Kapvay",
    "comment": "Completely agree with your comments on SSRIs.  They ARE the devil.\n\nThey turned me into an unfeeling shell.  As if ADHD isn't bad enough, the amount of stimulation I craved turned me into a completely different person.  And at the time, I wasn't diagnosed with ADHD yet and didn't understand my destructive and self-sabotaging behavior.  My decision making was abhorrent and I made some terrible life choices at that time.  I had no idea what I was doing but thought that I did.  But I had no self awareness and was very disconnected... from myself, from my family, from my emotions, from my own thoughts, from my whole life, and from reality.\n\nI stumbled through life like a drunk zombie for years until I went through a cancer ordeal.  After that, I realized that I wasn't really experiencing life and just going through the motions.  (What's the point of surviving cancer if you're not really living, right?)  I'm not sure how that brief moment of clarity and awareness slipped through.  But I'm glad it did.\n\nI went off of SSRIs cold turkey and every emotion was so heightened and exquisite.  Even the painful depression and realizations of a life thrown away made me appreciate just being able to feel again.  I've never felt so aware and alive before or since then.  It was like waking up from a nightmare that I was trapped in and just being relieved to finally be awake.  The thing about the nightmare though, is that during it, it felt almost normal (until it didn't).\n\nI wouldn't recommend that to anyone (dropping SSRIs cold turkey).  But I needed it.  And I think it made me stronger as a person overall.  \n\nI still had to pick up the pieces.  And in a way, I still am.  There will always be reverberating repercussions from that time in my life."
  },
  {
    "medication": "Kapvay",
    "comment": "Yup!! Took the edge off and I could actually manage myself. I'm a biggggg fan of wellbutrin. Also helped me stop binge eating"
  },
  {
    "medication": "Kapvay",
    "comment": "Its kind of an amazing thing. It increased my appetite personally, which is great because i am/was quite underweight! On stimulants which prior to wellbutrin completely killed my appetite. I mean like... 0 feeling of hunger regardless of how long itd been since ive ate. \n\nMeanwhile, wellbutrin comes in and suddenly i am at what i imagine an average appetite looks like, maybe even a little more hungry than i should be, but ill take it. 😅"
  },
  {
    "medication": "Kapvay",
    "comment": "Ay if it works it works!!"
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/UsernameTakenGG and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Checking in to see how you are doing. Have you found something that works for you?"
  },
  {
    "medication": "Kapvay",
    "comment": "Wellbutrin gives a lot of energy to do stuff but the motivation has too come from within (or stimulant adhd med)"
  },
  {
    "medication": "Kapvay",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "I take 150 mcg clonidine IR nightly and experienced rebound anxiety when taking dex in the morning. After adding 50 mcg clonidine in the morning, the rebound anxiety is gone. However, I still have some in the afternoon, so I might take it 3 times a day... Unfortunately I'm not aware of extended release clonidine in the UK."
  },
  {
    "medication": "Kapvay",
    "comment": "you could try splitting the dose up by 50 mcg every 8 hours to avoid rebound effects"
  },
  {
    "medication": "Kapvay",
    "comment": "Which clonidine do you take? Also instant release?"
  },
  {
    "medication": "Kapvay",
    "comment": "Instant release. I don’t think there’s extended release clonidine in the UK."
  },
  {
    "medication": "Kapvay",
    "comment": "Yep. Gonna ask my psychiatrist about moving to 3 times daily instead of just morning and night. Since you're the only other person I know taking the IR for ADHD I thought I'd ask: do you notice withdrawal from the clonidine if you miss a dose? i.e. you miss you're evening dose. for me i'm trying to figure out if this evening tiredness/spaced out feeling is from the Clonidine wearing away or potentially caffeine."
  },
  {
    "medication": "Kapvay",
    "comment": "I try not to miss a dose as it is advised against due to rebound hypertension. Tapering off with doctor's supervision could be an option and BP monitoring.\n\nAlso serum levels on IR is quite spikey compared to ER, see [page 10](https://www.accessdata.fda.gov/drugsatfda_docs/label/2020/022331s021lbl.pdf). That might play into rebound during the day, and that's why I'm considering to take it 3 times to even out the spikes a bit better."
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/BuffaloOk5195 and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "I'm on generic wellbutin. I exercise more now than I did before.  Mostly because I can remember it now.  Your mom is full of crap."
  },
  {
    "medication": "Kapvay",
    "comment": "Um as a psych nurse I can tell you that is not my experience. I have more motivation and more focus for the things I enjoy. Your mom is perpetuating a stigma that I hope she doesn’t use on her patients."
  },
  {
    "medication": "Kapvay",
    "comment": "Medication is kind of a numbers game eventually you’ll find something or a combination of things that works for you. Sometimes it happens first try and sometimes you have to try a few different ones. No ADHD meds have zombified me yet. Wellbutrin stopped a lot of my bad impulse control like binge eating and spending and adderall gave me the ability to start things as well as actually finish them! I found myself much more healthy and active. The only meds that zombify me are SSRIs and those work for a lot of people. Everyone is different."
  },
  {
    "medication": "Kapvay",
    "comment": "I take Wellbutrin in addition to adderall. Wellbutrin definitely doesn’t zombie me. It’s actually a peppy antidepressant and often sets of anxiety in some people. I don’t even have depression, it’s there just for ADHD to help smooth out the adderall ups and downs. I have zero complaints about Wellbutrin."
  },
  {
    "medication": "Kapvay",
    "comment": "Although it is important to notice that different people may react differently to different stimulants, it is improbable that every medication you try is going to make you sleepy or like a zombie. It is even less likely that they are going to damage you permanently. You could always speak with a professional about it and see the pros and cons to decide if you even want to be medicated at all.\n\nWhen deciding to take medication you have to take into account how severely does ADHD interfere in your life. Do you think it's worth any potential risks in order to achieve the benefits of the medication? Many people think so, including me."
  },
  {
    "medication": "Kapvay",
    "comment": "Your mom is absolutely wrong. It’s troubling that she has this attitude.  Far from damaging one’s brain, stimulants generally enhance one’s brain.  Of course it’s necessary to find the one that works for you.  https://youtu.be/HYq571cycqg"
  },
  {
    "medication": "Kapvay",
    "comment": "If you are anxiety-prone, I’d avoid Wellbutrin, however if you are depression-prone, it can be great. Remember these meds take time to work, and most meds have a mild side effect (dry mouth, insomnia at initiation of therapy) that diminishes with continuation of that med or to which you become accustomed because the overall benefits are greater. If the negatives outweigh the positives, or there are no positives at all, you can stop the med *after consultation with your provider* (the meds you listed require tapering).\nThese meds do *not* change you brain or alter the structure of your brain! They improve or delay absorption or reabsorption of neurotransmitters, the chemicals that allow your neurons to speak to each other. \n\nYour mom should not be practicing in her field of specialty if she has such antiquated, false beliefs about medication. Most psychiatric NPs specialize in medication management, and their education reflects that, so just know your mom is an extreme outlier.\n\nNone of her opinions have any basis in evidence based medicine. These are old-fashioned, idiotic concepts inspired by the idea that developmental disorders and mental illness can be “fixed” by hard work and pseudoscientific BS.\n\nBe your own savior and good luck!\n\nETA: “zombie” or “robotic” behavior is usually indicative of OVERmedication, not therapeutic use.\n\nETA: I take Wellbutrin and adderall."
  },
  {
    "medication": "Kapvay",
    "comment": "You know what helps these thoughts? \n\nEducating yourself. \n\nGive it a Goog. Research the meds and their side effects. \n\nDr. Richard Barkley is the best place to start."
  },
  {
    "medication": "Kapvay",
    "comment": "Do you think you NEED the meds?\n\nADHD meds are stimullants, so you will have MORE energy with it than without it.\n\nGonna tell my case a bit, i used Vynvanse, and it was shocking how much I could work and function with it..., but at the end of the day, or weekends that i didn't take it i would collapse, my brain would simply stop working. I hated the feeling that I need the meds to work, and decided to stop completely and just deal with my problem, therapy and trying to change my outlook on life and work. It is not being easy. But i hate the meds and I feel better now without it..., I will not sink my mental health on meds because of work and money."
  },
  {
    "medication": "Kapvay",
    "comment": "Those sound more like the risks associated with antipsychotics than like those for adhd treatments... i think she might be confusing the two. you should look up the side effects associated with each drug (as they all vary) and see for yourself the risks associated with each."
  },
  {
    "medication": "Kapvay",
    "comment": "I cant sleep when its active n not a zombie on Adderall"
  },
  {
    "medication": "Kapvay",
    "comment": "Thx for your response, that gives me a little bit of hope!!"
  },
  {
    "medication": "Kapvay",
    "comment": "Interesting, I'll take a look into that. Thx"
  },
  {
    "medication": "Kapvay",
    "comment": "Wellbutrin sent my anxiety off the charts, but it works great for others."
  },
  {
    "medication": "Kapvay",
    "comment": ">Thx for this message, it truly is confusing when never trying medication before, fear of the unknown, I guess. I'll try to see if I can get a low dose or talk to a professional more."
  },
  {
    "medication": "Kapvay",
    "comment": "You’re not gonna get permanently damaged, I’m not a doctor but I’ve taken a lot of drugs, and I’m well… I’m okay 😅. \n\nMaybe it will hearten you to know that none of the drugs you mentioned are proper stimulants besides Wellbutrin. \nThe specific drugs you mentioned though COULD make you tired, so if that’s a concern you should mention it to your doctor, specifically the last two. Let me point out that it’s an issue with some of the specific drugs you mentioned, not every adhd pill.\n\nLet me assure you: you are not going to become a zombie. If anything you’ll become more goal oriented because you’ll actually be able to follow through with things. Get treated, whether that’s with medication or with therapy or both. Untreated adhd is not good."
  },
  {
    "medication": "Kapvay",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Also to add- (34M)\n\nNot sure if it was the culprit, but I believe the Concerta caused the influx of visual aura (zigzag zebra-like colorful C-shaped pattern disturbance in field of vision, usually without headache/migraine but occasional co-occurrence) that I'd experienced only a few times in the past from age 18-this year (33 when it happened again) but never as frequent. From roughly Feb-May it happened about 6x but more frequently like a couple days in a row or every other day earlier on.\n\nI've been pretty bummed about not tolerating the stimulant well as I feel like it was pretty effective and have wondered if retrying Concerta or another formulation like Focalin might help? Just still concerned about side effects but also still find it weird that I didn't notice any while on the Concerta at either 18 or 36mg, or somehow don't recall anything negative like even elevated HR.\n\nI officially see the psych again in Feb."
  },
  {
    "medication": "Kapvay",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "I'm on clonidine but as a sleeping aid. In my case it's a bit of a hit or miss. I guess it depends on how much energy I expend throughout the day but I do have long stretches where I do sleep through the night and then times when I still get up at 3am and my brain instantly snaps to."
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/IsraelZulu and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\n**If you are posting about the US Medication Shortage, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).**\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Hey curious about Modafinil? What about it did not work? I ask because Armodafinil is more potent with less side effects. As for insurance, yes it won’t cover it. I found SingleCare (similar to GoodRX) will make it cost 32.00. Also, with *modafinil, less is more. What dose did you start on?\n\nArmodafinil has been a godsend, unfortunately I crash half way through the day now and a second dose won’t change it. (I was splitting my dose in 2). \n\nLucky for me my psychiatrist is awesome. So I take my half dose of Armodafinil in the AM. For about 4-5 hours I’m a focus machine, then I suddenly get tired. We arranged so when I start to feel that fatigue coming on I take a small dose of Adderall IR. (5mg) It keeps me going the rest of the day. I was a little scared at first to mix the two, but my heart rate only went up about 6-8 BPM. The combination works well. \n\nLikely you were prescribed the Wellbutrin because it inhibits the reuptake of norepinephrine. For me personally a boost of that particular neurotransmitter helps since it’s function is alertness and arousal."
  },
  {
    "medication": "Kapvay",
    "comment": "I don't recall the dose off-hand - I'd have to look it up. I just pretty much felt no effect at all from it.\n\nAlso, mid-day doses usually don't work for me. ADHD brain just doesn't let it consistently happen. \"When I get up\" and \"when I go to bed\" are dead-simple triggers that are always going to happen, and will usually be at least 4 (normally 6-8+) hours apart, so that's what I stick with. Of course, most ADHD meds are daytime meds (oddly, Intuniv was a bedtime med), so that means I need something which I can take once in the morning and have last all day."
  },
  {
    "medication": "Kapvay",
    "comment": "Used to be none. Recently, I've developed a dry mouth that I can't pin down. Strattera makes that worse."
  },
  {
    "medication": "Kapvay",
    "comment": "Same active ingredient as Adderall, from which withdrawal is almost instantly worse than non-medication? Pass.\n\nThe drugs I was on before making the original post here took a good few days to hit the rebound extreme that Adderall can cause after just one missed dose.\n\nSince this post, I've tried Xelstrym (finally hit the market while I was waiting on other things to process). That looked promising, until I developed an allergic reaction to it. Pretty sure it's a skin allergy to the patch adhesive - not an actual allergy to the drug.\n\nNext up is Qellbree - works on similar mechanisms as Strattera, but I'm hoping it won't bring the dry mouth."
  },
  {
    "medication": "Kapvay",
    "comment": "This whole thing just seems strange to me. You’ve found a med that works, Adderall, but you have to remember to take a second dose. Your only issue is remembering to take it. I assume you have a phone, sounds to me like all you need to do is set a daily reminder in it. There are so many people that have not found drugs that work for them that would probably kill to be in your position. I’m sorry but unless I’m missing something this just seems like a non-issue."
  },
  {
    "medication": "Kapvay",
    "comment": "I’m curious, how long has the dry mouth persisted for since you’ve been off the meds?"
  },
  {
    "medication": "Kapvay",
    "comment": "I don't want a med that I need to worry about having hard withdrawal from just for missing a dose, or from skipping doses or shifting my schedule like I usually do on weekends. When Adderall wears off for me, it's not just that I'm off the meds and back to being \"unmedicated me\" - I'm so far off that I'm worse than before I ever started taking anything."
  },
  {
    "medication": "Kapvay",
    "comment": "Months. I've lost track. I'm not entirely convinced the meds caused it, nor that they didn't. It's better when I'm off them, but still persistent nonetheless. I'm still pestering my doctor to point me in a direction that will lead to diagnosis. Tested negative for Sjögen's syndrome already."
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/GullibleStrain9611 and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "stimulants did work for me but they gave me awful side effects, so I’m on a non-stimulant now called Qelbree. since stimulants worked for me idk how well this would apply to you, but qelbree works really well and I don’t experience any side effects! I have no idea how it works lol but I’m not gonna look a gift horse in the mouth."
  },
  {
    "medication": "Kapvay",
    "comment": "I was put on a non stimulant first, Guanfacine 2mg, didn't notice much of a change after 6-8 weeks. I am now on Vyvanse 20mg and Guanfacine 2mg and it seems to be going well for me.\n\nMy psych has asked a few times if I want to try to wean myself off of the Guanfacine, but I don't because the combination of both seems to be holding me together quite well currently.\n\nI hope you find a medication or combination of medication that works well for you!"
  },
  {
    "medication": "Kapvay",
    "comment": "What are the non-stimulant adhd meds?"
  },
  {
    "medication": "Kapvay",
    "comment": "Strattera made me (didtractingly) suicidal and mopey, so I went back to the adderall."
  },
  {
    "medication": "Kapvay",
    "comment": "2 questions:\n1- Is Qelbree basically the same as Strattera ? Are the both one and the same but with different names ?\n2- How does it compare to stimulants? Does it completely fix all of your issues with ADHD ? Also how long before you felt the benefits?\nMuch appreciated"
  },
  {
    "medication": "Kapvay",
    "comment": "I’m not currently taking any non-stimulant meds for ADHD.\n\nSome common ones I’ve read about are:\n\nStrattera (atomoxetine)\nIntuniv (guanfacine) \nKapvay (clonidine) \nQelbree (i.e. SPN-812)\nWellbutrin (bupropion)\nEffexor XR (venlafaxine)\n\nI’m leaning towards discussing with my doc the option of Kapvay (clonadine) as a non-stim med to add to my regimen.\nHoping to hear some testimony from other ADHDers who’ve used non-stim meds and how they have or haven’t helped, before that conversation happens though. :)"
  },
  {
    "medication": "Kapvay",
    "comment": "I’ve never taken strattera but I know they’re not exactly the same. according to the internet their main difference is qelbree is extended release. \n\nreally the only difference between that and a stimulant (for me, and I’ve taken a lot of different stimulants but only the one non-stimulant) is you feel good all the time as opposed to that high that steadily trickles out of your system over the course of the day. and you take it every day to keep it in your system. obviously it’s not a cure-all but I can be a fairly functional college student which I def wouldn’t be able to do unmedicated. \n\nI’m not sure about the last question cause I first started taking qelbree when I was still on a stimulant in hopes of there being less of a drastic difference. and that seemed to work, by the time I went off the stimulant I was functioning exactly the same as before just without the awful jitters etc. so I’d recommend doing it that way if you can."
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/Kinark and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\n**If you are posting about the US Medication Shortage, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).**\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "I recently read a case study where a guy needed, like, 372mg of Ritalin a day. Worked amazing for him!"
  },
  {
    "medication": "Kapvay",
    "comment": "Are there not long release versions of ritalin available?"
  },
  {
    "medication": "Kapvay",
    "comment": "The same thing is happening to me. 10mg Ritalin is only lasting 1.5 hour as well! Long lasting gives me the worst crash ever, i never want to feel that again. Adderall is virtually impossible to get in Texas and that used to last me 3-4 hours. \n\nI am beyond shocked at how this is only lasting 1.5 \n\nAre you still taking it every 2 hours? I think that’s the only thing i can do to get thru the work day. \n\nAt the 2 hour mark my brain feels foggy and i feel really slow.\n\nI should note i also have a faster metabolism\n\nAlso the concerts might last you about 4 hours, so you’d be taking less pills"
  },
  {
    "medication": "Kapvay",
    "comment": "Yes, there is. There’s Concerta 40mg, but then I’d have to take one every other hour. It’d be more convenient, but Concerta is much MUCH more expensive than Ritalin unfortunately :("
  },
  {
    "medication": "Kapvay",
    "comment": "Please be aware that RSD, or rejection sensitivity dysphoria, is not a syndrome or disorder recognised by any medical authority. \n\nIt has not been the subject of any credible peer-reviewed scientific research. It is not listed in either of the top two psychiatric diagnostic manuals, the DSM or ICD. It has been propagated solely through blogs and the internet by William Dodson, who coined the term in the context of ADHD. This means that Dodson, his explanation of these experiences, and claims about how to treat it all warrant healthy skepticism.\n\nHere are some scientific articles on ADHD and rejection:\n\n* [Rejection sensitivity and disruption of attention by social threat cues](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2771869/)\n* [Justice and rejection sensitivity in children and adolescents with ADHD symptoms](https://pubmed.ncbi.nlm.nih.gov/24878677/)\n* [Rejection sensitivity and social outcomes of young adult men with ADHD](https://pubmed.ncbi.nlm.nih.gov/17242422/)\n\nAlthough r/ADHD's rules strictly disallow discussion of other 'popular science' (aka unproven theories), we find that many, many people identify with the concept of RSD, and this post has therefore **not** been removed.  We do not want to minimise or downplay your feelings, and we find that many people use RSD as a shorthand for this shared experience of struggling with emotions. \n\nHowever, please consider using the terms 'rejection sensitivity' and 'emotional dysregulation' instead.\n\nYour post hasn't been removed, and this is not a punitive action. This comment is meant solely to be informative. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Clonidine is a blood pressure medication. Your BP is just low in the morning so you feel dizzy, drink some juice or coffee with sugar."
  },
  {
    "medication": "Kapvay",
    "comment": "Is there any reason you're on clonidine and not guanfacine? The latter is typically much more neuro/cerebral affecting. Still, it seems some people get a better benefit from clonidine, especially if they have sleep or anxiety issues."
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/Azipear and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "I just started the same dose at night. It has seemed to make me drowsy in the morning also. I take Vyvanse during the day but I recently learned it can take up to 2 hours to start working in the morning also. Also medicalnewstoday says clonidine can last 12-16h. I don't really have time to be sleeping or drowsy for that long. If it really lasts 16h I would have to take it before the end of the workday in order for it to be worn off by the time I wake up the next morning. I'm hoping its not like this for others. You take it at 10:45p and then are drowsy until mid-morning the next day? Have you noticed how long it seems to last for you?"
  },
  {
    "medication": "Kapvay",
    "comment": "Did your pharmacy give you a different generic when you got a refill? Some generic \"brands\" can vary quite a bit - I have this problem with lamictal. Just started clonidine tonight. Hope you figured out what's best for you!"
  },
  {
    "medication": "Kapvay",
    "comment": "I asked my doctor about both, and she chose clonidine.  I've heard what you're saying, and I'll ask about making the switch.  Now, I was already on a blood pressure medication (low dose), so she may have decided to go with Clonidine since it's a BP med and could possibly help my RSD.  I transitioned off the BP med I was on, of course, while my BP was closely monitored over a couple weeks to make sure everything was working properly."
  },
  {
    "medication": "Kapvay",
    "comment": "Well, after 3 months I stopped taking it after speaking with my doc.  I just couldn't handle being a zombie until \\~10:00AM every day.  For me, I had about 15 minutes after I took the Clonidine before I was out like a light.  In fact, it worked so well that it was quite handy on a 2-week vacation during which my wife, daughter, and I were in the same hotel rooms for much of it.  They like to go to sleep 1-2 hours before I do, so I'd take my Clonidine while they brushed their teeth and bam, next thing I know it's morning.  My plan is to spend at least a month off of it to return to baseline, and maybe try Intuniv.  However, I believe the same thing will happen.  Good luck!"
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks for replying, but I ended up getting off the clonidine shortly after I posted that.  It didn't help my condition, and it made me super sluggish.  I hope it works better for you.  Fortunately, I'm gaining some control of my RSD via CBT.  I'm getting better and recognizing when it kicks in, but it's not all peaches and sunshine by any stretch."
  },
  {
    "medication": "Kapvay",
    "comment": "Everyone’s different. I settled on Clonidine after trying guanfacine. Guanfacine made me exhausted to the point of not feeling my Adderall. It also gave me headaches and I ‘may’ have been more irritable on it. Hope you get everything sorted out."
  },
  {
    "medication": "Kapvay",
    "comment": "Keep us posted. I am looking for a non stimulate med to take along side Focalin.  (I tried adderall and didn't like it).  Focalin helps, but not 100%. I've also tried Strattera which helped a lot, but my libido was in the dumps and my ears were ringing and I just couldn't do it anymore. \n\nI'm also an engineer, so I need to be able to focus.  I'm struggling. I've not been finishing my work on time and it's taking me forever to get anything done."
  },
  {
    "medication": "Kapvay",
    "comment": "Did you find anything that works? I'm also looking for a stim + non-stim combo"
  },
  {
    "medication": "Kapvay",
    "comment": "That's absurd!  I would find a new psych doc if they are unwilling to accommodate you during this ridiculous shortage that is not of any fault of your own.  I have heard that non-stimulants don't work as well."
  },
  {
    "medication": "Kapvay",
    "comment": "She said that a lot of the pharmacies are beginning to stop filling rx's if people are shopping around. Idk if it's a colorado thing"
  },
  {
    "medication": "Kapvay",
    "comment": "That sounds like an excuse so she doesn't have to keep writing prescriptions because there is no way different pharmacies are even aware of your prescription if the doctor cancels it and writes a new one.  I still think that is ridiculous and I would flat out tell my doctor that."
  },
  {
    "medication": "Kapvay",
    "comment": "She did it for a bunch of us for a few months, she part of a larger network. anyway this wasn't the point of my post"
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/coldfries_69 and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Hey\nI am from Iran.\nHere diagnosis of ADHD are pretty normal and common.\nbut most parents prefer non-medication treatments such as CBT, neurofeedback and behaviour therapy, except for children with hyperactivity which methylphenidate usually will be prescribed.\nStimulant medications in Iran are limited to methylphenidate, some drug stores dont have the permit to sell Ritalin and its highly regulated by the government.\nBut getting prescription from a psychiatrist isnt usually difficult, I know two friends of mine got prescription of Ritalin only for studying as cognitive enhancer!\nthe medication treatment are usually methylphenidate and SSRI/SNRI combination for ADHD."
  },
  {
    "medication": "Kapvay",
    "comment": "UK. We have methylphenidate IR, concerta and strattera. I think we also have vyvanse/elvanse although that is rare. Adderall is not used as far as I know.  \n\n**Diagnosis & process**\n\n\nGeneral process is quite good. I was lucky to get a really understanding Doctor (after being completely rebuffed by an old-fashioned 'nothing is wrong with you/ ADHD isn't real type') who really listened and cared. First tried CBT and it was clear it wasn't working so next was medication. Getting medication was quite simple,he could see I wasn't vying for the drugs after having volunteered for the CBT treatment first. He gave me a choice of drugs: methylphenidate IR, Strattera or concerta and told me the basics of the drugs and what they do and told me to research and come back with my choice (Ritalin first then moved to concerta).\n\n\n\nThere is a medication review every 6 months where you come in and have your BP measured and have a general chat of how you have been getting on/any problems.\n\n**Drug cost**\n\n\nNHS pays for our medicine and you only have to pay £8.20 general prescription charge regardless of the drug. So I pay £8.20 for three bottles (90 pills) of concerta 18mg. Really really blessed to live here, especially since I wasn't born here and would never in a million years have been diagnosed back home! It motivates me to do my best in life to pay back into the system so other people can have the same experiences and access to treatment that I have had."
  },
  {
    "medication": "Kapvay",
    "comment": "Australian here. I (35f) was diagnosed as an adult a few years ago now. We have Ritalin and dexamphetamine available on our Pharmaceutical Benefits Scheme for treating adult ADHD.\n\nWe very recently introduced Vyvanse, but it's not on the PBS yet, so it's relatively expensive compared to dexamphetamine, which is the pure active ingredient in Vyvanse, afaik.\n\nFor children aged 6 and above, Ritalin is available in all its forms - short-acting (Ritalin), Ritalin LA (extended release), and Concerta (long-acting - 12 hours). Yes, all of these are methylphenidate, but I've never seen a generic version of any of them. \n\nAuthorised doctors are able to write private scripts for these medications if they are not available on the PBS, but the patient will need to pay the non-subsidised price.\n\nOther non-stimulant medications are not typically prescribed to treat ADHD, per se, but may be prescribed for co-morbid conditions, I guess. Strattera is not well-known here in Australia, definitely not as an ADHD treatment, and not as an antidepressant, either. I've never heard of the others you mentioned - guanfacine and clonidine.\n\nAustralia is conservative when it comes to public health matters. Drugs which have a controversial safety profile are readily nixed (Wellbutrin as an antidepressant, for example). Unnecessary or unproven drug treatments aren't likely to make it onto the PBS, meaning very few prescriptions will be filled, even if the drug is available and cheap. I'm guessing that's why non-stimulant medications, like Strattera, are not prescribed to treat ADHD here.\n\nStimulant medication seems to be the gold standard pharmacological treatment for ADHD, worldwide, and the Australian government isn't going to subsidise non-stimulant medications unless they have an equivalent track record of safety, efficacy, and cost effectiveness."
  },
  {
    "medication": "Kapvay",
    "comment": "Hi, I'm from **Kazakhstan**, Astana (capital). General population has no awareness of ADHD whatsoever. Psychiatrists has a blur idea of ADHD in children (mostly meaning that it is hyperactive child). \n\nWe had Concerta back until 2011 (as I found recently in archives), but (I guess due to lack of demand) they didn't renew their registration to sell in here. \n\nYou can carry Strattera from neighbor Russia (semi-legally). \n\nNo medication whatsoever is available, no CBT, no awareness.\nI hope to change it."
  },
  {
    "medication": "Kapvay",
    "comment": "In Canada you can get all the stimulant/non-stimulants meds and there are some research into non traditional medication options."
  },
  {
    "medication": "Kapvay",
    "comment": "Here in Argentina getting diagnosed is pretty difficult. Especially as an adult because there are very few psychiatrists who believe in adult ADHD.\n\nTreatment depends on what the doctor believes is best for you. Kids, especially those with severe ADHD and other disorders, usually do CBT and have special teachers that help them in school, plus medication. Adderall and other kinds of similar meds are illegal. Methylphenidate and atomoxetine are legal and are what is usually used to treat ADHD, coupled with some other meds (like antidepressants, anti-anxiety, etc) depending on the severity of the disorder and other disorders the patient has. I'm taking atomoxetine and quetiapine because I'm very impulsive, anxious and moody and the doctor thought methylphenidate would only make it worse.\n\nADHD is classed as a disability meaning if you want to spend months filling paperwork and busting your ass (because it's not easy to do with any disability), once you're classed as disabled your health insurance should cover 100% of all your treatment and meds, so that's pretty cool. Treatment for ADHD is very expensive (my doctor and my meds account for 25% of my boyfriend's earnings per month, or 100% of what I earn in a month) so not everyone can afford it. My boyfriend is definitely ADHD-PI but we don't have the money to diagnose and treat him. Likewise for my mom and aunts who all have ADHD."
  },
  {
    "medication": "Kapvay",
    "comment": "Netherlands. Once you are into treatment it is okay. Getting into treatment is a pain though the queues are usually 3 months+ if you want to get into the federal treatment center you need to wait 6+ months. Once you get there its okay. CBT is offered but not as frequent as it should be, because (a lot of) insurance companies really nail down on the smaller psychiatrist with the budget they can spent each year (practically it's too small). You basically have to go to the smaller ones though or you'll have to wait 6+ months. This wait time goes for all mental disorders that need treatment by professionals.\n\n &nbsp;\n\nThe medication list looks like this:\n\n* Methylphenidate (XR, IR and Concerta)\n* Dextroamphetamines (IR and no XR)\n* Atemoxetine\n\nThen off-label would be:\n\n* Modafinil (won't be easy to get I think)\n* Clonidine\n* Bupropion (Wellbutrin)\n* Fluoxetine (Prozac)\n* Vortioxetine (Brintellix) (I don't know how it works for ADHD, but it does a lot of stuff in your brain and some areas are definitely related to ADHD and it's a novel AD)\n* Amitryptiline (fuck people who actually prescribe this for ADHD)\n* Other ADs\n\nWhat we don't have:\n\n* Dextromethylphenidate (XR): I can't seem to get it but I've read reviews about people taking it in the Netherlands I don't know where to get it though. Which sucks major balls, because it could be my miracle pill. Ritalin is the only thing that really 'fixes' my ADHD, but it makes me anxious and gives me (increased/very severe) insomnia.\n* Adderall (XR)\n* Guanfacine (IR and XR (Intuniv))\n* Vyvanse/Elvanse\n\n &nbsp;\n\n***If anyone from the Netherlands could help or direct me on how you got or on how I can get dextromethylphenidate (import is okay too) I would be forever grateful.***"
  },
  {
    "medication": "Kapvay",
    "comment": "In Denmark treatment with methylphenidate, lisdexamfetamine (30, 50 and 70 mg) and atomoxetine is possible. Once you've been diagnosed you usually start out with methylphenidate and if that doesn't work well enough you move on to lisdexamfetamine and then atomoxetine.\n\nI'm on lisdexamfetamine currently. I can't really decide on whether it works as intended or not, but that's a topic for another thread."
  },
  {
    "medication": "Kapvay",
    "comment": "Anyone from India here? Would really appreciate the help. I'm not diagnosed yet but almost every post here resonated with me, I'm terribly inattentive, have a hard time remembering things if they're like more than two. And I'm unorganised as they get. All of this has worsened in the past few years and I really need help. Thanks!"
  },
  {
    "medication": "Kapvay",
    "comment": "Sweden. We have\n\n* methylphenidate (Concerta, Ritalin, Ritalina, Medikinet, Equasym)\n* Elvanse (Vyvanse)\n* dexamphetamine IR only (Attentin)\n* Strattera\n* we got Intuniv last month\n* Some also get bupropion\n* Modafinil is really rare but I have met someone that does take that for their ADHD aswell."
  },
  {
    "medication": "Kapvay",
    "comment": "I was diagnosed as an adult in Australia. It was a fairly simple process - no lengthy testing, just a discussion of my life history with a psychiatrist.\n\nI don't know which other medications are available, but I've tried extended-release Ritalin and Vyvanse."
  },
  {
    "medication": "Kapvay",
    "comment": "I'm in Aus.  Diagnosis was a simple adult adhd psych visit.  \n\nMethylphenidate is available as is straight dexamphetamine IR. Atomoxitine is also available. So we have The Big Three.   \nWe have vyvanse, but it's expensive and unapproved for adult adhd, which means the government doesn't cover most of its cost, it's about $120 a bottle. I'd rather 200 5mg dexamphetamine IR tablets for $30....  \n\nGuanfacine isn't available yet. Clonidine is, it's off-label for adult adhd, pretty cheap still.  \n\nMy current combo is dexamphetamine and clonidine. I had to ask my Dr for clonidine, and she is awesome and prescribed it for me.   \nBest combo!"
  },
  {
    "medication": "Kapvay",
    "comment": "> Hey I am from Iran. Here diagnosis of ADHD are pretty normal and common. \n\nWow that seems very reasonable. Some countries in Europe still don't accept/understand ADHD. Makes you question what you hear about Iran."
  },
  {
    "medication": "Kapvay",
    "comment": "Interesting. I wasn't even offered CBT. They just said 'You want medication? Cuz that's all we got. Here have some methylphenidate.' I wasn't given a choice of medications either. I've got a review appointment in a couple weeks to think about upping my dosage as I'm only currently on 5mg. Did you have to pay for the CBT or was it on the NHS? Wondering if I should be pushing for this..."
  },
  {
    "medication": "Kapvay",
    "comment": "Also various different versions of concerta with different slow release mechanisms. Also Interested in vyanase have you heard of anyone using it here in uk? Is it any good?"
  },
  {
    "medication": "Kapvay",
    "comment": "This is a really helpful post, thanks. I'm 36/m in Sydney diagnosed 2 years ago and been taking Ritalin 20mg twice a day. It's sometimes effective but I don't always feel like it works 100% so I'd considered asking my doctor if I could explore all these other meds I'd been hearing of (mostly here in r/ADHD) like Vyanase, Adderall, Welbutrin, etc, but I was paranoid he'd think I was just shopping around for as many different drugs as I could get.\n\nI didn't realise Ritalin, Concerta and dexys were the only types available here, so I guess I'll just have to keep working on my strategies to get better in conjunction with the Ritalin."
  },
  {
    "medication": "Kapvay",
    "comment": "You pretty much covered it. Ritalin is the go-to for ADHD treatment here.  \n\nIn order to get it in my case-\nI didn't do much actual ADHD testing which made me a little worried (I would like a formal diagnoses but I understand it's a complicated thing to diagnose). \nI did some paper tests, talked about my family history, my schooling, and other problems I've had. It was a bit informal, but he is still aiming to help me and get me in a better place so I'm happy. \n\nIn order to get the medication I have had to have a drug test (typically), blood test, blood pressure test, and a few heart tests (in order to know my body can handle stimulants). For a while I was only prescribed enough to last me in between appointments to my psychologist. My most recent appointment he gave me a script with one refill, I guess because he is confident I'm not abusing or selling it.\n\nYou hear a lot about it being over-prescribed and too easy to get here so I'm happy to go through these measures. I would feel a bit suspect if he just gave me a prescription haha.\n\nEdit: Oh as for cost it was about $13AUS for a 100 10mg pills (and I take 4 a day). It's slightly dependent on the pharmacy but over all is decently affordable with a Medicare card. It would be cheaper with a concession card, which is available to job seekers, students, people not eligible to work etc."
  },
  {
    "medication": "Kapvay",
    "comment": "Like the US (I think) some 'old school' Canadian Doctors are behind the times on ADHD diagnosis and treatment, but switching Doctors is pretty easy if you can find one accepting new patients. Our health and drug plans (as far as I know) don't have any say in our chosen providers.  \nI was 25 at the time of diagnosis, so to save hassle I went to my little sisters' pediatrician (treats up to age 25) who is well versed in ADHD treatment, as well as my family history of it. Being an adult with multiple degrees at the time of diagnosis, I already had a lot of good strategies in place, they just weren't enough to cope with a high pressure work environment, working on another degree, and trying to spend at least some weekday evening time with my romantic partner. After discussing those issues and a somewhat more formal assessment, the Doctor prescribed a stimulant, which ended up being the right type and dose for me on the first try. After a few months to make sure of that, I brought his notes back to my usual family Doctor, and she was happy to continue the prescription. $5/month with my drug plan through work ever since. Would be $100/month without."
  },
  {
    "medication": "Kapvay",
    "comment": "We can't get Adderall IR, is the big omission, nor Wellbutrin IR; and I don't think we can yet get Evekeo and, whaddayacallit, Quillivant? Can't remember if Focalin's approved."
  },
  {
    "medication": "Kapvay",
    "comment": "Dexamphetamine IR tablets. 2x100 5mg bottles per prescription. $36au.. \nI'd rather IR fit total control of when /where and how much."
  },
  {
    "medication": "Kapvay",
    "comment": "Iran is a [beautiful](http://imgur.com/a/AZLY9) country with very [normal](http://imgur.com/gallery/VMAvt) people (normal, meaning by the American idea of normal). It shocks me how many people in the U.S. hear \"Iran\" and think it's just desert and camels and severe oppression*.\n\nETA: Yes, the government has some serious issues and women's rights are far behind the western world, but they aren't North Korea-levels of bad like some people think. I really hope they can find some real reform and don't go the way of Syria, which was another cool country that has essentially been ruined."
  },
  {
    "medication": "Kapvay",
    "comment": "Yeah I think CBT is good, though in my case it would have worked much better in combination with medication. \n\n5mg is kind of low, that's what I started on and I would only half feel it doing anything for me. For me even though Ritalin 10mg (5x2) worked for some time, I found concerta much better as I wouldn't have the high/lows and have to continuously remember taking them. \n\nNope CBT was free (London by the way) though it might depend on your own situation. I'd definitely suggest asking about CBT and medication at your med review appointment."
  },
  {
    "medication": "Kapvay",
    "comment": "I have heard good things about vyvanse, although your mileage will vary. I think it also depends on your local NHS trust and what medications they gravitate towards. Ask your GP!"
  },
  {
    "medication": "Kapvay",
    "comment": "Don't be afraid to talk to your Dr. I ask my Dr for specific medications whenever I thin they are appropriate. She has prescribed everytime. I'm pretty knowledgeable on what I ask for and why.  \n\nAdderall is u unavailable in Australia. We have straight dexamphetamine IR though, and it's cheap."
  },
  {
    "medication": "Kapvay",
    "comment": "Oh, that's what I wanted to say. How surprising that I got distracted and forgot something on this subreddit!\n\nVyvanse works for me, but unfortunately it's not on our Pharmaceutical Benefits Scheme for people not prescribed it as children, so I'm paying about $113 per month for 30 tablets. The only good thing is that all strengths are the same price."
  },
  {
    "medication": "Kapvay",
    "comment": "The best way to explain it wound be that it turns down the volume of my body.   \n\nIt counteracts the dexamphetamine caused sensitisation of alpha2a adreno autoreceptors. It leads to less noradrenaline in the body and in turn less adrenalin. It brings down your excitement threshold,  it chills you out basically,  in a good way."
  },
  {
    "medication": "Kapvay",
    "comment": "> It shocks me how many people in the U.S. hear \"Iran\" and think it's just desert and camels and severe oppression*.\n\nYeah and Iran isn't the only one. Once you read and start to think for yourself, you start to discover that things we have been told are bad/evil are not always so. I think Cuba is another example."
  },
  {
    "medication": "Kapvay",
    "comment": "Interesting. I'm also in London and was not offered this. Could you PM me where you were sent or how you went about getting this?\n\nI'm hoping they'll bump me up in two weeks. I've noticed some difference (for instance that I'm actually responding to this) but I think I'd benefit from a bit more. \n\nI'll ask about CBT but they said straight up they don't provide therapy so maybe I should ask my GP about it."
  },
  {
    "medication": "Kapvay",
    "comment": "It's so not worth it. You can get a reasonable approximation by taking IR tablets with a little timing and knowledge. You also have more control of dosage to meet demands. And it's wayyyy cheaper.   \n\nFor example I couldn't use vyvanse to do what in currently doing  I have my morning dose may before leaving for work, sometimes a small top up around midday,  then I have the same as the morning dose at about 4:00pm when I leave for home. It's not fair on my family to have my symptoms addressed for work and not home.   \n\nThat's what I mean by more control."
  },
  {
    "medication": "Kapvay",
    "comment": "I don't think many Americans see Cuba today like it was seen during the Cold War. I'd go so far as to say it is romanticized these days. Old cars and hand-rolled cigars. It helps that several youtube personalities and travel hosts have been to Cuba recently as well. However, Iran is in the mainstream news every other day here and you'd think from hearing about them that they were the North Korea of the Middle East just waiting to nuke us."
  },
  {
    "medication": "Kapvay",
    "comment": "Like you I was pretty much just sent out of the door with some ritalin, no offer of other drugs or CBT. That said, I'm enjoying the ritalin. 5mg had no detectable effect at all. Nor did 10mg. At 15mg I thought I probably was having an easier time concentrating, and now at 20mg I feel like bloody superman. No negative side effects aside from moderate loss of appetite, but it's actually been quite useful for losing a bit of weight. I can eat, and enjoy eating, but I don't really get all that hungry until late in the evening after my last dose of the day has worn off. Next week they'll look to see if my dosage needs increasing again, and I'm going to give it a go.\n\nCBT is so successful, and there is such undersupply, that you'll be lucky to be offered it now if there's an alternative treatment available. If I could go back in time I'd be at careers fairs with a megaphone telling people to become counsellors and get trained in CBT, as there is huge demand."
  },
  {
    "medication": "Kapvay",
    "comment": "> It helps that several youtube personalities and travel hosts have been to Cuba recently as well.\n\nA YouTube documentary is actually what sparked my interest in Cuba as well.\n\nI do think that there is still a lot of undeserved animosity towards Cuba that is reflected in the various sanctions, but finally the US government has started to improve the relations somewhat. I hope it works out with both Iran and Cuba.\n\n> North Korea of the Middle East just waiting to nuke us.\n\nI don't even think North Korea is wanting to nuke us, but with them it's harder to say for sure and that's another story."
  },
  {
    "medication": "Kapvay",
    "comment": "Whether they actually intend to nuke us or not, [they threaten it](http://www.cnn.com/2015/09/15/asia/north-korea-nuclear-program/) all the time, at least once a year, to the point that it's a joke. And the media wastes no time letting us know every time. \n\nOf course, our missile defense systems are insane and (if you believe DoD pressers) can supposedly shoot a fly out of the sky.\n\nNorth Korea is probably one of few countries portrayed by U.S. media fairly accurately in terms of the state of living conditions and life as a whole. The only thing I think they leave out is that apparently most of it's citizens actually *do* hate Americans and the entire population is brainwashed from an early age through propaganda to hate Americans. I mean, instead of Bugs Bunny they have [cartoons about a child that fights off an evil U.S. naval invasion](https://www.youtube.com/watch?v=ujtp-70zQME). I.E., the U.S. media would have you believe NK's citizens hate their country and want freedom, but in reality they love their leader and are simply unaware of how much better life is in many other parts of the world."
  },
  {
    "medication": "Kapvay",
    "comment": "I had this talk with a Pharmacologist who took one glance at my genetic results, laughed, handed it back to me and said something like “I don’t know if you’ve ever researched the specificity of this crap, but it’s no more accurate than a coin toss.” A colleague of mine had an identical experience. Anecdotal, but that’s a couple of expert opinions."
  },
  {
    "medication": "Kapvay",
    "comment": "My understanding is that these tests are pseudoscience."
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/cornflakesyrup and thanks for posting on /r/ADHD!\n\nIf you haven't already, please take a minute to [read our rules](https://reddit.com/r/adhd/about/rules) - we will remove your post if it breaks one - and also check out our list of official megathreads [here](https://www.reddit.com/r/ADHD/comments/nu534w/official_list_of_radhd_megathreads_please_check/). If your post fits into one of them, it is likely to be removed; if you think this might happen you can delete your post here and resubmit it there instead.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "I had taken gene tests, issued from my psychiatrist office to determine what anxiety medicines work for me. I was told that there was not reliable information/tests/indicators for adhd stimulants."
  },
  {
    "medication": "Kapvay",
    "comment": "I did get this done a few years back, but I have a science background and basically the discussions I recall said unless you are a complete non responder /have a non functional allele, it's not much to go off of. Similar to PP though, it's just what I've heard."
  },
  {
    "medication": "Kapvay",
    "comment": "I’ve heard some clinicians encouraging the use of stimulants and non-stimulants together for ADHD treatment. I am switching from an SSRI+Stimulant to an SNRI+stimulant today in hopes for better results actually."
  },
  {
    "medication": "Kapvay",
    "comment": "I take vyvanse in addition to kapvay for mine. But I’m also on geodon and buspirone to control bipolar disorder and ocd. They’ve all worked really well for me and the kapvay has pretty much ridden me of all the side effects of the vyvanse."
  },
  {
    "medication": "Kapvay",
    "comment": "Better results, meaning less side effects from the stimulant?"
  },
  {
    "medication": "Kapvay",
    "comment": "What are the medications you’re going to be taking? If you don’t mind me asking."
  },
  {
    "medication": "Kapvay",
    "comment": "Better symptom control overall. My side effects have been minimal."
  },
  {
    "medication": "Kapvay",
    "comment": "So no anxiety from the stimulant?"
  },
  {
    "medication": "Kapvay",
    "comment": "Only occasionally when it’s wearing off"
  },
  {
    "medication": "Kapvay",
    "comment": "It definitely decreased my HR and blood pressure the first week I took it. After adding Straterra, they went back to normal. I still am more prone to get lightheaded if I stand up too fast or after getting out the shower. If you go up on the Vynase dose you might also have to go up on Guanfacine as well.  I tell ye, walking around is a little harder. It usually takes me 5 minutes to stop and rest but with my combo it’s like every 2 minutes."
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/ParticularCanary5116 and thanks for posting on /r/ADHD!\n\nIf you haven't already, please take a minute to [read our rules](https://reddit.com/r/adhd/about/rules) - we will remove your post if it breaks one - and also check out our list of official megathreads [here](https://www.reddit.com/r/ADHD/comments/nu534w/official_list_of_radhd_megathreads_please_check/). If your post fits into one of them, it is likely to be removed; if you think this might happen you can delete your post here and resubmit it there instead.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Hi /u/flaxypack and thanks for posting on /r/ADHD!\n\nIf you haven't already, please take a minute to [read our rules](https://reddit.com/r/adhd/about/rules) - we will remove your post if it breaks one - and also check out our list of official megathreads [here](https://www.reddit.com/r/ADHD/comments/nu534w/official_list_of_radhd_megathreads_please_check/). If your post fits into one of them, it is likely to be removed; if you think this might happen you can delete your post here and resubmit it there instead.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "I’m currently conflicted with this exact same issue- I have been on it since I was 15 for Tourette’s and ADHD and I am now 26 and just take it to sleep and so I didn’t feel withdrawal side effects. I think tapering off would be best and perhaps supplementing the clonidine for melatonin to get to sleep. It’s worth a shot to feel free from having to take it forever. Wishing you the best of luck!"
  },
  {
    "medication": "Kapvay",
    "comment": "Spoke too soon. The sedation wore off and I swear it's actually kind of activating now!"
  },
  {
    "medication": "Kapvay",
    "comment": "Haven't seen it drop quite that low yet! I did get up really quick a few hours ago and didn't get woozy so I guess that's a good sign. I would say, aside from right after I take my meds (not just the Intuniv, which I try to take separately from other stuff,), my blood pressure hovers in the 100/70s range."
  },
  {
    "medication": "Kapvay",
    "comment": "It was only 1 mg. I had to quit it, the longer I was on it the more foggy, lethargic, tired and depressed I became."
  },
  {
    "medication": "Kapvay",
    "comment": "My psychiatrist told me to take guanfacine at night 30 to 60 minutes before bed, and to go to bed at a consistent time."
  },
  {
    "medication": "Kapvay",
    "comment": "How long have you been on the medication? \n\nIf it’s been 4-6 weeks and you’re still tired from the medication, you might want to ask your prescriber to switch you to something else."
  },
  {
    "medication": "Kapvay",
    "comment": "It’s a common side-effect of it."
  },
  {
    "medication": "Kapvay",
    "comment": "I had the opposite effect, I felt very calm but couldn’t sleep....when I finally did I’d wake up at 4 am. Also ended up needing to piss every 15 minutes. This was on 1 mg of Intuniv, ended up giving up after 1 month since I was getting seriously burned out from lack of sleep."
  },
  {
    "medication": "Kapvay",
    "comment": "The consistency is the hard part"
  },
  {
    "medication": "Kapvay",
    "comment": "About a week. Will it subside?"
  },
  {
    "medication": "Kapvay",
    "comment": "Extremely hard. I don't think I have managed the same hour in the last week."
  },
  {
    "medication": "Kapvay",
    "comment": "Extremely hard. I don't think I have managed to go to bed in the same hour for more than a week."
  },
  {
    "medication": "Kapvay",
    "comment": "I know this is 12 days old but I was searching for info on this sub because I'm currently on this medication. But for me, I get tired every time my dose increases but it subsides after 4-5 days, max. I was deeply exhausted the first few days I was on it though, I guess it's common until you adjust."
  },
  {
    "medication": "Kapvay",
    "comment": "In my opinion, it would be worth the wait for a psychiatrist who doesn't leave any options off the table. Everything I've seen says stimulants are safe and effective in most cases. What if you're one of the people who doesn't respond to non-stimulants?\n\nI've had a similar experience with looking for treatment for my anxiety. When choosing someone to schedule with, some of the docs were listed as not being willing to prescribe benzodiazepines.\n\nWhen you have a severe condition that affects multiple parts of your life, you don't need caregivers with pet theories about treatment. You need someone that treats symptoms with the best options available.\n\nThat said, you may respond well to non-stimulants and therapy."
  },
  {
    "medication": "Kapvay",
    "comment": "Both paths can be successful. I can't imagine it would hurt to try hus method if you're diagnosed.\n\nCan always seek another opinion if it doesn't work for you."
  },
  {
    "medication": "Kapvay",
    "comment": "Yeah, don't go to him. Hold out for someone else. Those medications sometimes can be good additions to stimulant treatment. But research shows, stimulant medication is the most effective in treating adhd. You can give him MANY more studies that prove stimulants help adhd way more than non stimulant methods. In someone who genuinely has an executive function deficit, a lot of those medications aren't strong enough (if they even work), have a lot of side effects, and take a long time to see results which, isn't good for someone with ADHD. The side effects can also be bad, but not as well researched, so don't do anything you aren't comfortable with. I believe Russel Barkley has a presentation about medication and talks about non stimulant medications and how they can be used, but it is in the context of stimulant medication. Now, medication won't fix everything, but it can help you develop the tools and navigate the world in order to function.\n\nYou would be limiting yourself significantly if you went to him, I get that is his philosophy... But we aren't drug seekers, and for some, yes, maybe non-stimulant is enough for them. You should leave ALL options on the table. No sense trying all these non stimulant meds, waiting a month for each of them to work. And then possibly finding one with minimal help (or none), thinking, hey this is okay, I'm better! When really, you could be even BETTER off.\n\nMaybe you will respond to treatment with non-stimulants. There are some people who do. Dr.'s however like to act as if these meds don't have as pronounced side effects. Strattera, for example makes a lot of people tired or brain foggy.. More organized, but is it worth it if you feel like crap or are irritable and a mess? The problem is the side effects subtly creep up on you with these meds. I'm bipolar so i've been on a lot of meds similar to these. Like I'd rather a stimulant which wears off and the side effects along with it, vs a psych med that builds up with weird effects outside of my control like so many do. Just my 2 cents. Don't take anything you aren't comfortable with. A lot of these non-stimulant meds work for people, but don't limit your options when first seeking treatment."
  },
  {
    "medication": "Kapvay",
    "comment": "As long as they're psychiatrists, that's good enough for me. It's pretty hard to get appointments, so I go with what's available (provided they don't announce that they rule out certain classes of meds).\n\nAround here, medical systems will only let you see a psych if you switch to one of their GPs.\n\nA one-hour appointment is pretty standard for a first appointment. They'll take medical history, family history, current symptoms. It's the \"get to know you\" appointment.\n\nIf more extensive testing is needed, they'll refer you to neuropsychology, usually.\n\nI haven't had good experiences with prescribing nurses. More places are hiring them to make up for the psychiatrist shortage. Some people like them, but I felt like they aren't as skilled."
  },
  {
    "medication": "Kapvay",
    "comment": "I was recommended someone by my therapist who specializes in my conditions. Bipolar, adhd and PTSD. Apparently, my other psychiatrist (and he had great credentials, and everything!) had a difficult time treating all of these together (didn't have much experience in all those together) But... I would consider someone who specializes/has experience treating ADHD and typically it is one session for diagnostic evaluation, but it is longer than a regular session. They are usually 1.5hrs+ \nExperience is the best thing to look for, education is good, but look at where they have worked previously and what they have done professionally - if they list it. Also, look and see if they specialize in ADHD. That is important. You can always call and ask"
  },
  {
    "medication": "Kapvay",
    "comment": "Makes it impossible to get it up"
  },
  {
    "medication": "Kapvay",
    "comment": "It is not an ADHD medication\n\nYet it can be a very good medication you use to treat coexisting conditions of ADHD like depression or anxiety (but also other things).\n\nThus it may not be your primary med you use to treat ADHD, but instead a med you use to treat another condition and you are also on another med for ADHD.  Or you just treat ADHD with non med techniques.\n\n&nbsp;\n\n&nbsp;\n\nNote in some people the coexisting disorders in ADHD people may be more of a problem in life, they may be more impairing that Zoloft may be their primary medicine they need for depression is more severe than their ADHD, or some other condition besides depression is their biggest problem in life."
  },
  {
    "medication": "Kapvay",
    "comment": "100 mg has taken away 90% of my self-harm urges and intrusive thoughts.  I've also stopped crying for no reason for hours a day.  Much more in control of my emotions.  No effect on concentration, attentiveness, energy, or anything else, though."
  },
  {
    "medication": "Kapvay",
    "comment": "Works fine for my depression, no huge side-effects. Can't go above 100mg or my ADHD gets worse, though: worsens my ability to focus."
  },
  {
    "medication": "Kapvay",
    "comment": "I did not like Zoloft I had a lot of issues with the vertigo and everything and it might have made my anxiety worse I'm not sure. My mom took it after me and had the same problem with the vertigo but my sister takes it and seems to work well for her. My mom has anxiety and possibly ADHD and my sister has panic attacks. Sooo it's all just dependent on who takes it (of course). Now I take wellbutrin which can be taken for a number of things I guess? I take it for combination of ADHD+Anxiety and then I take other meds for ADHD also"
  },
  {
    "medication": "Kapvay",
    "comment": "Thank you. do you take anything with the cymbals for ADHD that helps? Or the side effects to much?"
  },
  {
    "medication": "Kapvay",
    "comment": "Didn't like the sexual side effects or the fact that it seemed like I was *always* at least just a little nauseous. Didn't help any of my symptoms either, but this was back when I was being treated specifically for anxiety/depression. Lexapro was about the same.\n\nConcerta or ADHD and Welbutrin for latent anxiety/depression has been a complet 180"
  },
  {
    "medication": "Kapvay",
    "comment": "Thank you for the feedback. So you stopped taking it?"
  },
  {
    "medication": "Kapvay",
    "comment": "Did you stop taking it? Or does it help?"
  },
  {
    "medication": "Kapvay",
    "comment": "Note we have 7 medicines classes that treat ADHD in different ways for ADHD.\n\n4 of those classes work the best.  2 types of stimulants (methylphendiate and amphetamine) and 2 types of nonstimulants that work very differently from each other.  Atomoxetine (3rd type of med for ADHD) which in the US is called Stratter and a 4th class of medicine called Alpha 2 Agonists and in the US we have two versions of these meds for ADHD.  Intuniv also known as Guanfacine ER is an Alpha 2 Agonist that has stronger Alpha 2a function (usually better for ADHD), Kapvay also known as Clonidine ER is another alpha 2 agonist with roughly equal Alpha 2a, Alpha 2b, and Alpha 2c function.  Kapvay usually is inferior for ADHD than Intuniv, but Kapvay is better at treating some of the coexisting disorders so which of the alpha 2 agonists you try first depends on what other things you have besides ADHD for sometimes Kapvay works better than Intuniv for these other things."
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks for the response. Do you take a  anything in combination with Zoloft that helps with your ADHD? Or does it cause additional side effects? I know everybody is different, I'm curious though to see what's helped others as I'm suffering quite a bit. And I'd rather avoid the trial and error method for now until I ultimately/ eventually try something."
  },
  {
    "medication": "Kapvay",
    "comment": "Thank you so much for the response, very helpful. And do you find this combination that you take helpful?"
  },
  {
    "medication": "Kapvay",
    "comment": "If you decide to try a Serotonin based med and you had sexual side effects in the past try one of these meds which are not traditional SSRIs but instead different classes of Serotonin meds due to your sexual side effect past.\n\nTrintellix (vortioxetine) which is a Serotonin Modulator and Stimulator\n\nTrazodone which is a Serotonin 2A agonist and SERT Reuptake Inhibitor (the technical name is called SARI).  Note there are other SARIs beside Trazodone in other countries besides the US such as Nefazodone and Etoperidone.\n\nSo both of these medicines are SSRIs but they do other things as well.  Certain serotonin receptors (there are 14 different types of serotonin receptors) cause sexual side effects, while other serotonin receptors actually increase arrousal, decrease stress, and make you a little more horny.\n\nThe SMS medicine triggers serotonin receptors that make you more horny besides being a SSRI, while the SARI medicine besides being a SSRI actually makes it much harder to turn on some of the specific serotonin receptors that cause sexual side effects.\n\n&nbsp;\n\n&nbsp;\n\nNote recently the FDA approved a medicine that is not a SSRI in any form but a selective serotonin receptor blocker and selective serotonin receptor activator to treat female sexual disorders where they are just not interested in sex.\n\nThis medicine is called Addyi / Filbanserin \n\nhttps://en.wikipedia.org/wiki/Flibanserin\n\nWhen first developed in the early tested phase the goal was a medicine with antidepressant properties and/or anti anxiety properties for triggering those specific serotonin receptors and blocking other specific serotonin receptors has both anti anxiety and anti depressant properties.  Yet it was repurposed as a medicine for  hypoactive sexual desire disorder for while it does have antidepressant and anti anxiety properties the lack of extra actions things like SSRI and such means it is a weak medicine for those conditions (barely better than a placebo).\n\nIn theory Filbanserin should also help men with similar problems with hypoactive sexual desire disorder for those same receptors also do the same thing in men and it is not messing with anything unique to women such as specific hormones.  The problem is we can't say this for sure for most of the study on hypoactive sexual desire disorder is done in women.  Furthermore we know there are differences in men and women with things like orgasm in specific brain areas, and things like anxiety are far more influencing in women with causing low sexual desire and this makes sense from an evolutionary standpoint.  Men do not have to carry babbies and just have a successful sexual encounter, while Women have to carry a baby for 9 months and often care for the baby by themselves or with family networks (such as the male who got her pregnant but it can be aunts, uncles, grandparents, friends, etc) after the baby is born from an evolutionary standpoint prior to social organization that has occurred in the last 5,000 years or so.\n\n&nbsp;\n\nNow wellbutrin is used off label for hypoactive sexual problems and other sexual disorders but it uses other neurotransmitters such as dopamine, norepinephrine, and modulating the acetylcholine system and does not mess with serotonin in any direct fashion."
  },
  {
    "medication": "Kapvay",
    "comment": "I stopped. Turns out the source of my depression was the constant up and down caused by the stimulants. I should have noticed earlier since my \"down\" points in the depression were usually at night, but either way I've quit all medication and I'm happy I did."
  },
  {
    "medication": "Kapvay",
    "comment": "It's difficult to know what I need. I can't try every single one."
  },
  {
    "medication": "Kapvay",
    "comment": "I do it's a little weird but I seem to being doing alright enough I don't question it. I'm a freshman in college and I started wellbutrin in my sophomore year I believe maybe junior. I've been taking intuniv (non stimulant) since 8th grade after deciding to drop adderall which I had taken for years. This past November I picked the adderall back up again and kept the intuniv also. SO to conclude  (if any of this is significant) I take 3mg intuniv before bed, 150mg wellbutrin twice/day and adderall IR 15mg twice/day. the wellbutrin and the intuniv+adderall seem to work independently for anxiety but all seem to balance the ADHD. so I'm not a robot but also not a psycho or whatever else"
  },
  {
    "medication": "Kapvay",
    "comment": "Yes it is helpful. I'm struggling and want to give something a try at this point. Thanks."
  },
  {
    "medication": "Kapvay",
    "comment": "As an autism therapist and a person with ADHD:    \n\nYes it can be a behavior associated with ADHD.  \n\n\nRocking back and forth and doing circles sounds very much like a sensory seeking behavior (not a control behavior like OCD). You're seeking extra info from the world around you.      This is common with both diagnoses but a sensory disturbance is part of the autism diagnosis.  This is why it's seen as an autism \"trait\" even though it's not just people with autism who rock or spin etc.       it may that you have a minor sensory processing disorder as well, which isn't a big deal but might help you understand yourself better.   Without knowing your current status,  it's hard to know how much your sensory seeking behaviors impact your life.      Check out spdstar.org for more info.        \n\n\nIn your situation I wouldn't be too concerned.  I think sensory seeking is fine as long as it is safe (no head banging) and relatively socially acceptable (no hand flapping or rocking excessively).       As an adult you probably can control your behaviors to a much greater degree and you've learned how to make them fit the norm (I have a friend who taps his foot).  \n\n\nI hope this rambling answer helps!    Feel free to PM me!"
  },
  {
    "medication": "Kapvay",
    "comment": "This thread is making me question whether or not I have Autism... its one of my irrational fears where I may have been autistic my entire life and everyone was just REALLY good at hiding it or I was REALLY bad at noticing that people were trying to keep it from me. I also have friends who are high functioning autistic people of which most of it was just socially declined...of which I feel as though I suffer from the same thing."
  },
  {
    "medication": "Kapvay",
    "comment": "It is called stimming.\n\nhttps://en.wikipedia.org/wiki/Stimming\n\nNote while it is very common in people with autism, it has nothing to do with autism for it is far more common in multiple disorders not just autism.  For example stimming is more common in people with ADHD, coordination disorders, OCD, motor tics, etc.\n\nIt is also common in normal people as well, and is more common in children vs adults.\n\nPut another way while almost all autistic people stim, ADHD people stim more than non ADHD people, OCD people stim more than non OCD, but there are still people who do not meet the qualification for any disorder / learning disability who stim.\n\n&nbsp;\n\n&nbsp;\n\nIt has to do with the various types of neurotransmitter receptors (which changes during a person's lifespan, different levels of various receptors are different in childhood, teenager, adult, and post 30, etc) and it has to do with a brain region called the basal ganglia which is involved with integrates various areas of the frontal lobe and helps you switch from one task to another, and fine tuning your thoughts, your motor behavior, and even your emotions."
  },
  {
    "medication": "Kapvay",
    "comment": "When I'm standing I'll sway side to side by shifting my weight from leg to leg. When sitting I usually have a bouncing leg"
  },
  {
    "medication": "Kapvay",
    "comment": "I sometimes flap my hands bur it's kind of rare, I also have tics I have heard that it is from ADHD or from the medication used to create OCD.  I don't know how severe you mean when you say headbanging.  I guess an example of headbanging I'm talking about is what the musicians in metal bands do lol but I dont do it like that its more of a small jerking motion that is most likely barely noticeable to other people, and like I said it most likely is a tic that I have from adhd or medications.  Would these things make me autistic?  And thanks for the great reply by the way."
  },
  {
    "medication": "Kapvay",
    "comment": "I'm a clinical psychologist. I've suspected for a while that the DSM is incorrect when conceptualizing ADHD and ASD as two separate spectrums. I think they're all part of the same spectrum. I can't think of one person with ASD - Level 1 (or asperger's) who didn't also meet the criteria for ADHD. I think it's why we so so many people with ADHD have autism-like features but don't qualify for an ASD diagnosis. This is just a theory on my part, but after several years of trying to prove myself wrong, I haven't been able to. Have you noticed this in your work?"
  },
  {
    "medication": "Kapvay",
    "comment": "Note stimming is not a bad thing unless it causes a failure to thrive / complete a task.\n\nSometimes in people who stim to the point where it is a distraction and counterproductive, teachers, therapists, parents, find self stimulatory types of tasks such as putting a giant rubber band between a desk where you balance your legs and you can kick it while sitting down at a school desk.  Or certain types of spinning rings, or little toys, etc.\n\nSomething to keep part of your body busy while you use your conscious mind to try to zero down and focus your attention on something with your eyes and most of your higher up attention."
  },
  {
    "medication": "Kapvay",
    "comment": "Were you diagnosed with Autism or do you just have adhd?"
  },
  {
    "medication": "Kapvay",
    "comment": "You're welcome!   Tics are different than sensory seeking behaviors.     And I'm much less familiar with tics although I have definitely seen them develop after a medication change.   I honestly don't know if I can accurately describe the difference.  \n\n\nWhen I mentioned head banging I was referring to banging one's head against the wall so hard that it causes physical damage.   Some individuals with autism do this so much that a helmet is necessary to protect them.  😞.   \n\nI'm really not sure if you're autistic.  Autism is such a huge spectrum. (See my comment below). You should obviously check with a doctor.   You also might weigh the benefits vs. drawbacks of getting another diagnosis.   In adults an autism diagnosis typically does not provide as many additional medical benefits as it would if you were a child.  At least not here in Illinois.   On the other hand, the right diagnosis can help understand yourself better and become a better self-advocate."
  },
  {
    "medication": "Kapvay",
    "comment": "DSM V purposefully got rid of seeing them as two different disorders because the current research show that there are some similarities between the two.\n\nNow it is a debate if they are just disorders where one causes the other to be more likely, or if you should see them as full spectrum disorders just like you see can ADHD as a spectrum disorder with two axises hyperactivity and inattention."
  },
  {
    "medication": "Kapvay",
    "comment": "I'm so glad to hear you say that!  I too believe that autism and ADHD are on the same spectrum, and can't prove myself wrong either.   I also wish ADHD was known as executive functioning disorder as the current name doesn't accurately describe the full range of impairments.  Anyway, all of the kids with autism that I work with struggle with executive functioning.  Its almost always a target in my sessions.    \n\nPlus what's the difference between hyperactivity and sensory seeking behavior?  I'm not sure that the kids that struggle to sit still aren't also struggling with some sensory processing difficulties.   I'd love to understand this better. \n\nA tangentially related  question:   I've noticed that several of my kids have been put on stimulant medication (Adderall or Ritalin) for attention difficulties but the mediation helps more of their autistic traits and doesn't necessarily help the actual attention problem.  I know one kid who is on the highest dosage of adderall and still can't focus in class.   It breaks my heart because he misses so much instruction.  Have you seen this?   Any suggestions?"
  },
  {
    "medication": "Kapvay",
    "comment": "Currently in process to be diagnosed for adhd and anxiety"
  },
  {
    "medication": "Kapvay",
    "comment": "Would you please provide a link to explain this further?  I was under the impression that the DSM V removed the diagnosis of Aspergers disorder, but didn't change either the ADHD or autism diagnostic criteria.        (I'm going to look now and will post my own link if/when I find it)."
  },
  {
    "medication": "Kapvay",
    "comment": "> A tangentially related question: I've noticed that several of my kids have been put on stimulant medication (Adderall or Ritalin) for attention difficulties but the mediation helps more of their autistic traits and doesn't necessarily help the actual attention problem. I know one kid who is on the highest dosage of adderall and still can't focus in class. It breaks my heart because he misses so much instruction. Have you seen this? Any suggestions?\n\nIt seems you are a para / teacher / occupational therapists, etc? **So it is not really your job to get into the details of medicine besides just bring information up with the parents who then consult with the physician.**  That said I am bring this up not for you to educate the parents for their sake, but to just allow them to know there is something out there they may want to try and they should talk to their doctor who is the medical expert aka not you.\n\nThere are 7 classes of ADHD medication and finding the best medication or combination of medications is a process of trial and error with the ADHD child and/or adult.  Here is a table of the 7 types of ADHD medicines.  Each class treats ADHD in a slightly different way.\n\n\n| ——————————Drug Class—————————— | ——————————Official Name —————————— | —————————————————Ratios————————————————— | —————Brand————— | —————Brand————— | —————Brand————— | —————Brand————— |\n|:------------------:|:-----------------------:|:----------------------------------------:|:---------------:|:---------------:|:---------------:|:---------------:|\n|                    |                         |                                          |                 |                 |                 |                 |\n|     1—Stimulant    |       Amphetamine       |                                          |                 |                 |                 |                 |\n|                    |                         |                100% D-AMP with Prodrug Time-release                |     Vyvanse     |                     |                 |                 ||                 |                 |                                          |                 |                 |                 |                 |\n|                    |                         |                100% D-AMP                |     Dexedrine    |   Zenzedi    |    ProCentra    |                         |\n|                    |                         |           75% D-AMP, 25% L-AMP           |     Adderall    |  Adzenys XR ODT |   Dyanavel XR   |                 |\n|                    |                         |           50% D-AMP, 50% L-AMP           |      Evekeo     |                 |                 |                 |\n|     2—Stimulant    |     Methylphenidate     |                                          |                 |                 |                 |                 |\n|                    |                         |           50% D-MPH, 50% L-MPH           |     Ritalin     |     Concerta    |     Methylin    |     Metadate    |\n|                    |                         |           50% D-MPH, 50% L-MPH           |    Daytranna    |    Quillichew   |    Quillivant   |     Aptensio    |\n|                    |                         |                100% D-MPH                |     Focalin     |                 |                 |                 |\n|   3—NonStimulant   |       Atomoxetine       |                                          |    Strattera    |                 |                 |                 |\n|   4—NonStimulant   |      Guanfacine ER      |                                          |     Intuniv     |                 |                 |                 |\n|                    |       Clonidine ER      |                                          |      Kapvay     |                 |                 |                 |\n|   5—NonStimulant   |        Modafinil        |    50% R-Modafinil, 50% L-Form   |     Provigil    |                 |                 |                 |\n|                    |       Armodafinil       |         100% R-Form of Modafinil         |     Nuvigil     |                 |                 |                 |\n|   6—NonStimulant   |        Buproprion       |                                          |    Wellbutrin   |      Zyban      |     Aplenzin    |                 |\n|   7—NonStimulant   |       Various TCAs      |                                          |                 |                 |                 |                 |\n|                    |      Nortriptyline      |                                          |     Aventyl     |     Pamelor     |                 |                 |\n|                    |        Imipramine       |                                          |     Tofranil    |                 |                 |                 |\n|                    |       Desipramine       |                                          |    Norpramin    |    Pertofrane   |                 |                 |\n\nNote the best results easily belong to the top 4 classes of medicine.  The two types of stimulants, Strattera / Atomoxetine, and then the 4th class of medication called the Alpha 2 Agonists known as Intuniv and Kapvay.\n\n * Note classes 5, 6, and 7 are not offically according to the FDA are medicines used for ADHD treatment.  Instead they are medications to treat other disorders such as narcolepsy, daytime sleepiness, or depression.  These meds have a lower incident of working to treat ADHD on a percent basis of how many people get successful treatment, and sometimes these medicines have more side effects.  Yet they are used when the first 4 classes of medicines A) Do not work, B) Do work but have side effects so your doctor tries something else.  C) You have one of the other conditions these meds treat and helping the ADHD is seen as a bonus.\n\n#Now the nonstimulant medications are newer and not all parents and some doctors are aware of these meds existence.\n\nOr even if they are aware of the meds existence they may not be following all the research for dozens of additional studies on these medicines come out each year, showing things like general success rates, side effects, etc which reaffirms the safety studies done on the medicines prior to FDA approval.\n\n* Strattera came out in 2006.  \n\n* Intuniv came out in late 2009.\n\n* Kapvay came out in 2010.\n\n * Note Intuniv and Kapvay both have active ingredients that have been used in medicine for other conditions such as treating high blood pressure for several decades, since the 80s with the active ingredient in Intuniv and the 70s with the active ingredient in Kapvay.\n\nNow category 4 / the alpha 2 agonists medicines / aka Intuniv and Kapvay are medicines that are designed to be used by themselves but also in combination with Stimulants (the term for this is mono therapy if used by itself or abjunct therapy if used in combination with stimulants.).\n\nIn fact besides treating ADHD better in most patients than stimulants alone they often reduce stimulant side effects.  This is because alpha 2 agonists fine tune norepinephrine and adreanline release, increasing your effective norepinephrine levels when they are low, but also lowering your norepinephrine and adreanline levels if they are too high, and sometimes the stimulants which act as dopamine and norepinephrine boosters cause effectively too high of adrenaline or norepinephrine levels.\n\nThe 4th category alpha 2 agonists work by targeting specific subtypes of receptors called adrenergic receptors.  These are receptors that are triggered by norepinephrine and adrenaline.  Well your adrenergic receptors can be broken down into 9 different types of sensors that can be trigger by norepinephrine, adreanline, or both.  And these 9 types of sensors can be divided into 3 types of classes for they do different types of things.\n\nWell Intuniv and Kapvay are medicines that trigger the alpha 2 type of adrenergic receptors but not the alpha 1 or the beta class of receptors.  They work as artificial norepinephrine that is selective only trigger 3 out of the 9 types of adrenergic receptors.  (Intuniv is even more selective and triggers almost only the alpha 2a type of receptor and barely affects the alpha 2b and 2c types of receptors while Kapvay triggers all 3 roughly equally).  Well in the prefrontal cortex medium levels of norepinephrine trigger alpha 2a receptors and promote focus.  But keep on increasing the norepinephrine levels or introduce adrenaline and you turn off the alpha 2a receptors and trigger the alpha 1 and beta class of receptors.  Receptors we normally think of with stress and anxiety, while alpha 2a in the prefrontal cortex is more tied with executive function.\n\nNow triggering alpha 2a receptors also makes it harder for adrenaline to kick in.  This is because in the brain stem area your body monitors norepinephrine and adrenaline with alpha 2a, 2b, and 2c types of receptors.\n\nSee followup post"
  },
  {
    "medication": "Kapvay",
    "comment": ">I'm not sure that the kids that struggle to sit still aren't also struggling with some sensory processing difficulties.\n\nThis is anecdotal but I'd shift in my seat a lot because I couldn't get comfortable, it was particularly bad around my belt-line. \n\n>I know one kid who is on the highest dosage of adderall and still can't focus in class.\n\nI had this issue too and is part of why i had to be switched to desoxyn. The cause is I think anxiety. I found at lower doses vyvanse would work better for attention than higher doses, but still wasn't adequate. Adding intuniv or clonidine seemed to allow a higher dose to be more effective"
  },
  {
    "medication": "Kapvay",
    "comment": "The ADHD criteria was mostly kept the same.  But one of the minor changes was related to autism.\n\nAutism had some fundamental shifts.  For example the language criteria was removed (language issues are common in autism, but are not part of the diagnostic criteria, furthermore it is not language itself but how language that is used that is indicative of autism, you can high a high vocabulary and be autistic).  In addition sensory stuff was added as a possible \"checkmark\" on the symptoms of Autism.  I am not going to get into all the changes of autism since its complicated on the why they did the shifts and are not applicable to the subject we are talking about (ADHD and Autism comorbidity.)\n\n-----\n\nBut here is a one of the quick summary parts of DSM V, from the fact sheet of DSM V\n\nhttp://www.dsm5.org/documents/adhd%20fact%20sheet.pdf\n\n>**DSM-5 includes no exclusion criteria for people with autism spectrum disorder, since symptoms of both disorders co-occur.** However, ADHD symptoms must not occur exclusively during the course of schizophrenia or another psychotic disorder and must not be better explained by another mental disorder, such as a depressive or bipolar disorder, anxiety disorder, dissociative  disorder, personality disorder, or substance intoxication or withdrawal.\n\nNote the bolded part is something new and was not in DSM IV (1994) and DSM IV-TR (2000).  Before hand if you met the criteria for autism you were not officially allowed to be diagnosed ADHD under DSM IV."
  },
  {
    "medication": "Kapvay",
    "comment": "So here are the uses for Intuniv.  Bolded are categories which have official FDA approval for, non bolded are categories these medicines still help with.\n\n**Intuniv** / Guanfacine Extended Release\n\n* **Attention deficit hyperactivity disorder (ADHD) in children ages 6–17 (Intuniv, adjunct and monotherapy)**\n\n* **High Blood Pressure / Hypertension**\n\n* Oppositional defiant disorder\n\n* Conduct disorder\n\n* Pervasive developmental disorders\n\n* Motor tics\n\n* Tourette’s syndrome\n\n**Kapvay** / Clonidine Extended Release\n\n\n* **Attention deficit hyperactivity disorder (ADHD) (Kapvay)**\n\n* **High Blood Pressure / Hypertension**\n\n* Tourette’s syndrome\n\n* Anxiety disorders, including posttraumatic stress disorder (PTSD) and social anxiety disorder\n\n* Substance withdrawal, including opiates and alcohol\n\n* Clozapine-induced hypersalivation\n\n* Menopausal flushing\n\n* Severe pain in cancer patients that is not adequately relieved by opioid analgesics alone (combination with opiates)\n\nNow one great thing about these medicines are even though they are relatively new they now have generics due to them being based off earlier medicines causing the FDA only to have a short term window for market exclusivity.  For example with Intuniv they are now 6 makers of the drug, and another company (for a total of 7) who recently got FDA approval to make the drug.  Thus the cost of these medicines are much cheaper than Strattera (the nonstimulant that was approved in 2006)"
  },
  {
    "medication": "Kapvay",
    "comment": "I'm sorry.  I wasn't clear: I was asking for behavioral strategies to help keep kids' attention and focused.  You are right: I am NOT a doctor or psychiatrist. I have no interest in changing meds. I'm just trying to figure out if there are other strategies I can use.   I'm sorry if I offended you."
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks!!!!  That was an awesome response!   I appreciate learning something new and getting some bad info corrected.   😀."
  },
  {
    "medication": "Kapvay",
    "comment": "Can totally relate, especially the bummed out feeling after having tried stimulants and then finding out they won't work for you long term.\n\nFor anyone else in that position: give the non-stimulants like Wellbutrin or Strattera a chance, they can still be life-changing, although they will take much longer to start working that good old stimulants."
  },
  {
    "medication": "Kapvay",
    "comment": "I am the same way with stimulants! I'm very aware of my body and actually had the symptoms of someone with chronic high blood pressure (head pressure, ringing, patchy palms). It also made me a little anxious which didn't help the blood pressure either. \n\nMaybe I will give wellbutrin another try but with the once daily kind."
  },
  {
    "medication": "Kapvay",
    "comment": "Hey. I was originally on Concerta which screwed me over. I'm on Wellbutrin aswell, started about a month ago but I stopped taking it about a week ago as I felt like it wasn't doing anything. Do you suggest I continue? I've taken Setraline aswell which absolutely did nothing."
  },
  {
    "medication": "Kapvay",
    "comment": "Your doctor is doing a smart thing with trying medicines that are less likely to increase blood pressure and heart rate first if you have palpitations.\n\nBut understand you may try other ADHD medicines down the line as well as Wellbutrin.  Wellbutrin is a medicine we do use to treat ADHD even tough we usually use other ADHD medications first.\n\n* Strattera can raise blood pressure and heart rate but it is less likely to do so than stimulants.\n\n* Modafinil a wakeful promoting medicine, can cause cardiovascular side effects but it is less likely to do so than stimulants\n\n* Intuniv and Kapvay are 2 ADHD medicines approved in 2009 and 2010. This type of ADHD medicine is known as an alpha 2 agonist for you have norepinephrine and adreanline receptors called Alpha 1 (3 different types of Alpha 1 receptors), Alpha 2 (3 different types of Alpha 2 receptors), and Beta receptors (3 different types of Beta receptors).  Alpha 2 agonists medicines lower norepinephrine and adreanline if there levels are two high by activating presynaptic Alpha 2 receptors, they also work as if your norepinephrine levels were too low for by triggering post synaptic alpha 2 receptors as a norepinephrine subsitute they can do many of the things norepinephrine does naturally (but they can't trigger alpha 1 and beta receptors and this is often a good thing if you have an anxiety disorder or high blood pressure.)  These medicines Intuniv and Kapvay are extended release medicines of the active ingredients Guanfacine and Clonidine.  Guanfacine was used starting in the 1980s and Clonidine in the 1970s as a medicine to treat high blood pressure when the high blood pressure and other cardiovascular issues when said issues was caused by too high of norepinephrine or adrenaline.\n\n * Intuniv and Kapvay besides treating ADHD when used as the only ADHD medicine (monotherapy) can be combined with Stimulants and doing so often lowers stimulant side effects for stimulants that we use to treat ADHD with work by increasing norepinephrine and adrenaline but also dopamine.  Too high of norepinephrine and adrenaline can cause certain stimulant side effects and adding an Alpha 2 Agonist such as Intuniv or Kapvay can prevent that side effect while at same time having a synergistic effect at treating ADHD via a different method than the stimulants use.\n\n&nbsp;\n\n&nbsp;\n\n>My psych upped my dose and I didn't really feel much at first, but I realized that things have changed subtly and for the better! I don't dread work because I can actually focus on a task long enough to complete it. I'm feeling better rested and more energetic. I used to come home every day from work and just crash on the couch because of how much mental effort it took to do my job (which is not incredibly hard or intellectual), but now I can actually do errands after work, chores, exercise, etc.\n\nAnd that is supposed to how it feel more or less if Wellbutrin does work for your ADHD.  It will feel different than Stimulants for ADHD but at the same time helping your ADHD.\n\n**What does are you on for Wellbutrin** now that you just did a dose increase and you were on the old dose for a couple months?\n\nEverybody individual response is different but in research for ADHD in the studies done for many patients on Wellbutrin it often took a 300 mg or 450 mg dose for Wellbutrin for ADHD and 150mg a day was not enough.\n\nAlso you mention a past history of SSRIs which I took was for depression...Do you still have depression prior to Wellbutrin?  If so does Wellbutrin help your particular style of depression?"
  },
  {
    "medication": "Kapvay",
    "comment": "At this moment I am doing dexamphetamine and intuniv, and for the OCD i am doing zoloft(50mgs) /bright light therapy and exercise. The latter combination has completely crushed any and all OCD tendency. I am still noticing personality blunting, but less dissociative effects from the dexamphetamine. Going to give this a month trial, if it also a flop I will try wellbutrin/intuniv."
  },
  {
    "medication": "Kapvay",
    "comment": "Hoi Frans,\nI saw your post about strattera being life changing for you one year ago. Are you still very satisfied? What is your dosage right now, and are all your sides gone?\n\nI have ADD but every stimulant takes my personality and makes me feel so strange/hazy."
  },
  {
    "medication": "Kapvay",
    "comment": "Interesting... can you explain then why folks typically don't experience the same side effects that SSRIs have? Low libido, appetite, etc."
  },
  {
    "medication": "Kapvay",
    "comment": "My Psych gave me the max dose of the xr version (450mg/day). It took about 1 month for me to feel anything. I felt nothing at lower doses. Good luck!"
  },
  {
    "medication": "Kapvay",
    "comment": "Disclaimer: definitely not a doctor. \n\nMy Psych gave me the max dose of the xr version (450mg/day). It took about 1 month for me to feel anything. I felt nothing at lower doses. Maybe worth a shot."
  },
  {
    "medication": "Kapvay",
    "comment": "I have seasonal depression which hasn't really been an issue since I moved to Texas (Seattle native). I'm on 450mg XR now."
  },
  {
    "medication": "Kapvay",
    "comment": "No heart/BP issues here but I have some comorbid OCD stuff and a bad history with stimulants. \n\nI'm so excited to try Strattera and Intuiniv. \n\n1: When does one use Kapvay as compared with Intuiniv? \n\n2: Should one try Strattera first and then try Intuiniv/Kapvay? \n\n3: If Strattera worked, you can actually add Intuiniv/Kapvay and use them together, right? \n\n4: Can you use Strattera and Intuiniv and Modafinil all at the same time?"
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks! I was on it once before but never went higher than 150mg twice daily with no effect. Hopefully I can have my doctor write this without seeing a psych provider. I just don't have the time to see another person."
  },
  {
    "medication": "Kapvay",
    "comment": "RAWR at the texas remark.  I am Houston myself.  Noting wrong with Seattle which has some nice people I love / I like =P\n\nWellbutrin is indicated for Seasonal Depression.  Furthermore specific gene variants that increase the chance for both ADHD and Seasonal Depression are tied to a specific variant of the Dopamine DRD4 gene.  Namely the DRD4 7R verison of the gene but there are numerous variants of the DRD4 gene and some are implicated with ADHD and seasonal depression.  Note dozens of other genes are tied to ADHD and Depression not just this DRD4 7R, having this gene variant is not enough to cause ADHD."
  },
  {
    "medication": "Kapvay",
    "comment": "Hey /roland00\n\nI hope you could answer a question I have for me regarding wellbutrin and Intuniv combination. I posted this in another thread.\n\n>Is this why I feel as if Intuniv has improved my working memory? I am a really divergent thinker and stimulants really numb my creativity and ability to think divergently. I get so focused and tuned in that I almost lose the ability to see multiple solutions, even on low doses of stimulants (18mg concerta).\nI have been trying intuniv for 3 weeks now and have noticed my memory has really improved, without causing the other side effects such as blunting affect or OCD type like behaviors or thoughts. Dopamine drugs do usually make my OCD and anxiety worse.\nI also have a question for you: The only side effect I am having from the Guanfacine is sedation/fatigue. I was thinking about adding in a low dose of wellbutrin (150mg xl) to combat this, my doc has already approved. But from a neurobiological (those 2 meds interacting in the brain) standpoint, could these 2 interact negatively or should they have a synergistic effect?"
  },
  {
    "medication": "Kapvay",
    "comment": "Sorry to interrupt, but which meds are you on and how are you doing? \n\nJust Intuiniv? \n\n(I have both OCD/ADHD and problems with stimulants too.)"
  },
  {
    "medication": "Kapvay",
    "comment": "Ask her if you can try Intuniv or Kapvay with your stimulants, they are blood pressure medications that help stimulant side effects and also have some benefit on ADHD symptoms such as emotional control."
  },
  {
    "medication": "Kapvay",
    "comment": "Did you have the same effect with an amphetamine, like Vyvanse or Adderall?"
  },
  {
    "medication": "Kapvay",
    "comment": "My doctor added guanFACINE or Tenex in generic form, blood pressure normalized instantly and my meds work even better now."
  },
  {
    "medication": "Kapvay",
    "comment": "My intention was not to argue. That is not what I am on this sub to do."
  },
  {
    "medication": "Kapvay",
    "comment": "Also, you could just take your meds and tell the doctor tuff titties. Having high blood pressure is super normal, and there are many treatment options. \nBe glad you caught it!\n\nBut it’s dumb for the doc to tell someone with ADHD to stop taking meds.  Just take them if you need to."
  },
  {
    "medication": "Kapvay",
    "comment": "That's a good idea. Eventually, I would like to get off of the stimulants, as I used to do pretty well on just high-dose SSRI's (Zoloft). But as I am going back to school I need better control with that. Also I am reluctant to go on MORE medicine. I already take thyroid medicine plus Zoloft and Concerta. But I am hoping in the long term to control my blood pressure with a low-carb diet. That said, I also have bad family history. \n\n\nAny short term advice on how to beat the sads RIGHT NOW?"
  },
  {
    "medication": "Kapvay",
    "comment": "Never taken them so don’t know, but I’m gonna go with yeah probably."
  },
  {
    "medication": "Kapvay",
    "comment": "No. Having high blood pressure is not “super normal”, at all, and comes with an increased risk of stroke, heart failure, and other nastiness. People with ADHD are already at an increased risk of all of those things because of the increased levels of catecholamines. Also, a blood pressure of 160/110 in a 22 year old woman is cause for concern, always. \n\nI stopped the meds of my own free will because they falsely raise levels of a metabolite of epinephrine called metanephrine, used in the diagnosis of a very dangerous, but admittedly very rare,  neuroendocrine tumor called pheochromocytoma. I’m trying to save myself and my doctor a lot of headache by getting the baseline levels of adrenal metabolites."
  },
  {
    "medication": "Kapvay",
    "comment": "Yea, I've been down that road and I'd recommend getting on Intuniv or Kapvay ASAP. Your doctor shouldn't have any hesitation with prescribing them since they're  not a controlled substance and their \"base\" chemicals (tenex and clonodine) have been around for ages and are very safe."
  },
  {
    "medication": "Kapvay",
    "comment": "I would suggest giving Vyvanse a try. Amphetamines do have significant similarities, but also significant dissimilarities.\n\n\nBut, I can’t function at my work, without meds. So, if you can go down the road without, then more power to you. \n\n\nYou can give Strattera a try. Most say it takes about a month to feel anything. Reviews after ... well, it works for some. So, worth trying."
  },
  {
    "medication": "Kapvay",
    "comment": "Gave Strattera a shot. Was miserable. \n\nAm generally against the use of amphetamines for the treatment of pretty much anything, except as a last resort. \n\nBut again, I’m not looking for med advice. The original question was how to get through the horrible depressive symptoms I’m having to deal with right now."
  },
  {
    "medication": "Kapvay",
    "comment": "Yeah, I’m sorry. Half the reason I take Adderall is just to get 5 hours of relief from depression. \n\n\nIn college, I would sometimes have to take a dose in the evening, because I was at my apt, alone, tying another noose. College was not my friend.\n\n\nAnyways, I’m still alive. And Adderall is partly to thank.\n\n\nBut, it’s also luck, since I would try to pass out before the nightly withdrawal kicked in."
  },
  {
    "medication": "Kapvay",
    "comment": "I have very similar struggles and I have struggled with the idea of RSD because I don’t find a lot of supporting stuff in the literature. However, there is some really interesting brain study stuff looking at the connection between parts of the brain that modulate stress responses and long-term outcomes. I believe that some people take Intuniv along with their stimulant medication as a way to regulate that mood. I currently take Abilify and it helps enormously. When I learn that my brain might not be capable of acting properly in those situations I started to focus on recognizing when that was happening and really communicating with people that I needed a break."
  },
  {
    "medication": "Kapvay",
    "comment": "When I first read about RSD it explained so much about myself and just made perfect sense. I finally understood what was going on with me emotionally and how it controlled so much of my life. Because I have more self awareness about it, I’ve been able to really work on it with my therapist. I’m able to realize those moments where I may not have been slighted although it feels like it. I’ve been able to understand more of my past and accept some of the decisions I’ve made that I’m not proud of. I’ve tried to learn as much about RSD that I can whether it’s articles, lectures, podcasts and excerpts from ADHD books. The more I learn about it, how it affects me and what triggers it has allowed me to prepare a little more if you understand what I mean. I lied to myself for many years about my own extreme sensitivity and I’ve been able to fully accept who I am in that regard. As long as I continue to work on it i am positive I’ll be able to keep getting a better handle on it.\nI should have added- What has really helped is for me to confront an issue that I feel almost right away. Instead of letting it linger, pouting and getting more upset, I try to confront the source. As painful and embarrassing as that can feel the more you do it the better you get at it. It’s going to take some serious time and advice but I’ve already been able to stop having so many little emotional meltdowns as a result. It’s made me feel much better and much more positive."
  },
  {
    "medication": "Kapvay",
    "comment": "Please be aware that RSD, or rejection sensitivity dysphoria, is not a syndrome or disorder recognized by any medical authority. It has not been the subject of any credible peer-reviewed scientific research. It is not listed in either of the top two psychiatric diagnostic manuals, the DSM or ICD. It has been propagated solely through blogs and the internet by William Dodson, who coined the term. This means that RSD is not good science. Take it with a grain of salt.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Kapvay",
    "comment": "Thank you for your response. I know that rsd isn't part of the dsm diagnosis criteria but I haven't found any other 'label' to identify what I feel in those situations. Do you take abilify along with a stimulant medication or on its own? I'm not even sure how to start the conversation with my mental health provider about it, I didn't realize until recently that it could be caused by my ADHD and the emotional aspect of it have never been a topic of discussion or concern he mainly focuses on the distractibility aspect of ADHD."
  },
  {
    "medication": "Kapvay",
    "comment": "I find it happens to me when I’m having a lot of anxiety. I would approach the subject by saying you have a difficult time making calm and rational choices when you’re experiencing a lot of anxiety and that you want to explore some options to reduce the anxiety so that you have more time to make appropriate decisions. I take dextroamphetamine as well as Abilify. My doctor would have preferred to put me on Intuniv but my blood pressure is naturally quite low so she was concerned it would make it even lower."
  },
  {
    "medication": "Kapvay",
    "comment": "Thank you so much for all your advice, I really appreciate it!"
  },
  {
    "medication": "Kapvay",
    "comment": "ADHD SLP here. Just out of grad school. Make lists. Make an itinerary for your class with every little thing you need to do, including attendance, etc. that way you will remember them. The rest will come in time. Kids will always find ways to trick us. :)\n\nFor the other things (like day to day stuff you’re told to do), keep a detailed planner and stick with it. Use it every day, even when you know you don’t have anything written down that day. Use it at home too. Take as much as possible and put it down on paper so your head is free to think about the “in the moment” awareness things. \n\nThose are my initial suggestions. \n\nYou’re right though - the combination of having ADHD and teaching is a special thing. If you wanna chat feel free :)"
  },
  {
    "medication": "Kapvay",
    "comment": "Oh uh\nwhat perfection\nmaybe you can help me with another issue *sweats* (you're an SLP)\n...Acid reflux is kind of a pain in the butt for such long stretches of speaking, I'm worried about my vocal stam-\n\nwait, no, this is about other issues, bad Aife. Haha.\n\nAnyway, Do you just mean a list of things you have to do? Like as in, writing them down for the sake of just writing them down over and over? (repetition of the things you need to do, I mean, so it get stuck in your brain.)\n\nOr a list for during class? I'd love to talk though. I cried at my mid term evaluation, so I am a bit worried. I really want the weekend to relax... only one more day of doing a bunch of work for a day or so. \n\nAlso to do work over the weekend too..."
  },
  {
    "medication": "Kapvay",
    "comment": "I hear ya. It never seems to stop, does it?\n\nAnyway, first: if you have concerns about GERD/reflux and vocal stamina, talk to an SLP about it. :)\n\nThe list: a play-by-play list of what you need to accomplish during a given lesson. Make one, keep it with you, and cross each thing off as you go. I make a new one for every session I do (just short bulleted things)\n\nThe planner idea: writing this down is not for the sake of repetition. It’s for the sake of getting as much of your cognitive load freed up as possible. Those of us with ADHD have a hard enough time remembering all the little things we have to do in our work lives. It’s nothing to be ashamed of or anything, and memory is very hard to improve. It’s much easier and more effective to supplement it instead. For example, rather than try to hang onto all of it in our (often unreliable) working memories, it’s more effective to write it down, let it go, and then reference your planner whenever you’re working. I write down absolutely everything in mine, simply because I know I’ll forget at least some of it. Think about a computer... it has a certain amount of memory, but if you let it get junked up, it can’t function as well. If you get an external source of storage like a flash drive (or a planner, in our case) then you can free up resources."
  },
  {
    "medication": "Kapvay",
    "comment": "I wish I knew this earlier in life! I recently bought an Arc Notebook and it's the only notebook I've kept more than 2 weeks. I can write on any page and move it to the correct tab or if I forget it I can write on any paper and use the punch when I get back. I even have a \"random thoughts\" section to get things out of my head."
  },
  {
    "medication": "Kapvay",
    "comment": "Well I appreciate the advice, and I will utilize it in the future, but I have learned today that my student teaching has been terminated from parents who complained about me that reached administrations ears.\n\nKind of an anti climatic end. I think I can try again, but, we'll have to see."
  },
  {
    "medication": "Kapvay",
    "comment": "Oooo! That sounds like a cool notebook! Do you move the pages around?"
  },
  {
    "medication": "Kapvay",
    "comment": "I'm sorry that happened to you :(\n\nI'm a teacher and it is so hard, so fast-paced, with SO much to do (all at the same time), while being bombarded with sensory input from everywhere and everyone. Add the pressure of being a student teacher, knowing your being evaluated and it's even worse. Student teaching was one of the hardest things I have ever done.\n\nTake these suggestions, and your feedback and give it another try."
  },
  {
    "medication": "Kapvay",
    "comment": "You can but you don't have to :) it's called a disc bound notebook and a couple of brands make them. Some people dislike the wobbly discs and sometimes the pages pages can pop out the the pros for me definitely outway the cons.\n\nBe careful - the notebooks are reasonable but the accessories are where they get you for price.\n\nSome of the customizations/accessories I have are: pocket dividers, tab dividers, calendar(that I usually forget to use), sticky note holder, task paper, custom punch (to add pages to the notebook when I forget my notebook)\n\nYou can also buy pen loops, a pencil case, rubber bands."
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks, I really needed that.\n\nI'm hoping it all works out. I'm going to try to go talk to the coordinator next week to make absolutely sure I can do it again.\n\nHonestly I am less upset about losing it in concept then I am it... extending something I wanted to do in my personal life that I had been pushing back till I got my degree. Nows its another 8 months... That's a hard pill to swallow for me. \n\nBut I am a positive girl so I will see what I can do. Once I'm done sulking I'll figure out what I can do to prepare. It just sucks I couldn't get a chance to implement my mid term changes before parents and administrators got me terminated, haha."
  },
  {
    "medication": "Kapvay",
    "comment": "I had to try 5 different types of ADHD meds to find a combo that worked.  All of them partially worked, and one of them worked really well (first one I tried) but I had to stop that med due to a side effect.  So it took a long while before we got to my current combo of meds.\n\nWhich meds have you tried?"
  },
  {
    "medication": "Kapvay",
    "comment": "I'm currently on my fourth medication. \n\nConcerta > Adderall > Ritalin IR > Dexedrine\n\nI took Ritalin for several months. I thought I had finally found the right med and dose but I started developing some weird side effects and needed to switch. \n\nI'm still new to Dex but I think it is working out. I'm also now just realizing how agitated and grumpy Ritalin made me.  \n\nI'm so much calmer on Dexedrine. I still maintain my focus but it's not a tunnel vision. I don't think I'm on the right dose yet but I'm sensitive to these types of meds. I have to give my body time to adjust.\n\nI was pretty upset when I had to admit that Ritalin was not a good fit for me. I was afraid that I'd have to stop taking meds altogether but that doesn't actually seem to be the case. It's crazy how differently we all respond to one medication to the next. \n\nI knew trying meds would be a long road of trial and error. It requires so much patience. I wish more therapists and psychiatrists explained this when they first prescribed the meds."
  },
  {
    "medication": "Kapvay",
    "comment": "I have tried concerta/ritalin/dexedrine, they all gave me emotional blunting or severe depression. Then I started on SSRI which fixed the depression issues, but the emotional blunting got even worse when combined with stimulants. It also made me more sensitive to sounds and lights even on low doses. I also tried guanfacine, which made me drowsy and did not improve focus. \n\nI have yet to try Wellbutrin and strattera, If those 2 don't work I will seriously be considering ending my life."
  },
  {
    "medication": "Kapvay",
    "comment": "Well I have tried Sertraline for my depression, which I am currently on. My general doc gave me wellbutrin to see if that helped with my ADHD, but it didnt, although i didnt get to a very high dosage. I have also tried Ritalin and Adderall, both do not work too well either...I am seeing new phsychiatrist on Wednesday <3"
  },
  {
    "medication": "Kapvay",
    "comment": "Thank you so much for sharing. Yes after reviewing whats gone on with so many others, I've realized that itll be a long trial and error. <3"
  },
  {
    "medication": "Kapvay",
    "comment": "Please dont do that. My best friend just went through an episode this weekend at my house. He has a concealed weapons permit. And he took shrooms and did Whip its at my house, and eventually it got to the point that he was hilucinating and pointing it at me and my gf, aaying he was in control of us, and that he was going to kill himself, and that he thought I was a robot, I eventually had to call the cops on my best friend. DO NOT END IT. People love you and you dont even realize. I hate my life, but Id rather make some people the love me keep loving me instead of making them more sad, and then to realize there was nothing after death, since I wouldn't be able to realize anything. Lets get through this together. Stay friends with me, and we will stay on the journey my friend. I hate it too. It sucks balls. But I KNOW people love you. <3"
  },
  {
    "medication": "Kapvay",
    "comment": ">Well I have tried Sertraline for my depression, which I am currently on.\n\nSertraline also known as Zoloft is a great medication for certain disorders like depression and anxiety it will not do anything really for ADHD though.  Different neurochemicals are affected, that said ADHD does increase the chances of depression and untreated depression increases severity of ADHD issues like concentration, motivation, working memory, etc.\n\n&nbsp;\n\n&nbsp;\n\n>My general doc gave me wellbutrin to see if that helped with my ADHD, but it didn't, although i didn't get to a very high dosage.\n\nWellbutrin can help ADHD at any dosage, but in studies if the goal was to help ADHD often it took the higher dosages like 300 and 450 mgs a day to get a serious improvement on ADHD symptoms.\n\nYet even on high doses only about 30 to 40% of ADHD people see a serious improvement, or a complete elimination of ADHD symptoms.  Besides the 30 to 40% there are a lot of partial responders where you may see some improvements but it is just not enough they still have ADHD, and sometimes that partial improvement is not worth any side effects they may get on the medicine.\n\n&nbsp;\n\n&nbsp;\n\n>I have also tried Ritalin and Adderall, both do not work too well either...\n\nMay I ask why did they not work?  Did they not have benefits, did they have side effects?   **This is very useful and important information.**  Sometimes these meds do not work until you address a specific side effect such as anxiety or such, but once  you add a different medicine to treat the side effect like an anti anxiety medication or the ADHD medications intuniv or kapvay then these meds start working.\n\n&nbsp;\n\n&nbsp;\n\nSo you still have not tried.  Note each bullet is a med class that treats ADHD differently than the  meds you have tried.\n\n* Strattera also known as Atomoxetine, note this med can be combined safely with Zoloft.  If your side effects are too severe try a lower dose and be more gradual with the dose increase.  Zoloft uses a liver enzyme that increases the effective amount of Strattera in your system for this liver enzyme breaks down and removes Strattera and Zoloft is an inhibitor of this enzyme and thus it takes longer to remove Strattera.  Note Zoloft is a much weaker inhibitor of this enzyme than 2 other SSRIs which are fluoxetine / Prozac and paroxetine / Paxil.  Two other SSRIs Escitalopram / Lexapro and Fluvoxamine / Luvox do not affect Strattera levels at all.\n\n* Intuniv or Kapvay (similar meds but also slightly different.)  Intuniv is known as Guanfacine Extended Release (the instant release does not work as well as the ER version, the ER version is now generic).  Kapvay is known as Clonidine Extended Release (the instant release does not work as well as the ER version, the ER version is now generic.)\n\n* Provigil also known as Modafinil\n\n* Tricyclic Antidepressants, these meds for ADHD are often tried last.\n\n----\n\n&nbsp;\n\nSo you have lots of ADHD meds to still try, furthermore you may still do well on Ritalin and Adderall if we do something different but that is more information you need to give the doctors on why did it not work."
  },
  {
    "medication": "Kapvay",
    "comment": "Appreciate your concern but honestly I don't give a fuck anymore. I realize people love me, if those meds don't work its the only logical thing to do. I welcome death if it means peace and quiet. We all gotta go one day, if refuse to live with ADD thats untreated, the constant lethargy and fatigue, the brain fog, failing everything. Honestly I have been dead inside for years, I don't even mind/feel sad if I would do it."
  },
  {
    "medication": "Kapvay",
    "comment": "Are you religious? I am Atheist. If you are religious, it must feel really nice to \"know\" that there is something afterwards. Very comforting feeling. I don't have that."
  },
  {
    "medication": "Kapvay",
    "comment": "I am Atheist. I don't believe in any god or higher power. But I have no proof that there is nothing afterward as well, but I tend to float towards that belief."
  },
  {
    "medication": "Kapvay",
    "comment": "really only read the bottom, alcohol and adderall are not recommended because it prevents the effects of the alcohol being realized, wears off and causes alcohol poisoning. \n\nAnxiety and adderall sounds more plausible than just alcohol, but your unique body chemistry may have resulted in a spike. Generally the anxiety is *worse* when starting but can persist. Lot's of people with anxiety can't take stims, or at least need something else with them...\n\nDon't drink for the first couple weeks until you're familiar with your body's reaction to just the meds, give yourself the time to get used to what it is doing to your body, don't add variables out of the gate.\n\nIf Adderall is fine on it's own two weeks later, a couple beer shouldn't be an issue 8 hours after your dose. If so, you may have a unique interaction that you should look into further.\n\nEdit: 2nd day you didn't take the 2nd dose, maybe it's too high, which would make sense if you had an enzyme dysfunction (cytochrome class).\n\nwhat other meds are you on if any? some can reduce/increase effectiveness or even delay the onset: i had to switch from a PPI to an H2 as xr was lasting ~5 hours."
  },
  {
    "medication": "Kapvay",
    "comment": "1) Yes adderall by itself can cause anxiety.  In fact its one of the most common side effects of adderall.\n\n* 1b) Alocohol can cause anxiety by itself.\n\n* 1c) Most likely both together are more likely to cause anxiety.\n\nFor 2....let me just answer without numbering questions.\n\nWe have many types of ADHD medications, here is me linking to another post so I do not repeat myself.\n\n[See the post which I number ADHD meds 1 to 7](https://www.reddit.com/r/ADHD/comments/3vxo80/my_adhd_friend_says_awful_things_when_angry/cxrmcec?context=3)\n\nNow in that post\n\nStimulants both 1 and 2 can sometimes treat anxiety but far more often they cause anxiety.  Also please watch that six minute video I include about how the meds work differently from each other.\n\n&nbsp;\n\nWhile stimulants can cause anxiety just because you get anxiety on one stimulant does not mean you will get anxiety on the other type like methyphendiate.  Furthermore even of meds of the same class such as amphetamines meds of different doses or of different ratios of active ingredients can have different effects.  Often a higher dose causes anxiety but sometimes a low dose causes anxiety but a higher dose activates the frontal lobe and this in turn gives you more self control and emotional planning which prevents anxiety.\n\nOf the amphetamines there are 3 different ratios of active ingredients since all amphetamines have two active ingredients (meth is not an amphetamine but instead a different drug.)\n\n* L-Amp which is weaker in D-Amp in affecting the emotional brain equally strong with the frontal brain.  Has more cardio side effects such as higher heart rate.  Often we want low or no L-Amp and more \n\n* D-Amp, the stronger of the two meds in the emotional brain and this in turn helps focus, attention, etc for the emotional brain adds \"incentive and saliency\" to all decision making which causes you to choose X vs Y.\n\nWell here are the ratios of various amphetamine meds\n\n* Evekeo, 50% / 50% mixture of D-Amp and L-Amp\n\n* Adderall 75% D-Amp, 25% L-Amp\n\n* Dexedrine 100% D-Amp, Vyvanse active ingredient is D-Amp but it is bounded with another molecule called Lysine to form Lysine+D-Amp until your body breaks it down into the components Lysine and D-Amp giving this med a unique form of time release.\n\n&nbsp;\n\n&nbsp;\n\nNow the medicines that are called Strattera.  Strattera was investigated as an antidepressant and also an anti anxiety medication.  It does treat depression and anxiety but not as well as a SSRI and thus it was never approved to be a \"antidepressant\" in the US but it was approved as an ADHD medication.  There are benefits and downsides of strattera where its an ideal medicine for some ADHD but not for others, one downside is it takes 2 months to kick in, yet side effects are immediate.  With strattera many of the side effects diminish with time.\n\n&nbsp;\n\nIntuniv and Kapvay are alpha 2 agonist medicines.  These are artificial norepinephrine receptor agonists aka they turn on some of the norepinephrine receptors but not all of them, and in the process shift the ratio of which of the norepinephrine receptors get turned on.\n\nThis in turn helps the frontal lobe with concentration, the emotional brain with impulse control and emotional control, and also can treat anxiety.  Intuniv is an off label anti anxiety medication, Kapvay is an onlabel anti anxiety medication (off label means we know it does these conditions but it is not as effective as other meds or it is merely FDA approved for other conditions and not the \"off label condition\".)  Intuniv and Kapvay are also medicines that lower blood pressure.\n\nKapvay has more anti anxiety effects than Intuniv and Kapvay is even used for things like Post Tramuatic Stress Disorder and Panic Attacks.\n\nIntuniv advantage is its less likely to make you tired, while Kapvay advantage is that it is purposefully a sedative due to the ratio of messing with this norepinephrine receptor vs that receptor.\n\nNow norepinephrine receptors are technically called adrenergic receptors.  Most of the time norepinephrine is triggering these receptors but other neurotransmitters including adreanline can trigger these receptors.  Adreanline triggers some norepinephrine receptors much stronger than others, Intuniv and Kapvay are triggering the ones related to focus and thinking and not the fight or flight heavy receptors adreanline wants to trigger.\n\nIntuniv and Kapvay can also be combined with Stimulants and are often combine if you have side effects with stimulants such as anixety.\n\n&nbsp;\n\n&nbsp;\n\nIf those meds fail some of the strongest anti anxiety medications are the tricyclic antidepressants.  They work like your SSRIs plus they do a whole lot of other things in combination.  We try not to use TCAs not because they are bad but often because other meds treat depression, anxiety, ADHD etc with less side effects but you may need to try a TCA.\n\n#What you need to take away from my post\n\nIs that finding the right medicine or medicines is trial and error.  It should be something you do with your doctor and you need to understand that there is not 1 size fit all with ADHD medicine.\n\nOver 90% of ADHD people benefit from some ADHD medicine but individually they may benefit only 60 to 70% of each individual class of medicine, taking a few different trials for you do not get all those 90% on the first medicine you try.\n\n**Am I making sense to you?**"
  },
  {
    "medication": "Kapvay",
    "comment": "Since you are a dad please watch the two videos I linked in #3 and #4 I am now linking to a previous post I wrote today\n\nhttps://www.reddit.com/r/ADHD/comments/3vx32a/i_think_i_have_some_form_of_add_but_my_parents/cxrg34m\n\nAlso if you find those useful this website and these 5 videos would be helpful :)\n\nhttp://adhdlectures.com/lectures.php\n\nThe 2nd link has 5 videos for the recently diagnosed to ADHD to help educate parents who have kids with ADHD (but it will help the recently diagnosed parents as well :) )"
  },
  {
    "medication": "Kapvay",
    "comment": "Hi, thanks for the response. Anxiety seems to be the thing. I'll contact my Dr, but maybe splitting the 5mg and taking 2.5 in am, and 2.5 in afternoon would work better.\n\nI also take 12.5mg lexapro, and Nexium OTC daily."
  },
  {
    "medication": "Kapvay",
    "comment": "i know you know your chemistry from previous posts, So why not mention amphetamine is an enantiomer (chiral), d-amp and l-amp *are* the same compound just mirror images.\n\nLevoamphetamine causes more Norepinephrine release than dopamine (5:1) compared to Dextroamphetamine's (1:1) Levo tends to help hyperactivity more and works on the peripherial nerves, cold hands and anxiety, while dextro helps the inattentiveness more, and is generally considered \"smoother\".\n\n\"Meth\" is meth*amphetamine* having only an additional methyl group attached to the parent compound, and is the active ingredient of the ADHD medication Desoxyn."
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks for the details! Do you do research on ADHD?"
  },
  {
    "medication": "Kapvay",
    "comment": "Nexium is a proton pump inhibitor (ppi) and reduces stomach ph, if it's adderall XR, that reduced ph means it will break down the extended portion (XR) faster then intended, basically making a smooth IR. Also low stomach ph increases the absorption into your bloodstream."
  },
  {
    "medication": "Kapvay",
    "comment": ">i know you know your chemistry from previous posts, So why not mention amphetamine is an enantiomer (chiral), d-amp and l-amp are the same compound just mirror images.\n\nBecause I literally forgot to do that 1 sentence.  Forgive me for I have written 5000 words on the ADHD reddit during some of my \"break times\" today when I am doing other projects aka real work. :P  Sometimes I forget details ;)\n\n&nbsp;\n\n&nbsp;\n\n>Levoamphetamine causes more Norepinephrine release than dopamine (5:1) compared to Dextroamphetamine's (1:1)\n\nI am going to have to disagree here. (Though I reserve the right later on to go home and confirm this and find out either I am right or you were right and I retract this).\n\nL-Amp and D-Amp are roughly equal on how much they inhibit the NET reuptake transporter based off the reading I have done on the issue.\n\nD-Amp is stronger at effecting DAT.  Now this modifies which brain regions are affected by a L-AMP + D-Amp mixture vs a D-Amp only mixture\n\nI can quote numerous stuff but here is one\n\nhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC3666194/\n\nA better article is in one of my springer pdfs that I have at my house, if you are still interested I can find it later on today.\n\nSo while we agree the ratio of NET and DAT affected are different I am going to have to disagree with the actual words you wrote.\n\n\nYou should not equate DAT with dopamine and NET with norepinephrine for even though those are the names of the reuptake transporters that is not the same as how it influences the actual neurotransmitters since in some brain areas NET controls dopamine reuptake such as the frontal lobe.  This is a common error due to the fact we named these reuptake transporters certain names before understanding these reuptake transporters deal with dozens of neurotransmitters and they share some overlap like how NET can reuptake dopamine and DAT can reuptake Norepinephrine.  Thus you can't equate D-Amp vs L-Amp products as saying its stronger for Norepinephrine or Dopamine.\n\n&nbsp;\n\n&nbsp;\n\n> Levo tends to help hyperactivity more and works on the peripherial nerves, cold hands and anxiety, while dextro helps the inattentiveness more, and is generally considered \"smoother\"\n\nAnecdotal stuff that is for a large part of the ADHD population but not a universal thing.  You are oversimplifying the biology and the chemistry of these meds and due to the fact that dozens of things are happening at once you can't universalize.  In some people the extra \"norepinephrine effects\" below the neck causes anxiety in people that dexedrine / vyvanse does not, triggering stuff such as the Beta receptors in the blood stream accelerating things like the heart rate and breathing which can't be counterbalanced by other neurotransmitters and the vagus nerve and this leads to anxiety and sometimes panic attacks.  In other people (a second group) the fact you L-Amp affects the frontal lobe equally as well as D-Amp and not causing the emotional side effects D-Amp can for too much dopamine in the emotional brain can destablize the emotional brain and lead to things like emotional flattening, anger, sadness, as well as anxiety and feeling on edge.  Thus in the 2nd group of people the roughly equal effects onf D-Amp and L-Amp on the frontal lobe while not the stronger effects on the emotional brain that D-Amp causes makes products with a higher L-AMp concentration such as Adderall and Evekeo to be better at treating anxiety.\n\nIn other words its not 1:1 and even quoting percents is misleading you need to demostrate this effect visually and thus why I did not get into this.  For example you may get an effect like two humps similar to how a two humped camel is instead of a traditional bell curve similar to a different breed of camel.\n\nLike I said trial and error and the OP should be talking about this with his doctor for he would be better able to answer these questions.  Sometimes more technical information is not better and confuses people without a science or medical background. \n\n&nbsp;\n\n&nbsp;\n\n>\"Meth\" is methamphetamine having only an additional methyl group attached to the parent compound, and is the active ingredient of the ADHD medication Desoxyn.\n\nYou are not understanding the point.  Yes chemically you are correct, chemical meth is amphetamine with an extra 3 atoms (replacing 1 hydrogen with CH3) but that vastly modifies the biological effects of the chemistry.  Sometimes a few extra atoms makes a big difference on  how it responds to the body.\n\nYes it treats ADHD the exact same way and is believed to be a little stronger than the traditional amphetamine based meds like vyvanse and adderall (I have not seen any recent head to head studies though).\n\nBut the intersection of chemistry and biology makes this complicated and thus you do not understand how your answer can give a person the wrong impression.\n\nMeth is not like amphetamine for your body can't \"get rid of it the same way as amphetamine, just like how modifying the OH on the catechols of a catecholamine modifies how COMT interacts with neurotransmitters such as dopamine vs other similar chemicals such as p-tyramine or phenethylamine (B-PEA).  Those extra OH on the monoamine ring make a huge difference (On a side note those OH that makes it a catecholamine instead of a monoamine is also why dopamine can't cross the blood brain barrier)  Well those extra methyl molecule modifies how the body can respond to it via things like MAO.  For example MAO can barely effect amphetamine but has no problems with BMPEA or NMPEA for having the 1st methyl group on the Alpha position of the substituted phenethylamine vs other positions like the  Beta position modifies how MAO interacts (making it very hard for MAO to break it down) even though Amphetamine (also known as AMPEA or alpha-methyl-phenthylamine) is an isomer of BMPEA\n\nStructure matters\n\nAnd this is not just nerd chemistry talk but actually makes a huge difference.  If you search google scholar and look into the scientific papers into this you get articles with titles such as \n\n>[Methamphetamine influences on brain and behavior: unsafe at any speed?](https://scholar.google.com/scholar?cluster=5736498068720625411&hl=en&as_sdt=5,44&sciodt=0,44)\n\nBut its numerous articles not just this one.  Those extra atoms pretty much make meth neurotoxic in almost all conditions by itself even though the amount of neurotoxicity can vastly change depending on how you take it.  Unless you take it with a 2nd substances to counteract the neurotoxicity meth is not good for the brain.\n\nWhile amphetamine can be neurotoxic it is a lot harder to be neurotoxic and the benefits to cause are vastly different.  Furthermore and if used correctly in people who actually need it such as ADHD people (which on average have lower PEA levels than non ADHD people and Amphetamine is a modified version of PEA designed to remedy this problem), this is because PEA in the brain is an actual defense mechanism from neurotoxicity of other neurotransmitters such as Glutamate and Dopamine it is only when your body where something absolutely goes wrong such as you taking an external source of a PEA like substance that your body can't cope with the change that bad things happen.\n\nSo yes Desoxyn is an ADHD medicine but it is not used and has less than 0.2% of the ADHD market and a far lesser amount once you account for the price difference for almost always its not a good idea and its only a medicine of a last resort for ADHD but also for Narcolepsy."
  },
  {
    "medication": "Kapvay",
    "comment": "I am not a doctor or medical expert, nor do I claim to be.\n\nI am a college student, doing my 2nd attempt at college.  The first attempt was partially successful in a different subject but due to undiagnosed ADHD (at the time) but also lots of other stuff with an anxiety disorder ...I made little progress during my first attempt.\n\nMy intention is to finish my bachelors and then go into medicine.\n\nI do not claim to be a medical or ADHD expert but because I find this interesting I have read several hundred (I am not exagerating) peer reviewed medical journals about ADHD, ADHD and the Brain, how these drugs work etc."
  },
  {
    "medication": "Kapvay",
    "comment": "A great website is CHADD which is an advocacy organization for ADHD.\n\nUntil recently CHADD via a grant with the US goverment ran a website called the National Resource Center on ADHD which was not a CHADD website but instead a .gov website even though CHADD ran it but posted topics as covered by the grant.  To my the organization that is seperate from CHADD still exists but all their website was incorporated in the main CHADD website and is now harder to locate,\n\nBut on stuff appropriate to you, here is a table listing all these meds I was talking about, it used to be far easier to locate and find.\n\nhttp://www.chadd.org/Understanding-ADHD/For-Adults/Treatment/Medication-Management.aspx"
  },
  {
    "medication": "Kapvay",
    "comment": "Just regular adderall. Interesting things to consider."
  },
  {
    "medication": "Kapvay",
    "comment": ":) i do appreciate your detailed responses, i oversimplified on purpose (use words like generally and tend to) because i don't have the depth of knowledge to make all of the differentiations, only the general, meanwhile understanding the complexity and diversity possible.\n\nIt's ok i don't need sources, there's enough information i can't account for in my mind as it is, and why we have things like Google and yourself :)\n\nKeep doing what you do!"
  },
  {
    "medication": "Kapvay",
    "comment": "From my experience with Adderall(not the same medication but similar), I never really noticed a significant increase in duration from increasing the dosage.  You can try to get vyvanse prescribed which is an extended release version of Dexedrine or or the extended release of Adderall which is slightly different to dexedrine but is availible in generic if your insurance won't cover Vyvanse if increasing the dosage doesn't work."
  },
  {
    "medication": "Kapvay",
    "comment": "Not for me. The main difference is the intensity of the high and intensity of the crash."
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks for your input, it seems either the dose increase didn't do anything to the lasting time (maybe like 10 minutes) or the drug actually stops working after i eat, going to experiment with that.."
  },
  {
    "medication": "Kapvay",
    "comment": "I am trying Dexedrine because vyvanse would only lasted me about 2-3 hours...\ntried 10mg dexedrine today, and still only lasted 2 hours, i am starting to suspect that the drugs stop working after i eat something, i might try not eating for 3-4 hours tomorrow after taking my dose and see if it makes a difference...any input about this?\nif that is not the case, i might need to dose every 1 hour and 50min or 2 hours, which would be irritating but doable i guess..."
  },
  {
    "medication": "Kapvay",
    "comment": "What dosage of Vyvanse were you taking?  Just curious because from what I understand the mechanism for its extended release makes it so a larger dose will increase the duration(it is a prodrug that breaks down over time into dexedrine and the body can only break down so much at a time) it still might increase intensity so just keep that in mind.  \n\nHas your doctor tried prescribing you adderall or ritalin?  Everybody with ADHD responds differently to each type of stimulant and Dexedrine just might not be the right one for you, also some people with ADHD respond better to some of the non-stimulant options.\n\nI don't believe eating as a whole should effect the duration but I do believe acidity can weaken the effects, so if you drink a lot of soda or other more acidic drinks I would try to avoid those and see if that helps."
  },
  {
    "medication": "Kapvay",
    "comment": "I have tried everything from 10mg to 70mg Vyvanse, 30-40mg gives me the desired effect, but lasts about 3 hours at best, 60-70mg lasts maybe 4 hours but it gets too intense, and I end up just getting a euphoric feeling the whole duration and horrible side effects as well.\n\nI have tried both Ritalin and Concerta, which gave me horrible side effects,  and it's not possible to get Adderall in my country(Denmark)\n\nMy next move is to try 5mg 4-5 times a day dosed every 1 hour and 50 minutes and see if that is maintainable, if not I am not sure what my next move will be.\nI know there is a drug called Strattera, a non-stimulant medication which is supposed to build up in your system, but I have heard NO, seriously NOT A SINGLE good thing about this drug from all the places I've looked, thus I have been reluctant to try it."
  },
  {
    "medication": "Kapvay",
    "comment": "From what I have heard of Strattera(I believe Wellbutrin is a similar medication that is prescribed for ADHD as well) it is very hit or miss but I have read posts on this reddit of people having great results with it.  From what I understand it is most often a medication considered when stimulants seem to not work.  Also there is clonidine(Usually the xr Kapvay is used for ADHD) and Guanfacine (xr is Intuniv) that have been found to help with ADHD symptoms as well but do seem to be less commonly used.  I take Kapvay alongside Vyvanse(recently switched from Adderall XR) and Kapvay has really helped a lot with the constant internal voice and wandering mind as well as sleep but not sure how well it will work by itself.  Out of curiosity what sort of ADHD where you diagnosed with(more hyperactive or inattentive). \n\njust fyi I live in the US so like with Adderall things might be different for you"
  },
  {
    "medication": "Kapvay",
    "comment": "Getting used to a drug is known as “tolerance”"
  },
  {
    "medication": "Kapvay",
    "comment": "I've taken the drug (vyvanse) for years (I'm a senior in college and I started in my junior year of high school) \"tolerance\" feels like a bit of an odd concept to describe what I'm talking about here, as I've tolerated the drug for years and it hasn't gotten much better. I'm quite used to the effects of vyvanse, haha.\n\nBut I suppose it could be for specific doses, I just never seemed intuitive to me to call it \"tolerance\". Ho hum."
  },
  {
    "medication": "Kapvay",
    "comment": "Tolerance is basically the biological or psychological expectation of a certain amount of a drug to be in your system. It is very much possible for it to work for specific doses."
  },
  {
    "medication": "Kapvay",
    "comment": "Well, that makes sense I guess. I feel like something to do with expectations might describe that phenomenon more succiently, but I ain't a doctor or a medical researcher so I'm not going to question too hard why that word was used \n\nI'm a bit miffed this wasn't explained to me when I was switching doses to lower side effects beforehand, maybe it was just a miscommunication about how long I had tried."
  },
  {
    "medication": "Kapvay",
    "comment": "Here's how tolerance works, this might help understand the concept (sorry if this isn't your issue I only skimmed the post tbh).. basically when you introduce a drug to your brain that changes the way the brain works, it will over time change the way it works to counteract the drug. So for example adhd meds stimulate your brain, in response your brain will naturally inhibit itself therefore reducing the baseline level of stimulation and eventually causing the drug to bring you to your \"normal\" or pre-drug level of stimulation.\n\nThis is how physical addiction works too. Your brain adjusts to the drug so that it functions normally under the effects of the drug, and when you take the drug away the changes your brain put in place to counteract the drug are still in place for some time, and so you experience physical symptoms as a result. For example you might feel extra tired if you have a tolerance to adhd meds, and you don't take them one day for whatever reason.\n\nDoes this sort of clarify it for you? It seemed like you're thinking of tolerance as how well you handle the drug, in terms of like side effects I'd guess? Or how comfortable it feels? That's not really the case, it's more of an objective measurement of how much your body counteracts a given drugs effects. And again I apologize if this wasn't an issue, I only skimmed the post."
  },
  {
    "medication": "Kapvay",
    "comment": "Probably was, not my place to judge what you discuss with your doctor however."
  },
  {
    "medication": "Kapvay",
    "comment": "I appreciate it, it does make it clearer. And you're correct that's exactly how I was interpreting it. Rip. I was thinking it was just your body's ability to handle the drug's effects (side or not). So I didn't think it could work in reverse."
  },
  {
    "medication": "Kapvay",
    "comment": "#On another note, what other ADHD meds have you tried?\n\n#You may want to start adding or switching to other ADHD meds.  \n\nI will go through the 7 types of ADHD meds used in the mainstream psychiatry community for ADHD and how they affect addiction.\n\nOn Label ADHD meds for this post, off label ADHD meds next post\n\n2 classes of stimulants are on label, 2 classes of non stimulants are on label meant as first and second line ADHD mediation\n\n3 classes of non stimulants are off label for ADHD, these meds are meant for other disorders but are used when the other 4 classes of meds do not work or have side effects, or when you have multiple conditions and these meds also work for those conditions.\n\n-----\n\n&nbsp;\n\n&nbsp;\n\n**Amphetamine Meds**, such as Vyvanse, Adderall, and Evekeo\n\nVyvanse is the hardest form of amphetamine to abuse.   This is because taking a larger dose does not increase the dopamine all at once, because of a rate limiting enzyme.  Thus it is harder to get high, and if you are using it over several times per day for performance enhancement that means you are not getting enough ADHD treatment anyways and your doctor needs to consider switching meds, switching dosages, and/or adding a nonstimulant ADHD med.\n\n----\n\n&nbsp;\n\n&nbsp;\n**Methylphenidate Meds**, such as Concerta, Ritalin, Daytrana, Quillivant XR, Focalin, Metadate, Methtylin \n\nThe skin patch Daytrana is the hardest form of methylphenidate to abuse.  This is because it is absorb by the skin and it is the slowest form of methylphenidate to enter the body on a rate per hour basis.  Yet Daytrana works as long as the patch is on your body and thus you have control over it for the entire day.  It takes a few hours after the patch is removed to the Methylphenidate to leave your system.  If it is too slow early in the morning you can always ask your doctor for a very small instant release IR ritalin or other form of instant release methylphenidate.\n\n---\n\nStrattera, Intuniv, and Kapvay are non abusable nonstimulants.   Intuniv and Kapvay belong to the same class of medication but they are different enough that you should try both if you have the types of problems Kapvay does that Intuniv does not.\n\n----\n\n&nbsp;\n\n&nbsp;\n\n**Alpha 2 Agonists meds** such as Intuniv and Kapvay\n\nIntuniv was designed to be combined with stimulants and to also help reduce stress, reduce impulsivity, and help emotional self control, aka everything that is hard to do with a substance abuse problem.  Intuniv also treats ADHD by itself or it makes the stimulants more effective with less side effects and more self control when combined with a stimulant.  Intuniv does not increase dopamine at all, but instead enhances norepinephrine and adrenaline when its too low, and lowers it when its too high such as when you are stressed or anxious.\n\nKapvay is a similar ADHD med but has some positives and downsides compared to Intuniv.  It works on more different types of neurotransmitter subtype receptors.  Because of this Kapvay can make you tired in a way Intuniv only does so when the dose is too high or the first week or two you are on it.  The positive benefit is via activating those additional receptor subtypes Kapvay is a better anti anxiety med, better pain management med (both intuniv and kapvay can help some forms of pain but Kapvay is stronger), and Kapvay is used to treat withdrawal symptoms of Nicotine, Alcohol and Opioids making the withdrawal negative symptoms less bad.  Kapvay also can be combine with stimulants, and Kapvay has a drug with the same active ingredient called Catapres in a skin patch though it may be more expensive and harder to get via insurance due to Kapvay being on label for ADHD but Catapres being off labeled for ADHD but intended for lowering blood pressure even though its the same active ingredient and similar effects.\n\n---\n\n&nbsp;\n\n&nbsp;\n\n**Atomoxetine/Strattera** currently the only US slow acting Norepinephrine reuptake inhibitor.  Increases norepinephrine everywhere in the brain and dopamine only in the frontal lobe and not the emotional brain/reward brain nor the dorsal striatum.\n\nStrattera is a non abusable nonstimulant.  It increases norepinephrine and adrenaline and over a longer period of time actually makes norepinephrine receptors more sensitive so that when your norepinephrine and adrenaline is too high your body automatically shuts off norepinephrine so it does not go towards a feedback loop that is broken.  It does this because you have several forms of norepinephrine and adrenaline receptors and 3 of the types are both activators and shut off switches, and the longer you are on it the more accurate the shut off switches get to where they should be.\n\nIn addition Strattera increases dopamine in the frontal lobe but does not increase it in the brain's reward center.  Yet Strattera via increasing dopamine in the frontal lobe can help with delayed gratification, for the parts of the brain tied to immediate gratification are in different places and project to different parts of the brain's reward center, the parts for the delayed gratification originate from the frontal lobe from the opposite direction, and via increasing dopamine in the frontal lobe, you in turn making it easier for the delayed gratification dopamine to loop around and trigger the reward center.  Your brain knows where the dopamine comes from the immediate gratification or delayed gratification areas and thus shifts your behavior to whichever is more intense at that moment.  Thus strattera can help people with substance abuse problems and is one of the prefered meds for people with ADHD and a past history of substance abuse.\n\nStrattera can be prescribed with an ADHD stimulant, though the FDA does not approve this as an official label indication of combinations meds though the FDA does not do combination meds unless the manufacture specifically does extra studies and requests this indication.  We just know this information through human studies that were not connected to the FDA and with animal studies.\n\nThe lower your dose you start with Strattera the lower the initial side effects.  Strattera during the first 3 to 8 weeks can make you sleepy or nauseous like you have the flu.  After 3 to 8 weeks the side effects diminish and the benefits start to kick in.  This connection with side effects and dosage is part of how the med works.  You will eventually want to go higher with the dose, and the only downside of starting small and going up to the medium or high dose or starting at the medium and then going high is the side effects kick in immediately and with greater severity vs the downside of you having to wait longer for the benefits to kick in.\n\nMany doctors who want the patient to use Strattera in combination with stimulants or switch to stimulants often start with a smaller dose than Strattera by itself and purposefully titrating up, and sometimes titrating the stimulant down once Strattera starts to work."
  },
  {
    "medication": "Kapvay",
    "comment": "roland00,\n\nYou are honestly suggesting to this person, who is \"abusing\" their ADHD meds and using alcohol and marijuana in the mix, that they should \" start adding or switching to other ADHD meds\"?\n\nI don't think it is a good idea at all that they start adding other medications in to the mix. This is not their decision, their doctor needs to make the decisions regarding their medication.\n\nWe do not know this individuals life circumstance or treatment history.\n\nwhowhatwherehowwhy,\n\nIt is important that you are honest with your doctor. It may be that you have other problems- beyond just ADHD- which need addressing.\n\nWe don't know many factors here, such as just how much Vyvanse, and alcohol you are actually consuming.\n\nIts better you start addressing these issues sooner rather than later. Good luck."
  },
  {
    "medication": "Kapvay",
    "comment": "Place your meds in a container like this that has a timer lock so once you take your pill you can't take it again until the timer goes down\n\nhttp://www.amazon.com/Kitchen-Safe-Locking-Container-Height/dp/B00JGFQTD2\n\nAlso in that pill box put a smaller pill box without a lock that is labeled days of the week like this.  \n\nhttp://www.amazon.com/Monday-Sunday-Weekly-Medicine-Storage-Pillbox/dp/B00S9DBY2S/ref=sr_1_8?s=home-garden&ie=UTF8&qid=1442334756&sr=1-8&keywords=pillbox+7+day\n\nWalmart sells cheap ones of the 2nd kind for a dollar to 2 dollars all the way up to 10 depending on features  and color and such.\n\n----\n\nThe whole goal is to turn off the automatic brain ability to do this without conscious control.  You having to think what day it is, you having to wait X hours before the next dose makes it far easier to do self control.  In addition once you are part of a group even if you take a 2nd pill accidentally or during a moment of weakness you need to call your partner.  You need to do so for it was not a conscious decision to break down and submit, but instead a long wearing down of conscious control until your automatic brain just acts.  You need the sponsor to help you stop yourself from even more of a negative spiral, you need them to help buck you up and feel a little more in control, you need them to ask questions so you can turn your attention to yourself via the process of verbalization, them asking questions help you recongize triggers and by recongizing triggers you are better able to organize your environment with your conscious mind so you are less likely to be in situations where your encounter stress or your automatic mind finds it easier to seize control from your conscious mind.\n\n**Am I making any sense for you?**"
  },
  {
    "medication": "Kapvay",
    "comment": "Is there anyone you can trust to hold your medication for you? Like are you living alone, or with a family member or roommate? \n\nI'm sorry to hear you're struggling, but don't despair, there's always options, even if you can't see them right away."
  },
  {
    "medication": "Kapvay",
    "comment": "Rehab might be the option with the best outcome."
  },
  {
    "medication": "Kapvay",
    "comment": "Off label adhd medications and their effects on addictions\n\n----\n\n&nbsp;\n\n&nbsp;\n\n**Modafinil/Armodafinil** such as Provigil and Nuvigil\n\nModafinil is a wakeful agent medication used for daytime sleepiness and narcolepsy.  It is also used for ADHD and almost got official ADHD on label approval but due to a rare genetic side effect with rashes that can become life threatening due to skin rejection in cases measured in 1 in 100s of thousands or 1 in a million chances it was decided not to be used as a first line ADHD med and instead off label for its was not more effective than stimulants and stimulants do not have this side effect.\n\nSome of the ways Modafinil works is similar to the ADHD stimulants but much of the action is done in a different manner.  Modafinil does increase dopamine in the reward center but to a lesser extent than ADHD stimulants and it has another method that it treats ADHD via using the neurotransmitter Histamine that actually makes it harder to get addictive for it diminishes the effects of over intense immediate gratification.\n\nIts type of focus is more connected to be alert and awake than the drive that vyvanse can give.  That same drive vyvanse can give also is connected to the immediate gratification reward system which can encourage addiction.  Modafinil like Strattera and Intuniv works completely different in the brain areas related to inhibition and action in a specific area of the frontal lobe.  It also has different effects on the language skills of the brain so if you do not like how the stimulants work with closing your focus you may prefer modafinil over vyvanse.\n\nIn animal studies you can train a mouse to be addicted to a substance like meth and cocaine and when those are denied the mouse will self medicate with modafinil if that is an alternate option where the mouse or rat is choosing modafinil over another rewarding substance such as prefered food.  Yet without the \"gateway addiction\" using a first addictive substance and then try to convert them to modafinil you will not see mice or rats choose modafinil vs rewarding substances such as prefered food.\n\nModafinil is sold as a study aid drug in an illegal fashion but it is not sold in an illegal fashion to get high, and thus substances such as amphetamines that can do both have higher street values over modafinil.\n\nModafinil is also being investigated as a drug to help people with stimulant addiction problems be switched to Modafinil as a permanent or temporary measure.\n\n----\n\n&nbsp;\n\n&nbsp;\n\n**Bupropion/Wellbutrin** also goes by different names and formulations such as Zyban/Aplenzin\n\nWellbutrin is a drug that kinda works like a mixture of Strattera and Methylphenidate but is weaker for both with ADHD.  Wellbutrin is an antidepressant and anti smoking medication with norepinephrine and dopamine reuptake inhibition qualities.  Most antidepressants are serotonin based and have very little effects on dopamine and norepinephrine and wellbutrin by contrast is the exact opposite with dopamine and norepinephrine qualities and to some extent acetylcholine qualities.\n\nWellbutrin is unlike methylphenidate in like Strattera it takes several weeks.  Wellbutrin does increase dopamine in the emotional reward brain area but because of how the drug works with the drug providing such a small increase of dopamine per dose and it being spread out via periods of time periods measured in days that it can help with some compulsive behaviors by increasing self control such as quitting smoking, but with some disorders especially related to eat, bulimia, anorexia, alcohol withdrawal, and opioid withdrawal it is not recommended for it can make some impulsivities worse and some it can treat, and even with the same disorders different results in different people and at different stress levels.  That said wellbutrin almost always is a plus for smoking due to its effects on the acetylcholine receptors.\n\n\n----\n\n&nbsp;\n\n&nbsp;\n\n**Tricyclic Antidepressants.**\n\nTricyclic antidepressant are another type of medication used to treat ADHD, some of these can also be used to help self control just like SSRIs and SNRIs can be used to help self control and to help promote the quitting of many addictive substances and chronic impulsivity and compulsivity disorders such as compulsive gambling, shopping, overeating, etc."
  },
  {
    "medication": "Kapvay",
    "comment": "Your replies are always really informative. \n\nHave you heard of anyone, or think it would be beneficial to take both strattera and intuniv? \n\nI really dislike stimulants, but don't feel like i'm getting enough benefit as i'd like from the strattera alone. I could continue to up the dose and see how that affects me. From each upped dose, how long does it take before you notice any difference? \n\nI tried wellbutrin for a bit but much prefer strattera. I recently restarted at 30mg for 7 days, and today I'm at 40mg. (5'10, ~150lbs)"
  },
  {
    "medication": "Kapvay",
    "comment": "You can even do stuff like placing your pills into something like wrapping paper and something that takes time to remove, and purposefully makes a mess so its harder for you to automatically do stuff without realizing it.  Things involving notes, and your visual attention where you must direct your eyes towards the goal is the type of stuff your automatic mind finds hard to do and thus must recruit your conscious mind."
  },
  {
    "medication": "Kapvay",
    "comment": ">Have you heard of anyone, or think it would be beneficial to take both strattera and intuniv?\n\nDo you mean at the same time, or at different times like they prefered intuniv over strattera, strattera or intuniv, hate both, or like both?\n\nI ask for there is a lot of info on strattera and intuniv and who responds to both, but there is so much info I need to understand your question.\n\n-----\n\n>I really dislike stimulants, but don't feel like i'm getting enough benefit as i'd like from the strattera alone. I could continue to up the dose and see how that affects me. From each upped dose, how long does it take before you notice any difference?\n\nDepends on the person, the faster you up the dose the faster you get the benefits but the faster you get the side effects.  In theory the time your body adjusts is not really dependent on whether its 0 to 40 mg or 0 mg to 20mg to 40mg\n\n>I tried wellbutrin for a bit but much prefer strattera. I recently restarted at 30mg for 7 days, and today I'm at 40mg. (5'10, ~150lbs)\n\nGood that is some less trial and error.\n\n**What does your doctor think about all this, what is he thinking?** Does he talk out loud and explain why he is thinking maybe two different options and explain why we are trying option A first over option B or does he keep it all in his head?\n\n-----\n\nIt sounds that you are really sensitive to anything that modifies dopamine in the emotional brain and the striatum, two of the 3 places ADHD can have problems, the other being the frontal lobe but not all ADHD people have problems with all 3 and some people have problems with all 3 and thus the differences in drug responses.\n\nIf you have not seen this video watch this one\n\nhttps://www.youtube.com/watch?v=LnS0PfNyj4U\n\nAnd then you should google Dr. Barkley+ADHD+Youtube or www.ADHDlectures.com for there is a lot of good non med and medical information from this leading ADHD expert.  There are alot of other good ADHD experts I can recommend but he is the most \"dense\" and useful information per minute viewed, though I do like some of the Dr. Thomas E Brown Stuff.\n\nWhen you say you do not like stimulants, all day, during the morning, midday, afternoon/evening/crash, etc.\n\nHow long were you on strattera in the past, what dose, and any medication in addition.\n\nI am not a doctor and I am not trying to give you medical advice but instead to help you understand your options so when you talk to your doctor you feel more in control and more willing to give out side effects and benefits and help inform the doctor better.  I hope you understand what I am trying to say."
  },
  {
    "medication": "Kapvay",
    "comment": "Thanks for the reply, i'll ask your questions in the same order. \n\n1. Both at the same time, without a daily stimulant. I was thinking Straterra in the morning, and intuniv at night, as it can make you feel a bit drowsy. I was hoping that i'd get more ADHD \"coverage\" without the habitual use of a stimulant unless it's something that requires a lot of focus for a long time. \n\n2. Basically, I'm my own doctor. I research stuff, then suggest it, and he says yes or no. There aren't many available resources in my city for Adult ADHD, mostly for children, that being said, I got a referral for an awesome ADHD doc, but he's unfortunately in the hospital for now. Also, i'm waiting on results from 23andme in the hopes that I can definitively pin point how my brain works, and what medication will be the best for me ( I hear there are really good services you can take the data from 23andme and gain lots of information). I should note, my current pysch doesn't believe that strattera does anything, and has yet to talk about anything rather profound as far as how to best manage ADHD.\n\n3. Things I dislike about stimulants: Although it was great for me in University while studying, etc. I now am working in my family's restaurant business and normally i'm bubbly, charismatic, sociable, etc. but stimulants actually make it difficult for me to speak and cause me a lot of anxiety- So, they're great for tasks I sit and do alone, but for my current and probable future work, they aren't ideal. Adding onto that, because my days can sometimes go until 10pm, it's not feasible to take a stimulant later in the day to avoid crashing, and still expect to sleep at night without some form of sleep aid, or, if i just take one in the morning for example to get things done before work (learning languages, investing in stocks, finishing paintings, etc.) by the time I arrive at work, or shortly after, the last thing I wanna do is socialize with people. \n\nI was on it for a couple months (50mg), and like most people mentioned, it wasn't until I stopped that I realized that it was benefiting me, but the effect on focus aren't as noticeable as stimulants. \n\nI really enjoy the anxiolytic effects of the Strattera but am hoping that at an increased dose, the mental dexterity/focus will increase as well, while allowing me to just be me, but less impulsivity, disorganization, absentmindedness, etc. \n\nI've recently registered for an ADHD course at the university, and i'm hoping that as well will answer more questions."
  },
  {
    "medication": "Kapvay",
    "comment": "I have been on medication for a year now.  I been on 5 different ADHD medications and various combinations of those medicines.  Here are some rough numbers\n\n* About 2/3rds of people with ADHD do well on Methyphendiate such as Concerta, Ritalin, Focalin\n\n* About 2/3rds of People with ADHD do well on Amphetamine such as Adderall, Vyvanse, and Dexedrine\n\n* About 80% of ADHD people do well on one of those 2 stimulants\n\n* About 90% of ADHD people do well on one of those 2 stimulants, or the 2 types of non stimulants we have specifically for ADHD.\n\n**Non Stimulants specifically for ADHD**\n\n* Strattera, an Norepinephrine Reuptake Inhibitor that increases both norepinephrine everywhere in the brain, but dopamine in the frontal lobe but not the emotional brain such as the reward center.  Thus has no potential of addiction.\n\n* Alpha 2 Agonists such as Intuniv (Guanfacine XR / ER) and Kapvay (Clonidine XR).  Alpha 2 is a type of norepinephrine receptor.\n\n * When you take an Alpha 2a agonist drug you increase the electrical activity of the frontal lobe\n\n * Alpha 2a, 2b, and 2c receptors when turned on also lower your norepinephrine levels generally.  Your body does this for it thinks your norepinephrine levels are getting too high.  Thus an alpha 2 drug treats anxiety, high blood pressure, the \"sweats\" and other side effects of too high norepinephrine which are turned on by Alpha 1 or beta receptors.  Too much Alpha 2 being turned on can be sedating.\n\n * Intuniv is an Alpha 2a drug so its is less sedating than Kapvay which is an Alpha 2a, 2b, and 2c drug.  Thus Intuniv is a better drug for ADHD but Kapvay is useful as a sleep aid or if your blood pressure is high, Kapvay will have a stronger effect on blood pressure even though both are also blood pressure drugs.\n\n\n&nbsp;\n\n**We also have 3 other types of nonstimulant drugs for ADHD**\n\nThese drugs are approved for other types of conditions not specifically for ADHD but these drugs do treat ADHD.\n\n* Wellbutrin, a NDRI antidepressant.  Ritalin treats ADHD by being a fast acting NDRI that works for a few hours.  Wellbutrin is a less strong version but it works for days.\n\n* Modafinil, a wakeful promoting agent that is not technically a stimulant but kinda works similarly to a stimulant but also different.  Pretty much it \"wakes you up\" and makes you more \"alert\".  Used to treat Narcolepsy aka chronic sleepyness during the day.\n\n* Tricyclic Antidepressants.  Work as a NRI just like Strattera, also has other receptors it turns on so it can have more side effects such as making you sleepy or cause weight gain.  Also used to treat anxiety."
  },
  {
    "medication": "Kapvay",
    "comment": "TLDR: It's a love/hate relationship.\n\nI regret that I am dependent on meds, but without them, I fail. When I do not take my meds, I gain a lot of weight and have a lot of motivation issues. I drop in and out of school, change jobs frequently, and generally make bad decisions. \n\nWith the meds, most of those issues go away, I'm stable, and can make a solid living. \n\nThe side effects I have experienced include: \n\n- devleoping \"ADHD tourettes\" where I have minor vocal tics, eye twitches, etc. \n- Depression-I'm always depressed, the euphoria feeling when I take the medicine isn't there anymore. I take it to feel normal. \n- Anxiety/Irritability - I'm either extremely nervous on the meds or extremely irritable. When off the meds I'm a lot more social.\n- Sleep/Bodily changes: I have a lot of insomia problems on the meds. I have started aging more due to the lack of sleep. \n- Empty wallet: I need to constantly fork over $100-$500 a month depending on what type of insurance I have.\n\nMy biggest gripe is they would not let me join the military due to having ADHD / taking adderall. Overall it helps me function, but at the cost of my health. I can't help but feel one day my heart will explode."
  },
  {
    "medication": "Kapvay",
    "comment": "I am so happy for medication, but I do regret letting medication enable a lot of black & white thinking."
  },
  {
    "medication": "Kapvay",
    "comment": "I've quit and started 7 times. Overall, I need it at least to survive grad school. May try to go without after."
  },
  {
    "medication": "Kapvay",
    "comment": "No regrets yet, 1 week in.\n\nI ruminate 90% less than I previously would. \nI daydream 90% less than I previously would. \nI'm finally focused on the right things."
  },
  {
    "medication": "Kapvay",
    "comment": "I've been taking medication ever since I was first diagnosed (about 15 years now) and 13 of those years have been on Strattera. Aside from 8 years where the quack doctor my parents dragged me to misdiagnosed me with comorbid bipolar disorder and I was put on meds for that that obviously didn't work, my experience with medication has been highly positive. I see such a difference in myself when I miss a couple days."
  },
  {
    "medication": "Kapvay",
    "comment": "Excellent summary! A lot of our patients (or rather, pediatric patients' moms) say that the guanfacine and clonidine really help with severe hyperactivity because of lowering blood pressure. And along with hyperactivity and use of stimulants comes a lot of sleep issues, so we also have lots of ADHD patients who are on trazodone or quetiapine fumurate/Seroquel for that along with comorbid mood issues."
  },
  {
    "medication": "Kapvay",
    "comment": "Could u take therapy with the meds?"
  },
  {
    "medication": "Kapvay",
    "comment": "You can but it adds an additional cost. Adderall brand is about $220 without insurance. Generics are $140 Having a therapist will run about $180-$300 per visit. \n\nIt's all the same stuff you would do off the meds. Eat right, exercise every day, follow a detailed schedule. For me the cost wasn't worth it. I don't respond to therapy well. everyone's situation is different, there are plenty of people that benefit from seeing a therapist. Overall seeing a therapist might be cheaper than staying on meds."
  },
  {
    "medication": "Kapvay",
    "comment": "That's one of the reasons why i'm at a standstill with getting treated. I know it does wonders on the short term, but it seems like once you hit your limit in terms of dosage, you start spiraling down again."
  },
  {
    "medication": "Kapvay",
    "comment": "Strattera is a great ADHD drug that works in some ADHD people but not others.  You will not know if it works until you try it.\n\nIntuniv also known as Guanfacine ER and Kapvay also known as Clonidine ER are ADHD medicines that work differently than stimulants.  **They are also medicines used to treat high blood pressure.**  They are  new medicines that are 24 hour extended release that came out in 2009 for Intuniv and 2010 for Kapvay.  Before the ER formulations came out the original purpose of IR Guanfacine since 1986 and IR Clonidine since 1974 is to treat high blood pressure.\n\n * How this occurs.  Both of these medicinations are norepinephrine stabilizers.  If your norepinephrine or adrenaline levels are too high these medications lower it (higher norepinephrine and adrenaline is one of many neurotransmitters / hormones that increase blood pressure).  In addition, even when norepinephrine levels are low, they also trigger a specific norepinephrine receptor called Alpha 2a which increases the strengths of prefrontal connections.  \n\n * This is a different method of action than the stimulants which increase both norepinephrine and dopamine.  These meds Intuniv and Kapvay can be used to treat ADHD by themselves or in combination with stimulants.  In most ADHD people adding one of these two medications to a stimulant works better than the stimulant alone.  (This is because your best focus, concentration, etc happens when in specific brain areas your dopamine and norepinephrine are in a medium zone, a goldilocks area)\n\n--------\n\n&nbsp;\n\n&nbsp;\n\nSo beside those medications I mentioned above which are \"official ADHD medications\" we also know of other medications that are meant for other disorders, depression and daytime sleepiness, that also treat ADHD as well.\n\n* Provigil / Modafinil a wakeful promoting medication that is meant to treat Narcolepsy and Daytime Sleepiness.  We do know it works very well for treating ADHD but not as well as the Stimulants and Strattera.  Now when I say not as well in the people it does treat ADHD it work just as well, but it treats ADHD in a smaller amount of people compared to the Stimulants and Strattera.\n\n* Wellbutrin / Bupropion a atypical antidepressant for it works on the norepinephrine and dopamine system.  This med works very differently than a SSRI. \n\n* Tricyclic Antidepressants which work on numerous neurotransmitters."
  },
  {
    "medication": "Kapvay",
    "comment": "Yeah I got terrible side effects from the stimulants. I got panic attacks (don't usually have anxiety at all) and terrible kidney pain from them and when my doctor suggested Strattera I said no way, I've heard almost nothing but awful things about it.  \n\nI've settled on trying CBT to address my issues the best I can."
  },
  {
    "medication": "Kapvay",
    "comment": "A lot of people in your situation take Strattera. Depending on how bad it is, though, some function with amphetamines and blood pressure meds. You should read up on Intuniv as a possible combo to whatever ADHD med you take."
  },
  {
    "medication": "Kapvay",
    "comment": "If Strattera works for you, it will work really well. The biggest problem (aside from the fact that it doesn't work well for something like 30-40% of people*)  is that people expect immediate results like with stimulants, whereas Strattera can take a month or more to really start working effectively. And also the side-affects for the first 4-6 weeks can be pretty bad. I would say give it a try, because if it does work, it's cool that it has a long period of effectiveness. However, give it a fair shake--plan to do at least six weeks to see if it's working. \n\nEdit: *"
  },
  {
    "medication": "Kapvay",
    "comment": "How is it possible that wellbutrin causes emotional flattening/less sociability?"
  },
  {
    "medication": "Kapvay",
    "comment": "You have many medicines you can still try.\n\nThat said the medicines you should be trying first is the alpha 2 drugs such as Intuniv and Kapvay.  These meds actually lower your norepinephrine levels which lowers your blood pressures.  Intuniv and Kapvay released in 2009 and 2010 are extended release versions of meds that have been on the market since the 80s and 70s in instant release form.  Those instant release meds called guanfacine and clonidine are blood pressure meds, they treat high blood pressure.\n\nWhat Intuniv and Kapvay do is they make specific norepinephrine receptors more sensitive to norepinephrine so less norepinephrine is needed to activate those receptors.  A specific receptor called alpha 2a job is also to tell your body when your norepinephrine level is too high and thus to lower your norepinephrine levels if its turned on.  Intuniv and Kapvay make this receptor easier to turn on so you have lower norepinephrine levels.\n\nThis same alpha 2a receptor job is to control electrical activity in the frontal lobe as well as other brain regions such as the cerebellum and the parietal sensory areas, and if triggered it can increase blood flow in these brain regions.\n\n----\n\nNow you probably should start with these meds, but if they do not treat enough of your ADHD symptoms you can start slowly introducing one of the meds that did work such as concerta or vyvanse in a **very low dose.**  Intuniv helps counter the effect of the higher blood pressure and if you titrate slowly you may find a dosage of the meds you can tolerate when you use both meds together.\n\nThis is specifically approved to do so by the FDA (combining these two meds).  Intuniv is a great drug for it counters many side effects of the stimulants, besides treating ADHD by itself, or giving a more synergistic effect on ADHD treatment by using both meds together.\n\nThe only downside for these types of meds is they do not treat all the symptoms of ADHD just some.  Things like working memory, mental clarity, spatial reasoning, emotional control, reduction in impulsivity, reducing distraction.  These drugs **do not** help with motivation or creating the initial focus."
  },
  {
    "medication": "Kapvay",
    "comment": "For how long did you try wellbutrin/strattera, and what kind of doses?"
  },
  {
    "medication": "Kapvay",
    "comment": "There are clonidine and guanfacine, which are non-stimulant drugs that, aside from treating ADHD, are also used for treating high blood pressure."
  },
  {
    "medication": "Kapvay",
    "comment": "Yes, my main issues are forgetfulness and impulsvity. But even when I was on vyvanse or concerta, I was still extremely forgetful. It possibly made me more tunnel-visioned, if that makes any sense."
  },
  {
    "medication": "Kapvay",
    "comment": "I tapered up to 80 mg for strattera (took I think one month to get to that point). Then I stayed that way for another three months. My SO noted that in terms of treating my adhd symptoms, it wasn't very useful. I was still absent-minded and air headed, and I never stayed on task long. Strattera also gave me high bp/tachycardia.\n\nI was only on Wellbutrin at 150 mg once a day, though I was supposed to start taking a second 150 mg dose at noon after one week had passed. I couldn't tolerate the insomnia it gave me before one week could even go by, so I had to stop."
  },
  {
    "medication": "Kapvay",
    "comment": "Both of those have high bp as a side effect. Both can also cause tachychardia."
  },
  {
    "medication": "Kapvay",
    "comment": "Really? I might have to ask my psychiatrist about those and see what she thinks. Thanks!"
  },
  {
    "medication": "Kapvay",
    "comment": "4 months and up to 80mg strattera is definitely enough to conclude that it doesn't work for you (**anecdotal experience, not medical advice**).\n\nI don't have any experience with wellbutrin but just to\nMake sure:\n\n- did you drink coffee/large amounts of black tea/alcohol while on \nwellbutrin?\n\n- do you think it could be useful to start out with a smaller dose?\n\n- did you try taking melatonin before going to sleep?"
  },
  {
    "medication": "Kapvay",
    "comment": "Wellbutrin gave me tachycardia from 90 to over 100 sometimes. So even if the insomnia were resolved, I'd have cardiovascular effects to deal with :/"
  },
  {
    "medication": "Kapvay",
    "comment": "Alpha 2 Agonist ADHD meds treat anxiety as well as ADHD.  The two big ones used are Intuniv and Kapvay.  Kapvay will be more sedating than Intuniv.  Intuniv is usually prefered over Kapvay for it is less sedating but if you have a panic disorder that is that bad your doctor may consider Kapvay.\n\nStrattera also treats anxiety and ADHD.  Strattera takes several weeks to months for the anti anxiety effects to kick in.  It may get worse at first but then your body adapts and you have less anxiety.\n\nBoth of these are nonstimulant medications.\n\nThere are also some tricyclic and SNRI antidepressants that treat ADHD off label, that means they are meant for other conditions such as depression but as a side effect they also help some of the symptoms of ADHD.  These are also used sometimes in anxiety disorders.\n\nYou can also combine many panic disorder medications with ADHD medications.\n\nYou should be talking to your doctor and asking for help instead of thinking you can solve all the problems in your head.  I understand why this is happening, but you need someone to help you break this cycle."
  },
  {
    "medication": "Kapvay",
    "comment": "Not advice but I can relate.  Sorry for the TMI post.\n\n\nMy first home developed a water leak in the upstairs bathroom and it started leaking downstairs right next to where I was sitting.............and jerking off to porn. \n\n\nIt startled me to see water flowing from above. I was confused for a minute. But there were more important things to do, like ........ finish jerking off. Then even more important things: Like watching a movie. A few hours later I fell asleep on the couch and woke up to wet feet. \n\nMy plumber and tile guy hit a jack pot that day."
  },
  {
    "medication": "Kapvay",
    "comment": "I'm in the same boat man :("
  },
  {
    "medication": "Kapvay",
    "comment": "I did notice that strattera worked very well on my anxiety. Totally changed my perspective on life."
  },
  {
    "medication": "Kapvay",
    "comment": "Haha, yea it's just so insane how our brains don't even care for immediate concerns."
  },
  {
    "medication": "Kapvay",
    "comment": "Yeah! Like the time I actually melted my charger off my laptop because I wanted to finish watching a movie more than doing something about it overheating so bad!"
  },
  {
    "medication": "Kapvay",
    "comment": "Wellbutrin is an option. If that doesn't work you can try Abilify which is both a dopamine agonist and mood stabilizer"
  },
  {
    "medication": "Kapvay",
    "comment": "Hrm. I'm about to run out the door, but I'm going to come back here. I'm mixed bipolar so maybe Is can halp."
  },
  {
    "medication": "Kapvay",
    "comment": "I found a good overview of different options, with some numbers regarding treatment success, studies/sources, etc:\n\n\nhttp://www.mdedge.com/currentpsychiatry/article/59954/neurology/whats-best-treatment-comorbid-adhd/bipolar-mania\n\n\nThe review is from 2005, so I'm sure there's even better literature out there. But in short, I think you have several options.\n\n\nNow, I know that 20 mg of Vyvanse is considered a \"low\" dose, but when I started stimulants, I was taking even less. That much Vyvanse would have been way too intense for me in the beginning. I started off with Adderall, and was given 30 mg pills which were scored into quarters. I used to take half of one of those quarters (so not even 4 mg) and I'd be WIRED, all day. That's equivalent to about 10 mg Vyvanse. In the beginning, I was aware that even with tiny doses, I was getting a little manic, but I completely leveled out over time. It seems counter intuitive, but my meds actually help with my anxiety, OCD, and tune down my mood now. \n\n\nI've taken Wellbutrin in the past. Most of the time, I feel like it really helped. There were periods of time where I feel like, in hindsight, it had made me a bit hypomanic, but I think that was more the result of me losing my appetite (if I consistently forgot to eat, over time, the effects would get more intense, and I'd wind up getting too stimulated). \n\n\nBtw, guanfacine (a.k.a. tenex) could be a replacement for Kapvay. They're very similar, but Kapvay (clonidine) has a more profound effect on blood pressure (I have low BP to start with, and tenex rarely gives me trouble, plus the effect got much better over time). Also, have you tried any tricyclic antidepressants? \n\n\nAnyway, I'm rambling, but in short, I think there are plenty of other things you can try."
  }
]