[
  {
    "medication": "Jornay PM",
    "comment": "Me! I love it! I have high metabolism so every medication I've ever been on has worked for about a month and then just stopped working completely! I've been on Jornay for a year and a half and it still works. I have the exact same issue with Methylphenidate but Jornay is like a breath of fresh air.  I know exactly how you feel because I have had the same problems with meds as you. It is worth it. I haven't had any side effects at all. It is nothing like being on Methylphenidate. I take short acting methylphenidate as my back up if I run out of Jornay and I can honestly say I function better on no meds than I do on the Methylphenidate and I usually hate going off meds but if I can get out of having to take the methylphenidate even for a day I will go off meds because I cannot stand the way the Methylphenidate makes me feel. I loved the way you described the feeling because I could never find the word or words to describe it and you just described it perfectly."
  },
  {
    "medication": "Jornay PM",
    "comment": "Huh, funny, I'm literally trying for first time today, and found this post with a search. Might as well comment. I'm in the med peak right now and it is pretty peak. So, tweaked out feeling? Maybe, but the dose I was instructed to try was 100mg, based on my previous history at the ADHD specialty clinic where I receive care. I've already talked to them a couple hours ago as initial follow up and expect to hear from them again this afternoon. Given this feeling I wonder if this might be too high a dose for me and if I should maybe try 80mg. So that feeling may not be absolutely necessary. \n\n&#x200B;\n\nJornay PM is significantly different from other methylphenidate preps and really most anything else in general. What they've developed is a way to have a med absorbed by the \\*colon\\*. This absorption is different and slower than stomach/small intestine. This for me appears to allow it to avoid the gastrointestinal upset that I got with every other formulation of methylphenidate I tried (at least 3 different types.) This plus the possibility of better duration is what convinced me to try it when I thought I would never try another mph med. It might turn out to be pretty good for me. I've been taking a combination of Adderall and Vyvanse for a few years and have been thinking its effects are not really so great, probably does something but not enough to stop there and think that's all I can get.\n\n&#x200B;\n\nWould recommend trying it! Everyone's response is different, but what my ADHD clinic says they are seeing is that it's better tolerated (fewer side effects) than other forms for many people and is giving longer duration of effect than other extended release forms for many people. So far at least the better tolerated seems to hold true for me.  Make sure you grab a coupon from the med's web site. With it, the first fill will be free, and if you stay on it you get an ongoing discount for a year: $25 copay for those lucky enough to have Jornay covered by their insurance (which some plans do, at least with prior authorization which will take some extra work), $75 copay if your insurance plan doesn't cover it."
  },
  {
    "medication": "Jornay PM",
    "comment": "I’ve been on it for about 3 weeks, low dose, after 14 months of trying to find the right medication for me (ADHD). \n\nPros (for me):\n-I like it more than regular methylphenidate\n-I don’t feel over-driven or “pushed” on it\n-It’s working when I wake up\n-No irritability like I had with Ritalin (idk why)\n\nCons (for me):\n-Mild appetite suppression, but not bad\n-Mild dry mouth\n-It kicks in WAY too early for some reason...it’s waking me up 6hrs after I take it, every time. I usually sleep 7.5-8hrs. Sometimes I can fall back asleep (after like 30-45m) before waking up an hour later, or I just cannot fall back asleep and have to start me day early. This sucks because I look tired and feel very tired at the end of the day. (I take it as I’m going to bed and fall asleep within 15m, so I know I’m not taking it too early...my psychiatrist said it shouldn’t kick in until the 10-hour mark when she prescribed it.)\n\nI’m going to try taking melatonin at night and see if that helps me. Will update after a couple days of that."
  },
  {
    "medication": "Jornay PM",
    "comment": "I would take a high dose frequently of all ADHD meds. I could even sleep on them. Currently on vyvanse 20 mg 2x a day and in the afternoon I take  18mg after 12 noon. \nI am used to taking a a Low dose frequently. High doses tweak me out for 2-3 hours. High doses work longer but have really bad side effect. My question is what dose should I try with Jornay PM if I am used to high doses? My doctor always asks my opinion. We usually discuss things."
  },
  {
    "medication": "Jornay PM",
    "comment": "Does jornay feel like something you could get addicted to? I always felt like I was getting addicted to Ritalin and adder all but it’s that my metabolism is so flipping fast. I think that the psychiatry would is starting to understand this that people have a different tolerance and metabolism."
  },
  {
    "medication": "Jornay PM",
    "comment": "What time do you take it at?"
  },
  {
    "medication": "Jornay PM",
    "comment": "sorry to revive an old post! are you still on jornay? i’m starting it tomorrow and i’m a little nervous"
  },
  {
    "medication": "Jornay PM",
    "comment": "So for everyone that has tried this, if I need to get up around 6-7 am, should I take the Jornay around 6-7 pm? I'm hearing that it needs to be in your system for 12 hours before it starts to release. I know it's different for everyone, just trying to get a good idea of what time to start it. Seeing psychiatry on Monday, and will hopefully be starting it."
  },
  {
    "medication": "Jornay PM",
    "comment": "How are you doing on the Jornay PM so far. I am thinking of going on it. I have a super fast metabolism. All adhd meds work for about a month or 2. I really need some hope wth a new me"
  },
  {
    "medication": "Jornay PM",
    "comment": "What does it feel like when it wears off? Do you feel like you are crashing ? The short acting makes me crash once it wears off after about 2 hours. Is it smoother?"
  },
  {
    "medication": "Jornay PM",
    "comment": "How is your appetite with jornay? I need something to help me control my eating cause I just kinda lose control. With vyvanse i was doing really well, but it contributed to me developing TMJD cause I would squeeze my teeth so bad and it would give me migraines."
  },
  {
    "medication": "Jornay PM",
    "comment": "Starting on 100 is insane, the website recommends starting lower than slowly working up. I’m on 40 and upping to 60 next month"
  },
  {
    "medication": "Jornay PM",
    "comment": "Is jornay still working for you? Did you change doses?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Melatonin (3mg or 6mg) had no effect on being woken up early. Still getting woken up by it 5.5-6 hours after taking it. After 1.5 hours awake, I finally slept for another hour. Seeing my psychiatrist tomorrow, will update with what she says, maybe I’m wrong and it’s something else.."
  },
  {
    "medication": "Jornay PM",
    "comment": "Honestly start low. If its not enough ask for more. i would usually take 40mg or more of adderall at once and redose this about every 4 hours. but 20mg of jornay feels so far good, though 40mg i think would be the sweet spot for me."
  },
  {
    "medication": "Jornay PM",
    "comment": "That's a very hard question for me to answer for someone else. But personally for me it's less abusable/addictive."
  },
  {
    "medication": "Jornay PM",
    "comment": "Not anymore im back on adderall. When I started jornay it was great, finally able to n\nEffortlessly wake up and stay awake throughout the day, alot with assisting with my adhd symptoms. But unfortunately after a few weeks it stopped working or working as well? I'm unsure i tried upping my dose to 40mg, didn't feel any different. I had an extra pill one time so I took 80mg no different. I think this might just be me cause I've been on adderall for so long."
  },
  {
    "medication": "Jornay PM",
    "comment": "I would start with 9 to 12 hours before you want to get up, adjust as necessary."
  },
  {
    "medication": "Jornay PM",
    "comment": "I usually take it around 7PM and it wakes me up at 5-6 AM"
  },
  {
    "medication": "Jornay PM",
    "comment": "Trust me I had lost all hope until I was put on Jornay and it is my miracle drug. I hope this medication works for you too because I know how hopeless you feel."
  },
  {
    "medication": "Jornay PM",
    "comment": "I have been on it for about a year now and the fact that it still works is a miracle in itself. I am having an Anxiety flare up at the moment but having a job has helped significantly because I have zero anxiety when I'm at work but when I come home and relax it comes back full force which I have decided to do work around the house to keep me from having the time to be anxious and so I can maybe learn to be independent. I don't feel tweaked out ever and I'm actually excited to get shit done and do something with my life. I know what you're going through and it gets better. I know it probably doesn't seem like it right now but I promise you I felt just like you did for at least 17 and a half years of my life. I'm 19 and I'm just figuring out that I can't cook anything that doesn't come in a box or a can with instructions on how long to cook it and what temperature to cook it at. I seriously thought I could cook but I've been realizing that I actually can't. I think watching the food network too much as a child disillusioned me into thinking I could cook when I'm actually like the new reboot version of MacGyver, I can't cook but I can bake a mean pie. I also get myself into trouble trying to improvise makeshift tools that end up failing and making a huge mess before I figure out how to perfect it. Anyway, things will get better. I promise."
  },
  {
    "medication": "Jornay PM",
    "comment": "Can anyone’s that’s tried it pls reach out to me. I’m on 56 mg concerta, about to start 60mg jornay, can’t find a dose conversion online. My concerta 56mg is not helping one bit. Just want to know y’all’s experience."
  },
  {
    "medication": "Jornay PM",
    "comment": "Honestly I don’t even notice it’s worn off. No it does not feel like you’re crashing. The short acting made me crash after about 2 hours as well and the Jornay is definitely much smoother because it doesn’t just drop off after it’s worn off, and now I totally under stand why my ADHD doc always draws things like this out on paper to explain them."
  },
  {
    "medication": "Jornay PM",
    "comment": "It's not insane. My meds are managed by longtime ADHD specialists, and I've been on several different meds over 5 years with a number of different strengths. I actually tried higher doses of Jornay and have settled back at 100 for now mainly because I don't want to pay for two prescriptions! I think 120 was slightly better than 100. The others seemed too high. I can't remember if I tried 80 like I said I was going to, at least prob not more than once. \n\nThere's a significant number of people who get best effect from meds at notably higher than the maximum single dose that they are available in. The way those available amounts are arrived at are complicated and based more on regulation and healthcare industry with little connection to what is the maximum effective dose and zero connection to maximum safe dose."
  },
  {
    "medication": "Jornay PM",
    "comment": "It's still working for me. I settled back at 100mg dose for now because I don't want to pay for two fills each month if it's working enough at 100mg, but, I don't think this is the ideal dose, not sure. I think I had a little better effect at 120mg. With my care team we agreed that I'd just try to be consistent for a while at 100 and see what happens. I still think there is a significant positive just from waking up with the med already working."
  },
  {
    "medication": "Jornay PM",
    "comment": "Ask about adding bedtime clonidine. It works great to regulate my sleep and all my meds are at night!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Do you take any other add meds as a back up? And what time do you wake up if you take it at 8:30"
  },
  {
    "medication": "Jornay PM",
    "comment": "Mine quit working as well, after 3 weeks. At first it was almost too potent, now it's like a sugar pill, don't feel it at all and I'm back to my usual severe ADHD. I was surprised because I never got tolerance with Ritalin or Concerta."
  },
  {
    "medication": "Jornay PM",
    "comment": "If your doctor prescribed it for you and didn’t tell you what it was. Would you be able to tell it was a stimulant? Does it feel more like a very active antidepressant? You"
  },
  {
    "medication": "Jornay PM",
    "comment": "I am Bada\\_Bing2442 as well. I'm not sure why I get logged into one, one time and the next it logs me into the other. I'm the same person."
  },
  {
    "medication": "Jornay PM",
    "comment": "What dose again do you take?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Awe thanks. Do you know how they dose it? It’s expensive and I have a co pay card. Did you doctor write it for 30 days then increase it? If I have to keep trying different doses I am afraid it might affect the number of times I am allowed to use the copay card. I have a very fast metabolism also."
  },
  {
    "medication": "Jornay PM",
    "comment": "You take 320 mg of Jornay?"
  },
  {
    "medication": "Jornay PM",
    "comment": "How were you able to get two prescriptions approved? I’m in the US and on 80 mg of JOURNAY PM. I love being woken up at 6:30 am (I’ve always struggled in the mornings) but I just don’t feel like I am productive during the day. I’m going to ask to be bumped up to 100 mg but worry that it won’t be much different. I have a very fast metabolism, which could be my problem, but I really want this medication to work!!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Thanks! My psychiatrist ended up prescribing Remeron, an antidepressant also used as a sleep aid. I’m taking like the smallest dose (7.5mg) and I’ve been able to sleep pretty soundly and a full 8 hours!! So yay! But I am a little groggy in the morning."
  },
  {
    "medication": "Jornay PM",
    "comment": "Nope. And in the beginning I was waking about 8 to 9. But now I don't think its working. So I'm getting my dose upped next refill."
  },
  {
    "medication": "Jornay PM",
    "comment": "Same thing for me, I started on 60, after 2 &1/2 weeks it was doing nothing for me, except waking me up too early, went up to 80 and like clockwork 2 & 1/2 weeks later no more benefits."
  },
  {
    "medication": "Jornay PM",
    "comment": "Well yeah. I mean I’ve been medicated since I was 6. It’s right in the middle of what you asked about if that makes sense."
  },
  {
    "medication": "Jornay PM",
    "comment": "I do not. I do know that they write my prescriptions for 30 days worth and I have to call the pharmacy to get it refilled when I need them refilled and I have to see my ADHD doctor once a week to continue to get my meds. Your doctor would be able to tell you this better probably."
  },
  {
    "medication": "Jornay PM",
    "comment": "FWIW when I started I got multiple fills all pretty quickly, all at the copay card rate. They seem to be aware that people need to try different strengths. My insurance does not cover Jornay PM so the copay card rate for me is $75 per fill. It's also okay to take two or more smaller dose capsules to make a bigger dose. \n\nOn the other hand, unlike the other user I am pretty sure I've been noticing a wear off crash in the evening around 7pm or so, which would be roughly 23 hours or so after I take it. Peak effect is at roughly 14 hours. According to my ADHD specialist clinic they have found that higher doses can actually increase duration (as opposed to just increasing the stimulant effect over the same amount of time) but when I go up too much more than 100mg I get some side effects that have given me pause. 120mg was good but I'm staying at 100 to see if I get enough effect to not have to pay for two fills lol."
  },
  {
    "medication": "Jornay PM",
    "comment": "Well with Jornay specifically it’s a whole different thing, my insurance doesn’t cover that at all! But the manufacturer provides a copay card that will make the cost $75 if you are insured and the med is not covered. It’s possible to get multiple strengths at the same time using this. Basically if I want 120mg it’s fine but I would have to pay $150 per 30 days (2x $75) which, idk, I’ve spent more at times I guess but it’s just that it’s double the cost for a small increase in dose lol.\n\nIn general though, when it’s a covered med it can vary by insurance company. Mine covered multiple levels of Vyvanse for example as long as I paid a separate copay for each one. Say for example I was taking 90mg of Vyvanse, doctor would prescribe 50mg and 40mg (or whatever, as long as two different strengths) and with this insurance company I’ve had the last few years (which is the local to me Blue Cross affiliate, and before that Aetna worked too) there\n was nothing special to do, it would just be covered and I would pay two copays when picking it up.\n\nI am still messing around with dose timing and trying to set a better wake up time. I don’t feel like I’m waking up usefully until I’ve reached the peak effect at 14 hours or so. But a big part of this is still timing of going to sleep lol. In my follow up the other day with doctor we talked about how I’m sleeping through the earlier lower but still useful effect of the med, so the goal is to recapture some of that lol. We actually pushed back the dosing an hour and I’m trying to set a wake up time that’s a couple hours before peak effect, but the first couple days haven’t had luck with that."
  },
  {
    "medication": "Jornay PM",
    "comment": "Interesting. I guess it's not just us then. I'm about to ask for a dose increase but I'm not holding my breath."
  },
  {
    "medication": "Jornay PM",
    "comment": "Why do you go 1x per week?"
  },
  {
    "medication": "Jornay PM",
    "comment": "I have a high metabolism too and although journay does wake me up in the morning I’m not very productive throughout the day. How were you able to get insurance to pay for you to take a higher dosage than 100 mg? I have a coupon card. Will the company, ironshore pharmaceutical, approve me taking over 100 mg?"
  },
  {
    "medication": "Jornay PM",
    "comment": "I started at 80 mg and it’s not enough. My doc just prescribed 100 mg. Hopefully it lasts longer throughout the day. Right now I take it at 10pm and wake up around 7am. Before I could barely open my eyes and I have three kids! The only problem is that it doesn’t last long enough for me. Do you feel like you get the full amount of time from Jornay? Anyway, it looks like I will be paying $75 for the 100’s. Hopefully they work well!! (P.S My insurance is CareFirst and they deny a lot of meds in my experience)."
  },
  {
    "medication": "Jornay PM",
    "comment": "Because they specialize in ADHD specifically and my case worker is a speech and Language pathologist and I have this stuttery cluttery thing going on that she’s working with me on clearing it up and like I said if I don’t see my doctor I can’t get my meds."
  },
  {
    "medication": "Jornay PM",
    "comment": "I feel a wearoff at about 23 hours after dose, which, given that peak effect is supposed to be around 14 hours after dose, that’s not bad, definitely the longest duration of anything I’ve taken. I’m taking it at 9pm right now."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Wow really?!?! We were doing the $75 a month for my son, but his doctor just switched him to Concerta yesterday. Jornay PM just wasn’t cutting it anymore."
  },
  {
    "medication": "Jornay PM",
    "comment": "I just ran into the same issue- been at $75 for over 3 years and now they are saying $120 and the updated cards don’t even mention $75 as an option. Our prescriber is calling their rep to dig deeper but this is a $50 increase! Per month! Why??"
  },
  {
    "medication": "Jornay PM",
    "comment": "I put in a refill request last night and the pharmacy called to tell me it went from $75 to $119/month for my son. So it isn't just you unfortunately. His pediatrician has talked to us about switching, so I guess we may give that a try now."
  },
  {
    "medication": "Jornay PM",
    "comment": "I was just prescribed Jornay and, yes, this happened to me. I filled the first 20mg titration prescription at Walgreens and it was $116. We found the sweet spot for me (60mg) and switched  to Publix pharmacy for that Rx and it was $86."
  },
  {
    "medication": "Jornay PM",
    "comment": "This just happened to me too! I was trying to research and that led me to this Reddit. I left my prescription there to do some homework before paying more and I guess it seems like a change for everyone. Ugh how frustrating because it really works for me and I don’t want to switch to something else. I guess I’ll go pick it up and pay the $100 this time and speak with my doctor for next time. Thank you all for sharing your experiences!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Yes, this just happened to me. Walgreens quoted me $111. When I called the 1-800 number, they confirmed the price increase went into effect on July 1st. They recommended I fill out a payment assistance form at collegiumcoverage.com. Unfortunately, my insurance requires me to try a few generic options before they'll approve Jornay PM, this is so frustrating."
  },
  {
    "medication": "Jornay PM",
    "comment": "In case anybody is here like I am after a quick Google search, I had the same issue as everyone else with the cost jumping this month. (for me, it went from the advertised $25 to $67). Did God grant me extra hyperfocus **and** an afternoon off? You bet your ass, so naturally, I ended up spending over two hours on various phone calls, with Blue Cross Blue Shield, Prime Therapeutics, Trial Card (the coupon vendor company), and my local pharmacy, twice. And we ended up finding the result, which is that **the coupon terms and conditions quietly changed as of July 1st, 2025**. It is dependent on how much your insurance says the prescription is going to cost because the coupon policy used to be a policy of, \"we pay whatever the difference is to get it down to $25 or $75, depending on what plan you're on.\" But now it is simply a hard cap. They must've been losing too much money on it. Now, the manufacturer's coupon will only cover a maximum of $375, and the rest is up to the patient to foot the bill. My Blue Cross plan tells me the prescription costs $413 (and isn't covered at all by BCBS, so I'm expected to pay that if I didn't have a coupon). Ultimately means I am on the hook for the difference of $413 - $375 ($38) + the $25 copay, bringing a total of $67 and change. \n\n**Good news (hopefully)**: The Blue Cross rep did tell me, however, that it costs so much because it is not on their preferred formulary, so the coupon has been deducted against full cost every month. Better news: it can be *given* coverage with a Coverage Exemption form that your insurance company can fax to your provider to fill out and fax back for a review. Most companies have this process. Like a second, shittier prior auth. It just has to document why you need that specific medication to be covered. For me, I'd been taking Concerta for years, but I was starting to have some pretty wicked side effects of hypertension, insomnia, anger, depression, and this *really* terrible emotional/mood cliff at the end of the day when the meds would wear off at 5 p.m. I was just this moody asshole until about 7 p.m., and then I would come back to being myself. Luckily for me, I have documented that we tried Adderall, we tried switching to Mydayis, we tried supplementing with Strattera. Generics, name brands, bunch of mixes of different kinds. All of them had their various highs and lows (mainly lows). But as soon as I did a trial of Jornay, all the benefit, none of the side effects. And so documenting that will hopefully (fingers crossed) get it approved. Best of luck out there."
  },
  {
    "medication": "Jornay PM",
    "comment": "Did y'all have to keep providing for the pharmacy with a new card number every month by registering on the site? I think my pharmacy was trying to scam the company through me so I stopped getting it."
  },
  {
    "medication": "Jornay PM",
    "comment": "I have the answer!! Got off the phone with the group who operates the Savings Card and they “made changes to the plan in May” (she legit wouldn’t use the word discontinued) and now for a 30day Rx they cap the max ‘benefit’ at $350 so we now get to pay the difference which is why the $50 increase to us. Good thing i have all that RX insurance i pay for that has Journay specifically excluded or I would only have to pay $25. Gotta love big pharma lookin out for the little guy"
  },
  {
    "medication": "Jornay PM",
    "comment": "Yesterday the pharmacy tech said it was becuase the medication itself increased to 500 something (i forgot specifically what the number was) and I didnt say anything but I clearly remember it always being 500 something before the code because it showed it on my receipt. Other than that I have absolutely no clue why because in the year or two been on Jornay even with ADHD meds inscreasing in price the $75 cap stayed."
  },
  {
    "medication": "Jornay PM",
    "comment": "I'm in the exact same situation, Narrow."
  },
  {
    "medication": "Jornay PM",
    "comment": "damn yeah, im in the same situation. my “good” insurance doesnt cover hardly any adhd meds :1 thanks for looking into it though. at least i know im not alone in the ridiculous price increase."
  },
  {
    "medication": "Jornay PM",
    "comment": "Thanks so much for sharing this!! I am also skeptical of the \"as little as $25\", I am trying to appeal my prior authorization denial because I have tried all of the meds they require, but I am worried it still wouldn't be $25. The terms and conditions give literally no info online, really fucking scummy, especially when there is literally no other med available that does the PM thing this one does."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi! I am currently taking vyvance and switching off due to it always being out of stock at my pharmacy. My psych prescribed me Jornay PM and I just picked it up today!\nI am optimistic it will help! I see you posted this awhile ago, any updates?"
  },
  {
    "medication": "Jornay PM",
    "comment": "I know this post is kinda old, but I’ve seen some other people have a similar situation to mine and I wanted to see if anyone else has any experiences with it. \n\nWhen I first took Jornay PM it was amazing. I woke up on time for the first time in like 15 years, I had energy and focus at work all day, and I didn’t have a nasty crash in the evenings. I slept great too (but that’s never been a problem for me, as I’ve always tended to sleep too much rather than too little). \n\nHowever, about 2 weeks or so later, it seemed to completely lose its effect. If anything, it started to give me worse symptoms. I had a hard time focusing, I felt depressed, I had body aches and headaches, and I almost had an anxiety attack after increasing the dosage. Right now, I’m going to have to stop taking it until my shrink is back in the office (it’s the 4th tomorrow and she’s off on Fridays), but I think I’m gonna try something else. \n\nI’ve seen a ton of other people have success with it though, so I’d say it’s worth a shot. Just be sure to download the Jornay discount card. It’ll take it from like $500 down to $75 or even $25 if you have insurance."
  },
  {
    "medication": "Jornay PM",
    "comment": "I have just been given this med to trial (20mg). Haven't started yet, have you? Please update if you can."
  },
  {
    "medication": "Jornay PM",
    "comment": "No updates, my appointment with my psych is this morning. Let me know how the switch goes for you!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Thanks for the response! I ended up not branching out to trying jornay, as I was able to get good results from vyvanse xr plus a gen adderall booster in the afternoons. Sorry about your experience!"
  },
  {
    "medication": "Jornay PM",
    "comment": "The process of trying meds is so slow going. We just increased my vyvanse to 40 and added 10mg booster for the month. It works well enough that I’m honestly afraid to ask to try a completely different med because that means I’ll be stuck with it for a month before my pharmacy will allow me to fill my Vyvanse again if I needed to."
  },
  {
    "medication": "Jornay PM",
    "comment": "I was originally on vyvanse for around a year and always had a hard time remembering to take it or it would keep me up. I’ve been on 40mg of jornay for about a week now and I’d say it’s working pretty well, I’m focused and remember to do tasks. Only downside is I get cotton mouth a lot now. Not sure if it’s from the jornay or other things.\nEdit: I take it at 9:30 pm and usually wake up at 9:30am. Helps with getting me out of bed a little too. It usually lasts until around 5- late afternoon."
  },
  {
    "medication": "Jornay PM",
    "comment": "All good. Vyvanse was my first med but it gave me weird blurry short-range vision issues, so I had to switch to other stuff. Taking Focalin right now and it seems to be working pretty well."
  },
  {
    "medication": "Jornay PM",
    "comment": "Yes, actually. I’ve been on it for a couple months and it seems to be working pretty well! No issues afaik, other than it maybe wears off a little quicker than other meds, but it lasts me throughout the day at work and that’s really what I need the most."
  },
  {
    "medication": "Jornay PM",
    "comment": "I know this is an older post, but are you still on Jornay, and is it still working for you?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/s-to-the-am and thanks for posting on /r/ADHD!\n\nIf you haven't already, please take a minute to [read our rules](https://reddit.com/r/adhd/about/rules) - we will remove your post if it breaks one - and also check out our list of official megathreads [here](https://www.reddit.com/r/ADHD/comments/nu534w/official_list_of_radhd_megathreads_please_check/). If your post fits into one of them, it is likely to be removed; if you think this might happen you can delete your post here and resubmit it there instead.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I am still on it and it’s still working for me"
  },
  {
    "medication": "Jornay PM",
    "comment": "Thank you for sharing. \n\nIt seemed to work for me for the first week, but now that it’s been almost four weeks, I’m not so certain of it anymore."
  },
  {
    "medication": "Jornay PM",
    "comment": "Why do you think it’s not working for you?"
  },
  {
    "medication": "Jornay PM",
    "comment": "I used to be able to wake up in the morning (for about a week), and now I’m back to feeling like I was hit by a dump truck of mud. \n\nI’m only on 20mg, which for me is typical. I seem to have stayed at low doses as higher ones give me jitters and a racing heart. However it seems to wear off quickly. \n\nLots of peaks and valleys!"
  },
  {
    "medication": "Jornay PM",
    "comment": "I gotcha, I take 60MG, I definitely get up groggy still but it definitely helps me throughout the day. I had issues taking too much adderall in the past so taking Jornay only at night rather than at any point of the day is really important to me"
  },
  {
    "medication": "Jornay PM",
    "comment": "Again, I appreciate you sharing your experiences. There’s not much out there on Jornay PM that I could find. \n\nAlso, I’m living in the states so my health insurance doesn’t cover it because 1) no generic and 2) I’m an adult and this is “children’s medicine”. \n\nI ended up paying over $400USD for a 28-day supply. \n\nI’m half tempted to go back to my 5mg Focalin XR and just put that capsule inside an empty, enteric-coated capsule to delay the release and hope it works similarly to Jornay PM. \n\nI’m too poor to have health issues, but what’s a person to do?"
  },
  {
    "medication": "Jornay PM",
    "comment": "You should be able to get the same discount for up to a year"
  },
  {
    "medication": "Jornay PM",
    "comment": "My 6 year old was recently switched from 5 MG Foculin to Jornay PM by her behavior specialist. Our insurance did not cover it so her doctor provided the pharmacy with a coupon(that can be found on the Jornay website) that makes its $20 or so dollars. She's on 40 MG now after 1 month on the 20 MG. I know someone in this thread said it's not a kids medication but my daughters doctor actually led the 3rd phase of pediatric studies last year. \n\nI know many are quick to chastise parents who medicate their kids. Her dominating ADHD side effect is unfortunately memory retention and it began to severely affect her self esteem & confidence as her friends began reading while she couldnt recall letters & sounds she had known 2 days prior."
  },
  {
    "medication": "Jornay PM",
    "comment": "I would challenge the health insurance but it's definitely not a children's medication. Did you try using the coupon from the jornay website?"
  },
  {
    "medication": "Jornay PM",
    "comment": "The pharmacy tech applied the discount of $80. But it was only for my first purchase. The refill didn’t have a discount."
  },
  {
    "medication": "Jornay PM",
    "comment": "Using the coupon from the website? I had to bring my coupon each time to get the discount? I also had to call the the phone number on the coupon to confirm the details the 1st time I used it because the pharmacy was confused on how to use it."
  },
  {
    "medication": "Jornay PM",
    "comment": "Thanks for such a thorough review! I (34 F) just started taking Jornay PM last night and am hopeful already. I was diagnosed recently and had been trying Concerta, but kept forgetting to take it bc I had to wait 30 min after taking thyroid medicine in the morning, and would wait too long. I also noticed that I would start feeling nauseous when the medicine wore off and I haaaated that.\n\nI’ve also always struggled with my appetite too, so my provider strongly recommended taking this since it’s not supposed to cause low appetite. I am concerned about digestion as I have IBS (constipation), but I’m used to dealing with irregularities and have a plan for getting on top of that. \n\nToday I woke up and actually fairly quickly got started on Saturday chores, which never happens. I lost steam in the afternoon but for a big chunk of the day I was focused and driven. \n\nOverall, I’m optimistic and look forward to working on my habits to help compliment this medicine. Good luck to you!"
  },
  {
    "medication": "Jornay PM",
    "comment": "My doctor wants to put me on this. I am also on Vyvanse. This is so awesome to hear! I’m on 40mg Vyvanse and 10mg Adderall for an afternoon pick me up. I told her I don’t want to take 2 different medications, and she mentioned this. If you don’t mind answering, what mg are you on? This gives me so much hope that there’s something else out there rather than Vyvanse."
  },
  {
    "medication": "Jornay PM",
    "comment": "I am currently waiting for my first prescription of Jornay to be filled! I was diagnosed earlier this year and have tried Focalin, Vyvanse, Concerta, Focalin IR, and have had weird body side effects (dizziness, palpitations, vertigo, but have not felt wired). The meds totally helped my ADHD but I couldn’t put up with the side effects any longer and started to lose hope. (Side note— I haven’t tried adderall/Ritalin/Saterra because I took a GeneSight test and supposedly they do not interact well with my genetic makeup) I went back to my psych feeling totally defeated and she told me about Jornay and how many people experience less side effects because it is processed through the colon, rather than the liver like most other stims. Now I’m waiting for my pharmacy to get it in stock and I am hopeful it may work for me. Thanks for the review and sharing your story with Jornay! Hopefully it will work out for me too."
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/CIsForCorn and thanks for posting on /r/ADHD!\n\nIf you haven't already, please take a minute to [read our rules](https://reddit.com/r/adhd/about/rules) - we will remove your post if it breaks one - and also check out our list of official megathreads [here](https://www.reddit.com/r/ADHD/comments/nu534w/official_list_of_radhd_megathreads_please_check/). If your post fits into one of them, it is likely to be removed; if you think this might happen you can delete your post here and resubmit it there instead.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I am so thrilled to read this - thank you for being so comprehensive! You seem extremely similar to me and the sleep and appetite challenges have gotten so bad lately I’m skipping my meds. \n\nIs it something you can take “as needed”? As in, you can take it weekdays and skip weekends for example or does it need to be a daily? Asking for the alcohol impact but also I don’t like taking things daily if I can avoid it"
  },
  {
    "medication": "Jornay PM",
    "comment": "Considering mentioning this to my psychiatrist. We’ve been trying to find something else that will be effective after a 6 year Adderall success. \nI just had a trial with Concerta and was so disappointed, due to becoming a zombie on it! Thanks for your review!"
  },
  {
    "medication": "Jornay PM",
    "comment": "I was on Vyvanse and switched to Focalin XR because my resting heart rate went through the roof. \n\nFocalin seems to be inconsistent so I just got prescribed a 1-week trial of Jornay PM ($108.45 because insurance doesn’t approve “new to the market” medications”). \n\nYour experiences with Vyvanse sound quite similar to mine. Which is why I’ve been on Focalin XR for almost a year. \n\nI’m hoping Jornay works for me, but I’m also worried about the costs! Seven pills for $108.45?!?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Started taking 60mg and I feel nauseous daily, wondering if you experienced this? For the digestive issues did it just go away on its own after a few days? I don't want to stop taking it too soon before it works itself out but feeling nauseous every day is not a good feeling. I didn't feel this on 20 or 40mg."
  },
  {
    "medication": "Jornay PM",
    "comment": "So if I took it around 8pm. Do you think it would last till 5pm the next day????"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hello! I also have hypothyroidism and IBS and am wondering how Jornay PM has done for you being on it longer? Thanks!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Thank you so much for taking the time to do this review!!!  It helps when our medications are working at are best! Right! Ha!  This was very helpful and I resinated so much with each thing you covered!  I am considering a switch:).  I am so glad you shared!  Hope things are still going great for you!!!  Hugs!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hello, I was wondering if you have an update on Jornay? Is it still working well for you?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hello! I also have hypothyroidism and IBS and am wondering how Jornay PM has done for you being on it longer? Thanks!"
  },
  {
    "medication": "Jornay PM",
    "comment": "My doctor refused to give me a 2nd stimulant. Vyvanse only had an 8 hour effective range and I need am extra 4 hours to get me through till bed time."
  },
  {
    "medication": "Jornay PM",
    "comment": "If you look it up there is a prescription coupon for 30 day supply.  $0 for the first fill and then $25 for each after that. The coupon can be used 13 times I think it said."
  },
  {
    "medication": "Jornay PM",
    "comment": "You should call your insurance and explain you’ve been on several approved medications with no luck. Just got off the phone with then"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "You are unlikely to be sick from it, but its possible that you may experience overstimulation and anxiety. It is possible that it may impact future doses of the same med for a couple days as well. If you are able to skip a day or 2 of the medication it will help reduce the impact on future dosages but that's not a guarantee. Over medication increases tolerance but I doubt a 1 time accident will do it. Continued over use of the medication would guarantee it though."
  },
  {
    "medication": "Jornay PM",
    "comment": "A heart/blood pressure monitor is handy in times like this.\n\nYou should ideally be checking it every couple of hours and if it gets high or too low check into emergency care.\n\nElse, drink some orange juice to try to counteract it. Stay hydrated, make sure you eat and don't panic.\n\nEdit: I didn't know what Jornay is, it takes 10-12 hours to kick in. My advice isn't helpful."
  },
  {
    "medication": "Jornay PM",
    "comment": "I have done this before (was taking two half strength tablets during the Vyvanse shortage and forgot to only take one when I got my normal dose again). \n\nI felt anxious, racing heart beat and ended up leaving work a few hours early. You should be okay, but obviously if you feel worried/things deteriorate you should call a doctor or emergency services (not saying it’s likely, just make sure you know the option is available to you)"
  },
  {
    "medication": "Jornay PM",
    "comment": "My doc told me once: if you DOUBT if you already do took your med, don’t take it.\n\n drive with double dose of Ritalin is not the most pleasant experience at all."
  },
  {
    "medication": "Jornay PM",
    "comment": "take extra care of yourself and set yourself up in ways that you can such as wearing the comfiest clothes possible, drinking plenty of water, eating well and trying to get lots of protein in… like others have said you will probably be fine so expecting the anxiety / heart rate increases should help you get through the day so try to breathe and do what is in your control to lower your stress as much as possible"
  },
  {
    "medication": "Jornay PM",
    "comment": "you guys, I survived!! thanks for talking me off the ledge..."
  },
  {
    "medication": "Jornay PM",
    "comment": "You’ll probably feel really good, just drink some water and vibe."
  },
  {
    "medication": "Jornay PM",
    "comment": "You should be completely fine. You may experience negitive symptoms. But back when I was suffering with adiction, I took a jornay/ritalin adjacent tablet and its dosage could range up to 400mg. Whilst everyone's biology and experience is different, this was standard practice for myself and my friends, and we were okay.\n\nYou can expect to see an increased heart rate, heightened senses, and intense feeling of anxiety for the first few hours. Whenever my dosage of prescribed medication was upped, id get bad anxiety while i was adjusting. To counteract this, I ate a bigger meal the morning of to offset some of that feeling and it worked.\n\nA lot of these medications are designed with the understanding that people may accidentally take more than prescribed, so they're made in a way that it wont cause death or serious harm if the limit is exceeded. Like another commenter said, if you feel any adverse effects, call 911\\999 and go to hospital. But try not to freak yourself out. Most likely, you'll feel a little wobbly and will seem to have superhamn speed and productivity. You also may be excessively chatty. Tell a loved one to keep an eye on you but dont worry yourself."
  },
  {
    "medication": "Jornay PM",
    "comment": "10-12 hours???? Good god that would be my worst night mare. I can just about manage to remember my medication 30 minutes before i NEED it nevermind half a day."
  },
  {
    "medication": "Jornay PM",
    "comment": "~~It is, you just have to drink the orange juice in the morning~~\n\n(Edit) nevermind, forgot this is methylphenidate not amphetamine, so not affected by urinary pH (and apparently takes something like 1.5 litres of orange juice to drop urine pH by 1); and methylphenidate seems to be less bioavailable with higher pH, not lower; and Jornay’s beads seem less affected by pH in general.\n\nEven if it worked, I don’t know what you’d eat to raise your gut pH anyway, and you’d have to hope it’s in the gut at the same time as the beads."
  },
  {
    "medication": "Jornay PM",
    "comment": "Can you describe what you felt though? It’s 10:00am for me and I’m still waiting and wondering if I accidentally did the same thing last night!!"
  },
  {
    "medication": "Jornay PM",
    "comment": "You take it before bedtime and it kicks in aa you're waking up"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I found this because I am doing research on Jornay. I'd never heard of it until today. \n\nI am currently on Vyvanse and my daughter (10yo) on Concerta. For both of us, I saw huge variations in effectiveness when the generics were introduced into the market. Maybe this is possible for you but just a thought."
  },
  {
    "medication": "Jornay PM",
    "comment": "No generics yet for Jornay. We increased and he was fine. However, I was told by his doctor that she won’t prescribe concerta because the generics suck."
  },
  {
    "medication": "Jornay PM",
    "comment": "Gotcha. Yes, the generics for Concerta suck. We bumped up to 54mg because the generics are affordable but I fully believe we could go back down to 36mg if we could afford the brand name."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I also recently tried to fill my prescription for Jornay PM at my pharmacy in BC but they said neither of their suppliers carry it. So I contacted Knight Pharma who owns the exclusive rights to distributing it to Canadians, but they said while it’s been approved they haven’t marketed it yet and don’t have a date, but they offered to add me to a call list for when they do. \n\nSo all the Health Canada approvals are done and it’s ready to market but Knight just hasn’t yet. And since they have exclusive rights to it no one else can. Seems dumb. \n\nAny one have any success getting it filled out-of-country? Online pharmacy?"
  },
  {
    "medication": "Jornay PM",
    "comment": "I talked to my doctor about it in the summer and we've been waiting for it to get approved. Now that I just found out that it's been approved, I called my pharmacy about it but they're not seeing it in their distribution centre yet, so it may take a while before it's available. I might check some other pharmacies"
  },
  {
    "medication": "Jornay PM",
    "comment": "Did you get any updates? I’m also in BC trying to get hold of it."
  },
  {
    "medication": "Jornay PM",
    "comment": "I'm not surprised.  My pharmacy are lazy and rarely even get my prescriptions filled properly, so I can see why they would take their time getting a relatively newly approved drug in their inventory.  Good luck and please let me know when you finally are able to get it dispensed."
  },
  {
    "medication": "Jornay PM",
    "comment": "Nope :( I even called the closest US pharmacy but they didn’t carry it either. There are some online sites but they require a script from a doctor in the US to fill and only ship to US addresses. Lots of online Canadian pharmacies available that ship to the US but not the other way around."
  },
  {
    "medication": "Jornay PM",
    "comment": "FFFFF, I just noticed this quote in the news release: “I am proud to announce the approval of JORNAY PM™ in Canada. This exciting new launch, ***expected in the second half of 2025***, represents a significant advancement for our Canadian business...\" Looks like we still have a long wait ahead of us. The two pharmacies I've called weren't able to find any info on it."
  },
  {
    "medication": "Jornay PM",
    "comment": "Have you heard of anything yet??"
  },
  {
    "medication": "Jornay PM",
    "comment": "Which is SUPER misleading as earlier in the same news article they state “first and only evening-dosed methylphenidate product 𝙘𝙤𝙢𝙢𝙚𝙧𝙘𝙞𝙖𝙡𝙡𝙮 𝙖𝙫𝙖𝙞𝙡𝙖𝙗𝙡𝙚 in Canada”\n\nSo it’s not the pharmacy’s fault. From my understanding, the pharmacy orders it from a supplier, and the supplier orders it from the manufacturer. But the manufacturer hasn’t made it available (aka marketed) for the suppliers to purchase.\n\nI don’t know why, as patents/distributing rights are only good for so long so you’d think once the lengthly Health Canada approvals go through you’d be wanting to distribute ASAP to maximize profits. Although… I’m not 100% sure if Knight Pharma is manufacturing it as they only have distributing rights so maybe the hold up is from the actual manufacturer, who presumably still holds the patent and rights to the new drug, Collegium Pharma."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Try a higher dose. I've recently been introduced to jornay pm and those on 20mg have experienced similar things to what your son is going through. It may be useful to more than double to dose to 40 or even 60mg.\n\nHope this helped."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I am pretty sure you can get it covered after you've tried and failed with other meds! I started jornay pm a month ago after years of adderall and concerta giving me a host of unfavorable side effects and since I tried others unsuccessfully my insurance \"covered\" it and the manufacturer coupon knocks it down to $25."
  },
  {
    "medication": "Jornay PM",
    "comment": "I haven't tried Concerta, but have been trying different doses of Jornay. Jornay has a manufacturer's coupon that's supposed to bring your prescription to only $25 in case you hadn't seen that yet!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Yeah I currently have Anthem BlueCross Blueshield and it’s covered for both medications, for me Concerta was decent, did the job but Jornay PM on the other hand is much better since I don’t have to deal with morning sleepiness and has a better duration compared to Concerta, of course everyone is different so others might have the opposite experience etc etc"
  },
  {
    "medication": "Jornay PM",
    "comment": "Unfortunately my insurance doesn't cover it, so the only coupon that will work for me takes it down to $75/refill"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I took Jornay when I was living in the US and I can't wait for it to be available here.   \nI currently take Concerta (36mg) and I found that both the 40mg and 60mg doses of Jornay worked as an equivalent dose. \n\nI found the onset time was about 9 hours for me, so I took it about 60-90 minutes before I went to bed. The onset time may vary by individual (between \\~8 and \\~12h after taking the medication), but it's very consistent. \n\nI noticed fewer side effects than I have with concerta, and the release felt smooth throughout the day. Waking up \\*alert\\* in the morning was a wonderful feeling. I also found that it indirectly improved the consistency of getting to bed — once I took the medication I knew I needed to get to sleep within an hour or so since the meds would start working in the morning no matter what!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I’d like to hear as well. I’ll be switching to Jornay in 2 weeks. If it works like it’s supposed to we’ll wake up raring to go take on the world… or so I hope!"
  },
  {
    "medication": "Jornay PM",
    "comment": "I had my first dose last night. I’d say I slept like 2 hours max and I’ve been awake since. I got a head ache but never really felt much different besides the lack of sleep."
  },
  {
    "medication": "Jornay PM",
    "comment": "Do you think you slept only 2 hours because of Jornay?"
  },
  {
    "medication": "Jornay PM",
    "comment": "I’d say so. My first 3 weeks of wellbutrin I was struggling to fall asleep but after the one month mark i started falling asleep at a normal time and waking up refreshed. Then after my first jornay last night my sleep is non existent. Even now in the evening I can tell my mental state is tired but I can’t sleep fall asleep."
  },
  {
    "medication": "Jornay PM",
    "comment": "So it didn’t wait 9 hours to kick in? Could it have dissolved quicker than it was supposed to?"
  },
  {
    "medication": "Jornay PM",
    "comment": "It’s possible, or maybe I didn’t sleep well because I was nervous about taking it since I read about so many possible side effects. All I know is it’s been 24 hours since I took it and I haven’t slept lol"
  },
  {
    "medication": "Jornay PM",
    "comment": "Ugh, I know that zombie feeling all too well. Please let me know how it progresses & when I get on it I’ll pass along my experience so we can compare notes."
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/Finnster123456 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Did you ever figure this out? I’m curious too"
  },
  {
    "medication": "Jornay PM",
    "comment": "Pharmacist said do the opposite so in the morning."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I have experience with this. Sorry this is a long response!\n\nBefore I go into my experience I’d like to point out that 40% alcohol is the alcohol content of most spirits straight. You’d be dead if your blood alcohol content was 40%, you’d likely be dead if it was .4%. So the numbers they provided are not super helpful. Unless I’m missing something, or one were to soak their meds in straight liquor before taking them, the 97% release thing is pretty irrelevant. \n\nI take 100mg Jornay PM at 10 pm every night (with intended wake up time of 7-8 am). I didn’t realize I would have to stop drinking when I was prescribed Jornay, my doctor didn’t mention it, but I did my own research and learned (after MUCH digging and actually emailing the manufacturer) the same information you learned (97% of medication released in 40% alcohol). I don’t drink a lot but I didn’t have any plans of cutting alcohol out of my life, so I was bummed when I thought I couldn’t drink anymore. I stuck to not drinking for the first month, then on my follow up appointment I asked my doctor about the alcohol warning. She said that the effect is different for each person, so if I want to continue drinking to try it cautiously and see if it had an effect. Tbh, she admitted she wasn’t well versed in Jornay. According to my own research, methylphenidate has some sort of reaction with alcohol that possibly causes alcohol to have a stronger effect (I can’t remember the specifics I’m afraid but worth looking into if taking a methylphenidate based medication like Jornay).\n\nArmed with all this pretty confusing and not very comforting information, I decided to cautiously try drinking. I started off with a beer one evening, noticed nothing different. Upped it to a couple beers another evening, noticed nothing. Went to brunch one day and had 2 cocktails, got extremely tired for the rest of the day (not entirely strange effect after day drinking). The data would get tedious, but my take away (from my experience with my own body, it may not apply to others) is this:\n\n-For me, drinking a normal amount of alcohol does not affect the release time of the medication (normal amount for me when I decide to drink is between 1-4 drinks)\n\n-I have never been woken up before I want to after drinking while taking Jornay\n\n-Drinking makes the medication LESS EFFECTIVE the following day. I don’t know why, probably because alcohol has many negative effects on our bodies, but I suppose it’s possible it was released in my sleep and I slept through it (that seems highly unlikely). I feel less effective/functional when I drink on Jornay than if I drink the same amount unmedicated. It definitely makes the hangover/after effects of alcohol worse.\n\n-drinking 1-3 low alcohol beers or 1 drink doesn’t seem to effect the medication at all for me. Any amount of drinking where I feel tipsy is where I might have a crappy day the next day. \n\nHas this affected my drinking habits? Yes! Have I stopped drinking? No! I don’t drink enough/often enough for this to be a major concern for me. it’s definitely a drawback, but not a deal breaker. I used to take Adderall, and if I drank alcohol in the evening I could take my medicine in the morning and forget about any hangover I might have had. While that’s kinda nice and there are probably a few days a year I might miss that perk, I’m ok with cutting back on drinking for overall better health anyways, interactions aside.\n\nThere NEEDS to be much clearer information out there for people who take Jornay. If I had not been diligent, I wouldn’t have realized alcohol had any interaction at all. And if I hadn’t understood blood alcohol levels I would have been very alarmed by the companies information about it. \n\nHope this was helpful."
  },
  {
    "medication": "Jornay PM",
    "comment": "It’s an in vitro study.  97% was released in two hours when it was put directly into a solution of 40% alcohol, not when someone takes it (in vivo)."
  },
  {
    "medication": "Jornay PM",
    "comment": "What I am gathering from comments here is:  \n\nDo - have a beer or two if you like.  \n\nDon’t - wash your Jornay capsule down with a round of shots on an empty stomach (unless you want to, potentially, be up all night and dead asleep all day the next day)."
  },
  {
    "medication": "Jornay PM",
    "comment": "I am starting Jornay this week and drink usually once-twice a week, I was wondering all of this also- thank you!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Has Jornay continued working well for you? I’ll be trying it in about 2 weeks. I’m hoping it’ll help get my butt out of bed & be productive."
  },
  {
    "medication": "Jornay PM",
    "comment": "thank you. that’s illuminating and makes what I read in prescriber info as perhaps misleading. do you have a source for reference?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hope it works well for you, glad my experience was helpful!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Has Jornay worked well for you? I’ll be trying it in about 2 weeks. I’m hoping it’ll help get my butt out of bed & be productive."
  },
  {
    "medication": "Jornay PM",
    "comment": "I honestly am just going off the prescriber info, where it makes that distinction (in a pretty unclear way!)"
  },
  {
    "medication": "Jornay PM",
    "comment": "Sorry, I know this is crazy long but I want to explain in case it ever comes up for you. Jornay did not have any affect on me, however it’s worth noting that I finally agreed to my psych’s recommendation of the gensight testing; I am so glad I did. For me it was totally worth the hefty copay ($300). I learned that I have four different genetic mutations/variants, which are also cause for my PCOS, low serotonin availability, chronic fatigue, and a multitude of others. The test outlines which psychotropics can be best metabolized based on these finding and which ones simply will not work, or could work with supplementation. One being the MTHFR mutation (I will never not say that as “the motherfucker gene thing” 😂) and this particular issue causes inability to convert folic acid into usable methylfolate, which causes a domino effect of other crucial B vitamins and the processing of certain meds. That being said, I’ve since started a supplement for it and now Vyvanse is working for me again. (It worked off and on for a while, then stopped completely. We tried three or four others before I agreed to the testing.) I don’t have a need to try the failed meds right now, but I am curious if they all would work better like the Vyvanse did!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Thank you! I didn’t know such a test existed. I’m meeting with my Dr Monday. I’ll ask him about that test."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/fireplacenow and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "How’s it been? I’m bout to try myself."
  },
  {
    "medication": "Jornay PM",
    "comment": "Had to start on the lowest dose which is always annoying but nothing negative. Just not much difference. I’m hopeful."
  },
  {
    "medication": "Jornay PM",
    "comment": "20mg? I’m about to start on 40mg. Hoping for the best"
  },
  {
    "medication": "Jornay PM",
    "comment": "Yeah I’m on 20 even though I’ve tried all doses of like 10 meds over the years. My doctor is by the book. Good luck!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Has Jornay continued working well for you? I’ll be trying it in about 2 weeks. I’m hoping it’ll help get my butt out of bed & be productive."
  },
  {
    "medication": "Jornay PM",
    "comment": "Yes! So it’s not a perfect answer in terms of focus during the day, I still struggle with that and exec dysfunction, but the ability to get up in the morning has been absolutely life changing for me. I have never ever experienced it in my life, I actually wake up and can function. I’m on 80 mg now and I’ll probably try 100 just to see if it happens to help with the focus."
  },
  {
    "medication": "Jornay PM",
    "comment": "That sounds wonderful. Same with me… a whole life of struggling to get up. Even though I’m 63, I’d like to live whole days rather than 1/2 days with what I’ve got left. Plus get something done while I’m awake!\nThanks!"
  },
  {
    "medication": "Jornay PM",
    "comment": "So glad we both found this! Out of curiosity, what dose are you on?"
  },
  {
    "medication": "Jornay PM",
    "comment": "I won’t know until tomorrow when I meet with my psychiatrist. Probably 20mg."
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/katekim717 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I've been taking Azstarys for a year, but I was on Adderall before.  I'm also more than 40 years older than your kid, so I might not have any useful advice."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I just started on Jornay a few weeks ago. My memory has been terrible for a while so not related to the medication. I’m trying to get in the habit of writing everything down. I try to write things as they happen so there is less chance to forget. I’m would really like to get one of those devices that listens and transcribes all your conversations but I feel like that would be a huge invasion of privacy for everyone else."
  },
  {
    "medication": "Jornay PM",
    "comment": "Did your memory wind up improving on Jornay? How has it worked for you overall?\n\nI’ll be giving it a try in 2 weeks and am hoping that some early morning get-up-&-go will jump start my days so I can be productive."
  },
  {
    "medication": "Jornay PM",
    "comment": "Has Jornay been working well for you?\n\nI’ll be giving it a try in 2 weeks and am hoping that some early morning get-up-&-go will jump start my days so I can be productive."
  },
  {
    "medication": "Jornay PM",
    "comment": "I think it improved, but it never actually worked for me so I switched off of it. All the Jornay/Vyvanse drugs didn't work for me."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "The last time I checked, it's not available here.   \nIt's maddening, because the company which invented the delayed-release technology (owned by Jornay's manufacturer) is based in Canada, and the tech was invented here.   \n\n\nI recommend contacting the manufacturer ([Ironshore Pharmaceuticals](https://ironshorepharma.com/)) and asking them to bring it to market here. I emailed about a year ago and was told they had plans in the works but I don't think anything has happened yet. \n\nWhen I was living in the US I was able to take this for about a year and it was absolutely the best medication for me. It's very frustrating not to be able to have access to it here."
  },
  {
    "medication": "Jornay PM",
    "comment": "It's not available in Canada, but they have submitted it for review.  Hopefully it's here eventually."
  },
  {
    "medication": "Jornay PM",
    "comment": "Update: there may be hope, if we're patient!  \nI just checked Health Canada's new-drug-review database, and it appears that the manufacturer submitted the drug for review in January 2024. It might take up to a year for approval/bringing to market, but at least the process has started."
  },
  {
    "medication": "Jornay PM",
    "comment": "Has there been any updates on this since this post? \n\nThis medication would be life changing"
  },
  {
    "medication": "Jornay PM",
    "comment": "I have also been waiting years for this in Canada and frustrated that it was invented in Toronto, yet not brought to market here. Any time I contacted the manufacturer I got little response, just that they were in discussions with Health Canada. Now I am hopeful that we will see this in 2025! It is not even a new drug, just a new delivery system for a well-established drug, so surely Canada won't drag their feet on this..."
  },
  {
    "medication": "Jornay PM",
    "comment": "Thanks for answering!  It's funny; my gp and his nurse believed it was available here, but my pharmacy prescribed out pms-methylphenidate cr instead.\n\nI was trying to search for it in the Health Canada database yesterday, but I didn't check the new drug review section.  I will definitely send Ironshore Pharma an email requesting they bring it to market here.\n\nThe healthcare/pharma system in Canada is a mess."
  },
  {
    "medication": "Jornay PM",
    "comment": "Can you give me the link to that Health Canada new-drug-review database?  Cheers"
  },
  {
    "medication": "Jornay PM",
    "comment": "Sure — [Health Canada Drug and Health Product Review](https://www.canada.ca/en/health-canada/services/drug-health-product-review-approval.html) — look at drug submissions under review."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Everyone's body reacts a little different to each medication option, so first off I say each chance to try a new solution is worth being excited about seeing how YOU feel with it over the next few weeks. You got this! \n\n---\n\nThat disclaimer out of the way, I was prescribed Jornay for a month, but unfortunately didn't end up using more than the first three doses. Day one and two were fine, no side effects present and no real benefits showing yet, but tbh I'd been told to not worry I'd I felt nothing because we'd started on the lower end of doses and might just need a higher dose to see effects.\n\nHowever, the night I took the 3rd dose, I woke up in the middle of the night due to nausea and was up for an hour due to puking periodically. I know several friends whose bodies take nausea and make it a \"one and done\" session, but unfortunately my body has a habit of \"if I'm gonna puke, it's gonna stick around a while\" instead. \n\nTold my doc and they agreed that was too much for me to continue on comfortably even though it was unlikely to be a permanent side effect if I wanted to continue trying the Jornay. Nausea is a known common side effect while the body adjusts to the new substance (particularly due to the oddity of it releasing in the intestines rather than the stomach, which is how it's able to be taken at night and kick in the morning. Really neat!!) So all in all, your milage may vary. I think it had a chance with me if I didn't have such a hard time with nausea in particular, and I hope you the best trying it yourself!"
  },
  {
    "medication": "Jornay PM",
    "comment": "How has Jornay been working for you? I’ll be trying it in about 2 weeks. I’m hoping it’ll help get my butt out of bed & be productive."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I haven’t taken either medications, but am considering Jornay. Did it wind up working for you?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Haven’t tried it yet. Can’t switch up yet, been recovering from some surgery. You?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Will take first dose tonight, will uodate"
  },
  {
    "medication": "Jornay PM",
    "comment": "👍🏻 thanks. Hope it works well!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi there, I'm on Jornay 80 and have been on Vyvanse and Concerta. \n\nI'm no doctor, so don't take this as medical advice. However, from some of the doctors I've watched on YouTube talking about stimulants and their effects, your dose might actually be too high. \n\nWith Vyvanse especially, it apparently will kick in and out, end early, and even suddenly show up again later in the day if it's too high instead of being smooth and consistent. It's slightly worse with Melthylphindate. \n\nVyvanse is great, but I had to stop taking it for similar reasons because it exacerbated my anxiety. It might make sense for you to try a lower dose of Jornay, like 40 or 60, and give yourself 2-4 weeks to really see how it makes you feel. You could even consider taking a day or two off (not fun I know) to make sure the medication *is* having an effect. Advice from Russel Barkley, not me on that last one. \n\nHope this is helpful."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "My doctor just prescribed it to me yesterday, and i took my first dose last night. I slept just fine, and i’m feeling good today! reply back here in a few days/a week and i’ll let you know my experience if you like"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I'd love for people to follow up on this discussion after six months.   \n\n\nI just had an appointment with my doc and we talked about trying Jornay. I had been taking Concerta (for at least 15 years) and suddenly wasn't able to get it (like everyone else). I tried for two months but was unsuccessful getting it again. However, I noticed something strange -- I didn't notice much of a difference in my ability to concentrate. In fact, it was quite noticeable that I was concentrating fine without it. So, we (me and my doctor) decided to see what life was like without any Ritalin.   \n\n\nLong story short, it was actually the Bupropion I had been taking for depression that was keeping me concentrating. We decided to try to wean myself off of antidepressants and started with Bupropion. Almost immediately I noticed that my concentration turned to shit, plus all the other typical symptoms were showing up.   \n\n\nWell, last month I decided I wanted to go back on Concerta but was only able to get a generic which seemed to have zero effect on me. It's been a month now on the generic and still no change.  \n\n\nThis is getting long, but we decided to give Jornay a try. So, I was wondering about peoples experiences that have been taking it for a while. \n\n* What side effects did you notice and how bad were they?\n* What time(s) did you take it?\n* Did it interfere with your sleep at all?\n* Was it obviously effective in the morning?\n* Did you have any issues with metabolizing it as promised?  \n\n\nObligatory, \"everyone is different\" blah blah. I just want to hear what your experiences have been."
  },
  {
    "medication": "Jornay PM",
    "comment": "This drug is a miracle. Cured my insomnia (except for tonight … because I ran out of my Jornay and it’s on back order ![img](emote|t5_2qnwb|35088))"
  },
  {
    "medication": "Jornay PM",
    "comment": "How long have you been on it? I’m researching vyvanse and jornay to decide which medication to try."
  },
  {
    "medication": "Jornay PM",
    "comment": "so far i am still really liking it! i recommend playing around with when you take it at night, because i’ve definitely noticed it is helping me wake up in the morning, 100%. it hits me approximately 9-10 hours after I take it, so i time it to hit right when i’m due to wake up. i’m a total night owl and usually am groggy for the first couple of hours at work, but Jornay is really helping! i don’t hate life at 7 am as much anymore! \n\nit also hasn’t really been affecting my appetite, so i don’t get that crash in the afternoon like i did when i took concerta, asteryx, or adderall. my working memory seems to be better, and i’m recalling names with ease (I work in an elementary school with a few hundred students, and name recall has always been a huge struggle for me). \n\nalso, anecdotal, but my best friend and i live too far to visit often, so we talk on the phone for a few hours at a time a couple time a week. since taking this, i’ve noticed my attention during these long calls is less likely to wander, and i’m better at recalling the small details that she tells me, which makes me feel like a better friend. \n\nlastly, i’m noticing i’m not having so much difficulty when i need to stop the dopamine-heavy fun thing i might be doing at a present moment in order to do some sort of chore or something i may have dreaded doing pre-meditacation. obviously this has limits, but in general, i’m less frustrated with having to do un-fun necessary things. \n\ni would definitely recommend Jornay if mornings are hard for you! i find it so easy to let the adhd win when i want to lie in bed. i’ve missed several days of work purely bc i don’t want to wake up in the morning, but i can see that this will help that."
  },
  {
    "medication": "Jornay PM",
    "comment": "Yes! All of this is so true! I would have trouble getting up in the mornings and starting my days but after taking JORNAY my sleep has been better, mood is better, and I’m able to get started on tasks a lot easier now. Focus has also increased in meetings and in-person. Kind of lame but I feel like I am the person I was supposed to be after taking JORNAY. It was always an internal battle for me to get started on tasks or even get out of bed. Now it’s not an issue. Only downside of JORNAY is it has increased my tic disorder but I’m seeing a therapist to help tone down the tics. Overall this was a great alternative to adderall for me. Hope this helps."
  },
  {
    "medication": "Jornay PM",
    "comment": "Are you still taking and loving jornay?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Did you ever try vyvanse? I’m researching jornay and vyvanse to see which medication I’m interested in trying."
  },
  {
    "medication": "Jornay PM",
    "comment": "yes! i’ve never had a medicine work so well for me for so long!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Yes i tried Vyv. I didn’t like it because i felt more calm but not motivated to do anything. With JORNAY which I am still taking, I am calm but motivated to do things right when I get up in the morning. Something as simple as getting up in the morning at 4:30am-5am and to be able to start my day at work is so much easier now with JORNAY. \n\nThe best way I can say how JORNAY works for me is when I was undiagnosed I would want to clean up room, hang up that picture on the wall, or bring those dirty dishes out of my room but I couldn’t get the extra “oompf” to do it. With JORNAY now, it’s simple. I don’t overthink everything and literally just do these things now without questioning myself. Also, it makes me happy because I’m doing these tasks without overthinking which gives me some confidence too. Hope that helps and good luck!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Thank you for sharing your experience! I think I am going to finalize jornay PM as my choice. My psychiatrist says it’s up to me. She is wants to suggest vyvanse, but o have heard more good things about jornay so I think I will let her know I want to stick to my gut feeling. Thank you so much"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/alynds129 and thanks for posting on /r/ADHD!\n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* **We want your opinion** on the /r/adhd community rules! [Click here](https://forms.gle/Evqb8acVozir8GV8A) to fill out our survey. See [this post](https://www.reddit.com/r/ADHD/comments/1auv2tc/were_taking_feedback_on_the_radhd_rules/) for more information.\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "My dr added in a nonstim with my stim. It made a big difference. Plus, with the stim shortage my nonstim gets me through. I take guanfaince. And now bc of the stim shortage my dr added back in wellbutrin + guanfaince. I do take a stim, but it's probably every 3-4 months if it ever is available."
  },
  {
    "medication": "Jornay PM",
    "comment": "I had my appointment with my doctor today and she added Wellbutrin 12h to my regimen.. I’m hoping it helps!!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Thanks for responding.. I was on Stims too for years but they never really seemed like enough either and they were always out of them.. I tried Guan too but it didn’t do much."
  },
  {
    "medication": "Jornay PM",
    "comment": "It's definately trial and error to find a stim and nonstim. Guanfaince is so subtle, but it keeps my brain from crashing to a stop. The stim gets me present and focused, but then my brain just gets tired."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I switched to Azstarys due to generic Vyvanse disappearing. Azstarys has a copay coupon for people with commercial health insurance, in case ur insurance doesnt cover enough. I have not found difficulty getting mine filled same day at my pharmacy.\n\nI heard azstarys works great for some. Tbh it isn’t fantastic for me but now that you mention Jornay, I might look into that!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Just commenting to say I’m experiencing the same thing!! Have been on Jornay PM 40 mg for a month now and it doesn’t feel like anything. I’ve noticed it only sometimes wakes me up, but I never feel like it’s working at all in comparison to Vyvanse"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/Some-Tie-9885 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "(I don't take it) \n\nIt's just methylphenidate but it comes with the added bonus of being made to be taken at night before you sleep so that when you wake up in the morning it'll already be working.\n\nSo like if you wake up at 6 am, you take it at 6 pm and when you wake up it'll last for about 10-12 hours, it's pretty dope for someone who can't remember to take it in the morning"
  },
  {
    "medication": "Jornay PM",
    "comment": "I’m a terror to get out of bed in the morning. My neuropsychiatrist gave me an article about ADHD and sleep, and it mentioned that sometimes taking the medication about an hour before you get up can help. I don’t feel as groggy in the morning, but I’m still terrible at waking up. It takes about 30 minutes for me to fully wake up."
  },
  {
    "medication": "Jornay PM",
    "comment": "It's just methylphenidate with a fancy coating that doesn't start releasing meds until hours later. So if you do well on methylphenidate, you'll probably do well with this."
  },
  {
    "medication": "Jornay PM",
    "comment": "I’ve just started Jornay (took it for the first time last night). It did not really help me wake up, but I have a separate medication for that because my Psychiatrist thinks I may have a sleep disorder as well. \n\nI’m working pretty efficiently today and prioritizing much better. It also seems like I’m not leaving things out in my work, and I don’t feel as much like I’m floundering every so often as I go. When I first started working today I felt a little bit of floundering but once I managed to get past that I was able to focus and stay focused."
  },
  {
    "medication": "Jornay PM",
    "comment": "I started 80mg Jornay recently and it has quite literally changed my entire life. I used to ignore my alarms, wake up groggy and exhausted and have to quickly shower and run to class, and i’d often forget to take my medication. I was literally in danger of failing out of school because at one point I had essentially ceased to function properly, barely going to class or doing homework. \n\nThe first day I took it, I woke up *before* my alarm went off, got out of bed and was in the shower within 5 minutes. This process literally took me 45 minutes to an hour before I started Jornay. I’m not exaggerating when I say I literally almost cried out of happiness. That was the first time I’ve ever woken up on my own and been productive and actually felt *awake* all day.\n\nI have prior experience with methylphenidate and vyvanse, neither of which worked as well for me as the Jornay does. Side effect wise, with vyvanse I got very bad dry mouth which I haven’t gotten with Jornay, but I have noticed that my hands and feet are cold and I sweat more, which I personally have gotten with any ADHD meds I take. The fact that it start in the morning and I don’t have to remember to take it when I wake up is a huuuuuge benefit. It also lasts long enough to keep me focused until I have to take it again at night, which helps me remember to take it. \n\nObviously not everyone will have the same experience, but what I’ve heard from the specialist who prescribed it to me is that it’s been amazing for almost everyone who has tried it and so many people have said the same things I have, that it’s the first time they’ve ever woken up like that, and that they feel much better throughout the day. I could never have imagined waking up this easily or feeling this productive through the day. I can’t advocate for this drug enough; it has literally changed my life so much for the better."
  },
  {
    "medication": "Jornay PM",
    "comment": "it's just methylphenidate (ritalin) as far as I now"
  },
  {
    "medication": "Jornay PM",
    "comment": "I posted about this a few weeks ago as my son had started taking it. He started on the lowest dose and it didn’t really work for him. The doc is out of town for vacation until after the sixth so we will revisit it with his doctor then. As of now he has gone back to daytrana which seems to be the best thing for him so far."
  },
  {
    "medication": "Jornay PM",
    "comment": "Does it help with sleep as well? It’s so hard for me to go to sleep !"
  },
  {
    "medication": "Jornay PM",
    "comment": "How does one take a pill an hour before they wake up?"
  },
  {
    "medication": "Jornay PM",
    "comment": "I was just like you until I started Jornay; I thought I had terrible sleep quality, would snooze my alarm a dozen times until I had 10 minutes to shower and sprint to class, and would be exhausted all day. I would sleep in to the point of missing classes, commitments, and really anything I had scheduled before noon. \n\nYou should really read my long comment on this post about my experience with Jornay, but if you want a TL;DR (ish, it’s kinda long still lol) here you go: \n\nThe first time I took it, I woke up the next morning *before my alarm went off*. I was out of bed and in the shower within 5 minutes of waking up. I felt more awake than I have in years, and it lasted *all day*.  I went through the day and I felt better than I ever did while taking Concerta or Vyvanse, the two medications I’ve been on before. I’m not exaggerating when I say I almost cried that day out of happiness. Jornay has changed my entire life more than I ever thought possible. Obviously it won’t be the same for everyone, but I *highly* recommend it to anyone with ADHD who has trouble waking up, trouble remembering to take medication, or even just general exhaustion. Honestly I also feel like it works better than Concerta or Vyvanse ever did for my focus and motivation as well, and I’d say that absolutely anyone who is looking for new medication should give it a shot. I can’t say enough about how much it changed my whole life."
  },
  {
    "medication": "Jornay PM",
    "comment": "I do the same thing :)"
  },
  {
    "medication": "Jornay PM",
    "comment": "The dextroamphetamine version of it was in phase 2 of trials last I checked. That would pretty much be the vyvanse version."
  },
  {
    "medication": "Jornay PM",
    "comment": "What has your experience been timing it? I'm trialing it now and took it last night at like 9:45. It kicked in and woke me up at 5am..."
  },
  {
    "medication": "Jornay PM",
    "comment": "How about if you don’t do well with time release drugs?"
  },
  {
    "medication": "Jornay PM",
    "comment": "No, a stimulant will not usually help you sleep. And that's not how this one works anyway...it basically just sits in your stomach and it takes 12 hours for the coating to dissolve before meds start getting released."
  },
  {
    "medication": "Jornay PM",
    "comment": "Keep meds on nightstand. Set alarm. Roll over, take med, go back to sleep. Second alarm goes off."
  },
  {
    "medication": "Jornay PM",
    "comment": "Husband wakes me up when he gets up (about an hour before me). Take pill, go back to sleep (not hard, hahaha). He then comes in and wakes me (three times) before I’m fully conscious and able to get out of bed. Before Adderall, I could sleep for 36 hours straight on the weekends."
  },
  {
    "medication": "Jornay PM",
    "comment": "Wow. Awesome. I might have to ask about it. I’ve just never been a morning person—ever. On the weekends when my husband gives me my meds at 5 or 6 am, I am usually awake and good to go anywhere between 7:45 and 8:30. A couple of times I have slept past that, but only once or twice since I started Adderall. \n\nNow my biggest problem is falling asleep during the day. I get up and I’m good to go, but sometimes I’ll lay in bed and watch TV, and then I’m OUT. I did that Sunday. Got up, did the things, decided to lay down and watch some Netflix about noon, 1 pm. I woke up Monday morning. And was a terror to get up."
  },
  {
    "medication": "Jornay PM",
    "comment": "My doctor said a lot of people wake up early the first few days, but it also definitely kicks in differently for different people. I’ve been taking it around the same time and waking up *on my own without an alarm* at around 9-9:30 every day now, but I was waking up pretty early the first few days. I’d say give it a week and if you’re still waking up early you should adjust the time you take it."
  },
  {
    "medication": "Jornay PM",
    "comment": "If you read the fine print in the directions that come with the drug (which I never do but I’ve had so much trouble finding info on Jornay because it’s so new I had no choice!) there is actually evidence that eating a high-fat dinner the night you take it can actually delay the whole process by I think 2.5 hours on average. Maybe try experimenting and seeing how different dinners affect your wake up times!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Oh okay. I was hoping it was a new science break through 😂😂 I really hope one day we will have something like a 24 hour stimulant. The explanation is in my head but I just can’t put to words exactly what I mean . The struggle is real. Bottom line I hope science comes up with a stumulant that works 24/7 allowing us to sleep. Here hoping lol"
  },
  {
    "medication": "Jornay PM",
    "comment": "I do this too after finding I was in a loop of sleeping in = so meds taken later than meant = can't sleep that night till reeeeally late = sleep in late \n\nBroke the loop with 7am alarm, meds at bedside and a glass of water. So easy to fix and feel daft for not thinking of it sooner lol"
  },
  {
    "medication": "Jornay PM",
    "comment": "My meds need to be taken with food. It's a pita."
  },
  {
    "medication": "Jornay PM",
    "comment": "Wow, my wife too... what the heck... why? We had no idea this was an adhd thing"
  },
  {
    "medication": "Jornay PM",
    "comment": "Ahhh... You take it once a day (at night) it has 6-8 hours worth of sleep med coating that wears off just in time for the stimulant to kick in and work for the next 12-18 hours and that wears off just in time to take it again and go back to sleep? Here's hoping!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Wish I could take credit, but I definitely picked it up from people here lol."
  },
  {
    "medication": "Jornay PM",
    "comment": "Yeah I read it here too ! After 30mins to and hour, your meds are kicked in and you get up and feel fresh. And also this practice makes you to never GoGet to take your meds."
  },
  {
    "medication": "Jornay PM",
    "comment": "Which med? I don't know any that HAVE to be taken with food."
  },
  {
    "medication": "Jornay PM",
    "comment": "I went to a specialist recently and found out the reason behind this! It’s basically that many people (especially adults) with ADHD have what’s called “low arousal”. Low arousal means that it’s very hard to capture the individual’s attention or to sustain that attention for any extended period of time. This leads to the individual pursuing behaviors that are instantly gratifying to them, such as playing a video game rather than doing homework, because that’s more “arousing”, or rewarding in terms of dopamine, in that moment. It also leads to feeling much more tired and groggy all the time, because unless you’re doing something that arouses your interest, your brain is in a very low-energy state, because there’s no motivation to do *anything*. When your brain is in this low-energy state, you feel very tired and you end up sleeping a ton because you just feel absolutely exhausted all the time.\n\n\nIt’s a really interesting concept and helped explain so many of my ADHD symptoms. It presents differently in different people with ADHD, which is why some people with ADHD are very hyperactive while others are very subdued. In hyperactive cases, the individual is constantly “waking up” their brain by fidgeting, talking a lot, or otherwise being hyperactive. In the subdued cases, the individual’s brain is constantly in that groggy state I described above, and very few things will be interesting or enjoyable to them, which leads to them choosing to do the thing that is the most desirable at any given moment rather than focusing on their long-term goals and needs."
  },
  {
    "medication": "Jornay PM",
    "comment": "This article was amazing. If I could find it, I’d upload it somewhere. But I gave it to my mom, who also has untreated ADHD. She didn’t read it, but she did lose it. Hahaha, boo."
  },
  {
    "medication": "Jornay PM",
    "comment": "Omg you genius! Yes you literally got into my brain and translated what I was thinking but your view is more badasss !"
  },
  {
    "medication": "Jornay PM",
    "comment": "Well....... sometimes you question if you remember taking them, or do you just remember thinking about taking them, so I always put it in a little porcelain tray the night before. Makes it way easier to tell if you took it (also, getting a single pill out when groggy is next to impossible, so there is that). But I have a baby now, so i have to be more careful :(.\n\n It's a good thing I discovered this trick before switching to vyvanse too, no way I could wake up otherwise."
  },
  {
    "medication": "Jornay PM",
    "comment": "Medikinet, sold in Germany, contains methylphenidate. It needs to be taken with food, otherwise the release mechanism does not work correctly."
  },
  {
    "medication": "Jornay PM",
    "comment": "This is VERY helpful, thank you!!!"
  },
  {
    "medication": "Jornay PM",
    "comment": "This is basically what the article said."
  },
  {
    "medication": "Jornay PM",
    "comment": "Well, if you find it or someone else does, please share. We need to learn more ASAP."
  },
  {
    "medication": "Jornay PM",
    "comment": "I noticed one of these... :( \n\n\n\n So here take this... :D"
  },
  {
    "medication": "Jornay PM",
    "comment": "Fellow Vyvanser here. I also take a small dose Aderal to jumpstart the engine (my Vyvanse can take a few hours to kick in). Does it work well for you on the Vyvanse relative to whatever you took before?"
  },
  {
    "medication": "Jornay PM",
    "comment": "I have a plastic weekly pill case. I refill it on Sunday."
  },
  {
    "medication": "Jornay PM",
    "comment": "No problem! Also, I *highly* recommend giving Jornay a shot. You can read my other comments on this post about it, but the gist of it is that it has changed my life more than I ever thought was possible."
  },
  {
    "medication": "Jornay PM",
    "comment": "I can tell you it was from the CHADD organization (chadd.org), Attention Magazine.  Couldn’t tell you what month or year (maybe 2011-2012? It was kind of old), It was titled nearly this: ADHD and SLeep. It was super informative, and I will ask my mom tomorrow if she can find it."
  },
  {
    "medication": "Jornay PM",
    "comment": "I took adderall before, and I was way too sensitive to that. I like how mild vyvanse is."
  },
  {
    "medication": "Jornay PM",
    "comment": "Thank you so much!!! :/). I’ll search in the am"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Taking concerta and not liking it but nobody’s experience is going to apply to you. Only advice I have is: since vyvanse works so well for you, only if necessary should you try amphetamine based drugs like Adderall. Methylphenidate might work as well but the safer (most likely to work just as well)  bet is adderall/amphetamines"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I had the same experience I was so tired even after sleeping for 8+ hours each night"
  },
  {
    "medication": "Jornay PM",
    "comment": "I've been on this for awhile and didn't even realize it was the culprit.  Thank you for posting"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Doesn't keep me awake! In fact, I've never slept better on a stimulant in my life. Take it about 10 hours before you want it to start working."
  },
  {
    "medication": "Jornay PM",
    "comment": "I do! I've been on it for about 2 years now. I tried an instant release amphetamine because I forgot to take it one night and I do NOT miss that 'stim feeling' I get with everything else."
  },
  {
    "medication": "Jornay PM",
    "comment": "What is your dose? Does it last for most of the day?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/SorryClassroom8343 and thanks for posting on /r/ADHD!\n\n**Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.**\n\nThe mobile apps used for Reddit are broken or are missing features that this subreddit depends on. [We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) \n\nThank you!\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "This is an amazing question! Thank you for asking this. But yes, if I were in your shoes, I would use a little trial and error to make sure that the Lamictal isnt causing the effects of the Jornay to not exist. If the trial and error doesnt work you may need to lower the dosage, I know that if I take more than 40mg of the Amphetamine Sulfate that I take, it doesnt seem to work as good as taking a single 20mg. But there are a lot of components that can determine if the dosage you are on will work or not. I would trial and error for a few days and if nothing changes reach out to your primary care doctor that has prescribed you the medication and let them know that the dosage you are on isnt working as intended anymore. Wish you the best though!"
  },
  {
    "medication": "Jornay PM",
    "comment": "It stopped working for me. Was productive the first few weeks and now I’m rather distracted and can’t get work done I’m on 20 but I’ve been experiencing vasoconstriction so I’m scared to go up in dose.."
  },
  {
    "medication": "Jornay PM",
    "comment": "The explanations online are complicated, but it looks like lamictal binds to dopamine receptors (blocking your body's dopamine from binding there).  It mildy inhibits dopamine signaling.  So it is basically working against what the stimulants do for us.  I took lamictal alone and it made my adhd worse.  It also inhibits glutamate, which we are often low in.  If you are using it to calm down to sleep, you might try short acting methylphenidate in the morning as soon as you get up and then a long acting dose when that wears off.  For me short acting kicks in in about 15-20 minutes."
  },
  {
    "medication": "Jornay PM",
    "comment": "Have you considered increasing your Jornay dosage? \nI’m actually experiencing something extremely similar - I’ve been on Jornay PM 80mg for over a year but recently started Lamictal this week and it feels as if I’m not on Jornay at all, in fact it feels like my ADHD symptoms are worse than before ever starting Jornay (extremely fidgety), I’m able to wake up in the morning but that’s about it? What dosage of Lamictal are you on?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Also consider experimenting with varying the time you take Jornay in the evening. I have a hunch that my metabolism rates vary potentially with the changes in daylight hours. My hunch is that it varies based on the rate of change of daylight hours vs the actual number of daylight hours if that makes sense. I’ve noticed some weeks of the year taking it at 8pm means the next evening I’ve still got enough residual in my system to make me hyperfocused and mess up my sleep. I’ve shifted to taking it closer to 5pm and it seems to be helpful."
  },
  {
    "medication": "Jornay PM",
    "comment": "I’m on 100mg. First couple of days were amazing. I really felt the effect. One week later it’s doing nothing for me and I’m on the highest doseage. Has this happened to anyone else?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Flat out never worked. I think this is formulated for kids. I took it at night and woke up at 3. Then I’m dragging  for the rest of the day. I’m switching off pronto."
  },
  {
    "medication": "Jornay PM",
    "comment": "About a year on Mydayis here, currently on Adhansia. It's much less common because of the price. No generic, and insurance may not cover. Depending on the length of your day, may also cause insomnia issues. They're not kidding when they say it lasts 16-18 hours.\n\nDefinitely never ran into the shortage/out of stock issues with it, but generally had to wait a day or two while they got the order in for it."
  },
  {
    "medication": "Jornay PM",
    "comment": "I love Mydayis and it worked really well for me! I struggled with medications wearing off and not lasting long but Mydayis was a game changer for me. Sadly it's very expensive. When my insurance covered it, I still paid over $100 and when my provider was no longer in my network, the out of pocket was insane. Aside from that Mydayis was the best XR for me combined with a short term mid afternoon. I would sometime take the Mydays and regular adderall together in the am, since Mydayis seemed to take hours to kick in, but overall it would last almost 15 hours.  I also liked that it didn't give me the ups and downs like other medications did and seemed to be \"smoother\" which sometimes also makes it difficult to gauge whether it has started working.  Overall seemed to be the best XR for me. Vyvanse is annother XR that works well. I have never heard of Journay."
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/Kari-0-Key and thanks for posting on /r/ADHD!\n\nIf you haven't already, please take a minute to [read our rules](/r/adhd/about/rules) - we will remove your post if it breaks one - and also check out our list of official megathreads [here](/r/adhd/wiki/megathreads). If your post fits into one of them, it is likely to be removed; if you think this might happen you can delete your post here and resubmit it there instead.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Adhansia has been discontinued, I’m considering Mydayis as I prefer a full day treatment. What are you doing now that Adhansia is no more?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Thanks for the response. Why did you switch from Mydayis to Adhansia?\nIs it tough for you to sleep?\nDo you also use IR's on shorter days?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Been on adderall xr 10mg about a month I am skinny and have a fast metabolism.. last maybe 2 hours 😂"
  },
  {
    "medication": "Jornay PM",
    "comment": "Would you mind sharing your experience and how long you trialed it?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Uhh. Thanks you kind internet stranger for making me aware, I just got a refill a few weeks ago.  The supply chains must still have inventory left that they're running through. \n\nSo I guess I'm making an appointment with my psych soon then! I was on Mydayis for awhile,  I guess I'm switching back then.  I find both effective,  but Adhansia raised my heart rate less."
  },
  {
    "medication": "Jornay PM",
    "comment": "It took some time to find the right timing balance, and definitely struggled till I did. Now I wake up 6-7 am, just long enough to take the meds and go back to sleep. They wear off before I need to sleep, and have a lovely side benefit of making it WAY easier to get up and moving now.\n\nAs for the switch, I've been trialing several for awhile trying to find what works best for me. So far these are the two kind of neck and neck options.\n\nNo, I don't use IRs, I just take the normal dose or skip a weekend day if I really don't need it."
  },
  {
    "medication": "Jornay PM",
    "comment": "I just found out as I was on 70mg and pharmacies near me had 30mg left at one and 45mg at another and this last refill they told me they contacted manufacturer and it’s done for good which I verified on some pharmaceuticals website. \n\nI meet with my prescriber today and going to ask for Mydayis"
  },
  {
    "medication": "Jornay PM",
    "comment": "Wait, why do you take them and go back to sleep? Mydayis says it lasts 16 hours..."
  },
  {
    "medication": "Jornay PM",
    "comment": "I had the reverse reaction.  Vyvanse made me angry and irritable and I had a terrible crash.  Mydayis lasts all day and is smooth.  I do feel a slight slump around 10am and then the second day wave hits.  It doesn't make me feel wired either like other stimulants I've tried."
  },
  {
    "medication": "Jornay PM",
    "comment": "I found significantly less insomnia issues with Adhansia, so be aware you might run into that on Mydayis and bring it up with your Doc. For me, it didn't seem to wear off in the expected time frame."
  },
  {
    "medication": "Jornay PM",
    "comment": "That was a suggestion from my psych, who is brilliant. I was complaining about how hard it is to get up in the morning, 8 alarms and backups and still groggy. I said I wished that my meds would just take effect immediately when I woke up, and he suggested 'Well, why not just take them before you get up?'. \n\n40 years of loathing mornings, and suddenly I'm a calm morning person. It's weird."
  },
  {
    "medication": "Jornay PM",
    "comment": "Decided to go with Concerta ER instead, she’s trying to have them fill 36mg x2 daily so it’s the same dosage the adhansia was. \n\nIf it doesn’t last long enough for me I’ll probably just ask for an IR booster for the evening if they’ll do it but i’m hoping i’m good with those and it lasts 12 hours at least."
  },
  {
    "medication": "Jornay PM",
    "comment": "O ok. I'm assuming it goes something like this; your routine is to wake up for your day around 8am. It takes an hour for RX to work through your system so you wake up at 7am to take it and fall back asleep until 8am.\n\nThat's why I was interested in trying Jornay PM. It disintegrates in your body after 10 hours so you take your dosage accordingly and by the time you wake up, it's already working."
  },
  {
    "medication": "Jornay PM",
    "comment": "That's correct, it's a variant of an XR but formulated with a triple release instead of double. I never tried a traditional XR, I skipped straight from Adderall IR to Mydayis. I found it to last the full 16+ hours for me."
  },
  {
    "medication": "Jornay PM",
    "comment": "Seems about the same honestly. Actually may be better than the Adhansia, I think I was having a couple weird side effects with Adhansia (it made me feel like I wanted to chain smoke cigarettes badly) but when I would miss it in the morning I didn’t care for smoking at all. \n\nI also had a couple periods during the day I really got tired and wanted to nap and I didn’t really feel that as badly or at all with the concerta. \n\nAlso less irritable it seems.  Surprising considering it’s the generic for concerta"
  },
  {
    "medication": "Jornay PM",
    "comment": "I have been searching Reddit to see if anyone has had their child on Vyvanse. My son is 7 and they started him off on 10 mg in January then went up to 20 mg. He has since lost so much weight and is stick thin and I’m starting to become terrified. Has your child lost weight (also, I’m not a medical doctor but starting an 8 year old on 40 mg??? Holy crap.)"
  },
  {
    "medication": "Jornay PM",
    "comment": "I feel like I could literally have written this myself!! Lol\n\nHow has the change gone for you? \n\nOur son is also 8, currently on Vyvanse, and I am going to ask to trial Jornay on Wednesday. Mornings are shocking. He wakes the whole house up, anywhere from 4am onwards. I can't believe there is actually a medication, that he could wake up already having it working!! \n\nHe is already on Clonidine and Melatonin to get to sleep. What time did you end up giving the dose? I also haven't been able to find a conversion calc. Our son is on 40mg Vyvanse, but not sure if that straight converts to 40mg. I read somewhere the capsule can be opened so the power can be put in water to drink?? That was the major reason we went with Vyvanse. \n\nSorry for all the questions, just good to find a parent, rather than reading the adult perspective only lol."
  },
  {
    "medication": "Jornay PM",
    "comment": "Thanks so much for this review and info! I’m debating between Jornay and Quilichew for my 6yo. He did well on quilivant Xr liquid, but I’ve been told Quilichew has been less effective for some kiddos. \nRight before the school year starts is probably not the best time to be switching up meds..but the idea of more peaceful mornings this school year does sound nice"
  },
  {
    "medication": "Jornay PM",
    "comment": "So glad to find someone else who is using this for their child! My daughter is making the switch tonight from 18mg Concerta, with 10mg methylphenidate boost in the afternoon, to 20mg Jornay. How is your daughter doing after a few months of taking it? Is it still working well for her? I’m really hoping for better mornings before school, and I’m nervous to be making the switch 9 days before school begins, but that’s the way our appointments fell. I’m also concerned about appetite suppression, as that is one big side effect we are seeing right now. I hate reading about all these kiddos who lose so much weight being on the medication :( Hope all is still going well for your daughter!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Sorry to hear your son is losing so much weight. This medication stuff can be really scary! My daughter did lose weight in the beginning and that’s the main reason I’m taking her off. She has been on it since November 2021 and basically weighs the same now as she did then. We tried an appetite stimulant for a bit too, but I didn’t want to keep adding on medications. Now that the school year is over, we’re making the switch. And yeah, I don’t love that her doctor wanted to start her on 40mg. The lowest is 20mg and that’s what we’ll be doing to start. She has been on 20mg of Vyvanse."
  },
  {
    "medication": "Jornay PM",
    "comment": "Hello! The switch has gone well! The mornings are so much easier. She doesn’t fight about everything and does great getting ready for the day. We started on 20 mg and that seems to be a good dose for her. You can’t dissolve the medication in anything, but you can sprinkle it on applesauce or ice cream. The beads inside need to be ingested whole. I usually give it to her about 8:15. Sometimes, it wakes her up way too early and I think it has to do with how much she has eaten the night before. There are days she has woken about at 5 or 5:30! But that isn’t the norm and either way, she is quiet, pleasant, and content, and gets along with her day just fine. She no longer has an appetite in the morning, but seems to eat well throughout the day. That was a slow adjustment though. It will be interesting to see how it goes once school starts. I’m curious how our afternoons/evenings will be when it comes time for homework. \n\nMed changes are scary, but overall, this was easy and she didn’t have negative side effects. \n\nGood luck!"
  },
  {
    "medication": "Jornay PM",
    "comment": "I hope you find the right path forward! We purposefully did the switch at the start of the summer. I will say, it wasn’t a rough transition. I can update as the school year starts and let you know how we’re doing. My daughter did have to do some summer school and I checked with the teacher during the transition and they said all was good."
  },
  {
    "medication": "Jornay PM",
    "comment": "So far we are still doing okay and appetite during the day seems better than it was when she was taking Vyvanse. She used to come home with her lunchbox full everyday and now she actually eats. It may be a result of all the physical activity at camp. Good luck!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Thanks so much for the info!! Appreciate it! It sounds very promising!! Glad to hear it’s working well for you!!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/Brilliant-Hat-7423 and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "What dosage did they start you on? I started on 40 and am now up to 60 (~210lbs, 56yo male)"
  },
  {
    "medication": "Jornay PM",
    "comment": "They're entirely different medications; not giving me a lot of confidence in that doctor. Jornay is basically Ritalin in a special release formulation.\n\nIf you want something like Adderall, then you'd want Mydayis or similar."
  },
  {
    "medication": "Jornay PM",
    "comment": "I started on 40mg a month ago after all the dexedrine outages, due to other issues we are trying 80mg this month - How long have you been taking JPM? Im optimistic about it, i like taking it at night. Last thing i do every day is prepare for the next day, kind of a nice ritual vs popping when I wake up."
  },
  {
    "medication": "Jornay PM",
    "comment": "When I was finally able to see my new doctor, she immediately switched me back. Said she didn't even know why my old doctor liked that med...Currently on Vyvanse in the AM and Adderall IR in the afternoon due to the shortage. Works great for me."
  },
  {
    "medication": "Jornay PM",
    "comment": "Once surprising thing for me is that it seems to kick in MUCH faster than ten hours. I'm guessing about 8. I'm going to track times very carefully this week but I've been waking up much earlier, so will try taking it later."
  },
  {
    "medication": "Jornay PM",
    "comment": "That's what matters, and everyone is different. Coming off Adderall is tough for me -- makes me irritable."
  },
  {
    "medication": "Jornay PM",
    "comment": "hows the Jornay going for you? I am starting it tonight. When do you take it? side effects? how long does it last? are you till on 60mg?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Same it kicks in around 8 hours for me as well. Im taking 100mg now feels fine"
  },
  {
    "medication": "Jornay PM",
    "comment": "Great. Except the insurance company took it off the covered list. My psychiatrist is fighting it.\n\nIt's basically Ritalin, so whatever side effects (good or bad) from that would be the same. I take mine about 9 hours before I want to be awake & functional. 60mg seems the best, and it lasts well into the afternoon. I have Focalin boosters if needed."
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/AdWaste1896 and thanks for posting on /r/ADHD!\n\n**Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.**\n\nThe mobile apps used for Reddit are broken or are missing features that this subreddit depends on. [We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) \n\nThank you!\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/snoopdoggystyle99 and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\n**If you are posting about the US Medication Shortage, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).**\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "So the issue as I understand it is what you are most likely eating impacting your absorbtion."
  },
  {
    "medication": "Jornay PM",
    "comment": "I definitely have a bad habit of eating before bed for sure so I can definitely see how the medicine doesn't start to work until way later in the day rather than when I awake.  I just don't understand why I'm struggling to open my eyes. I missed a dose yesterday and was up by 6 a.m. I took it last night and crashed by like 8-8:30, and I couldn't even open my eyes at 8 in the morning. I tried waking up at 6 and literally just kept pretty much kept passing back out. I don't understand because this medicine isn't a sleeping pill."
  },
  {
    "medication": "Jornay PM",
    "comment": "Foods high in vitamin C impact absorption (happens faster)."
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/ButWhatIfItQueffed and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\n**If you are posting about the US Medication Shortage, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).**\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hey! This might be a dumb question, but have you checked the “savings” part of the Jornay website? I think I remember them capping it at $75 if your insurance doesn’t cover it. Do you know if you qualify for that?"
  },
  {
    "medication": "Jornay PM",
    "comment": "I'm not sure, I'll look into it."
  },
  {
    "medication": "Jornay PM",
    "comment": "This. I just applied and got instant approval. They just need name on script and email address."
  },
  {
    "medication": "Jornay PM",
    "comment": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n- &#129309; [Want to join the Mod Team?](https://www.reddit.com/r/ADHD/comments/13gmzql/moderators_needed_inquire_within/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi. So I beleive you can take the meds out of the capsule but it won't make it a sorb any faster. Apparently the beads are what has the time activated coating. Figure in 10 hour from when you take the pill. I take mine at night around 12am so it kicks in an hour or so after I wake up. I'm having issues with the come down giving me anxiety and weird feelings. Best of luck"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/msp_ryno and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\n**If you are posting about the US Medication Shortage, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).**\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I take it at 7PM, wake up at 4:45-5AM. Once I start moving around, it kicks in within 20 minutes(ish). It’s been great but definitely only lasts (full effect) until around 1-2PM. I love it. I still have an appetite, no trouble going to sleep, etc. the only qualm I have is that I have no desire to drink water. I love water, but I’m just not thirsty on Jornay."
  },
  {
    "medication": "Jornay PM",
    "comment": "Actually the coupon bypasses the PA for the first 30 day free trial."
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/amuk and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\n**If you are posting about the US Medication Shortage, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).**\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "It woke me up too early. Didn’t get enough sleep"
  },
  {
    "medication": "Jornay PM",
    "comment": "what has your exp been like?"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/vkaysmith and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi Were you able to get any feedback from anywhere regarding your question? I have the same question."
  },
  {
    "medication": "Jornay PM",
    "comment": "Been on Adderall for 25 years.  In my experience, the law of diminished returns applies heavily to Adderall.  But it has maintained my attention span consistently despite the loss of the more desirable side effects.  Experientially it is rather like being more normal and now just needing it to function.   Like you described.  Still, a better place to be than my base state of neurochemistry."
  },
  {
    "medication": "Jornay PM",
    "comment": "I've been on JornayPM now for around a month and feel nothing. No benefits! My current dosage is 80mg. I had Gastric Bypass in 2020. Stimulants don't seem to do anything for me, including coffee. So frustrating!"
  },
  {
    "medication": "Jornay PM",
    "comment": "I’ve also taken it at 7pm a few times and woke up at 3 and it was difficult to go back to sleep"
  },
  {
    "medication": "Jornay PM",
    "comment": "No, but I’ve been taking jornay pm for about 2 months maybe 3, I don’t remember. My experience is that I take it at about 8pm and I wake up about 4:30 am (I’m a morning person). I will also say it doesn’t feel like vyvanse, but I can focus more and have more motivation. I can’t tell when it wears off it’s a very interesting feeling. I was so used to vyvanse and adderall I thought all stimulants were the same!"
  },
  {
    "medication": "Jornay PM",
    "comment": "I gotta say I felt better on vyvanse but it just wears off to quickly 🤷‍♀️ thinking about changing back"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/idonthaveaname2000 and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I would love to hear if you were ever able to get ahold of Jornay. I take Jornay and it's fantastic. So much better than Concerta. I love that it helps me wake up, and honestly the release is so slow that I don't feel the crash anymore. I really hope it becomes more available globally!"
  },
  {
    "medication": "Jornay PM",
    "comment": "I was just prescribed this but I’m in the USA. As far as I can tell, it looks like only the standard instant release and extended release versions are available in Europe. However, Jornay PM is methylphenidate which IS legal in Europe, so there’s hope of it coming there."
  },
  {
    "medication": "Jornay PM",
    "comment": "If you are experiencing adverse symptoms, or feel your dosage or medication is incorrect, tell your doctor/pharmacist as soon as possible."
  },
  {
    "medication": "Jornay PM",
    "comment": "I am currently having this same issue. I take it at night and cannot for the life of me wake up the next day. I could literally sleep the day away. I've talked to my pdoc, pharmacists and my general and there is absolutely nothing about it. So I don't know what's going on!"
  },
  {
    "medication": "Jornay PM",
    "comment": "Apparently there is a bunch of people who didn’t feel any effects after three weeks [comment post](https://www.reddit.com/r/ADHD/comments/l6h6cz/anybody_tried_jornay_pm/gvafgkt/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/SusanFlenniken and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "So does that mean it is not working at all or should we aim for a higher dose? I will do whatever it takes for my son to succeed."
  },
  {
    "medication": "Jornay PM",
    "comment": "Late here and not the exact same situation  but my daughter started Foculin a year ago for inattentive ADHD her most worrisome symptom was memory retention, she had NONE. When she started Foculin she could only remember 16 letters/sounds. Within 6 weeks on Foculin she was reading sentences and knew all of her letters and sounds confidently. We recently moved and had to switch doctors, her new doctor put her on Jornay PM. We're on month 3 and I feel her memory retention issues are back once again. Very unfortunate! We've raised her dose and I don't see a difference. I'm ready to go back before she realizes she's falling behind again and it tarnished her self esteem."
  },
  {
    "medication": "Jornay PM",
    "comment": "It just really woke me up too early and i just don’t think any amount of stimulant can overcome several months of sleep deprivation"
  },
  {
    "medication": "Jornay PM",
    "comment": "I would call Jornay directly and ask, considering it’s so new, they may be able to help.   Best of luck, I just got switched to this med and Walgreens had to order mine."
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/thehustlerbraveheart and thanks for posting on /r/ADHD!\n\n# Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n[We recommend browsing /r/adhd on desktop for the best experience.](https://www.reddit.com/r/ADHD/comments/x1psnb/radhd_works_best_on_desktop_reddits_apps_are/) The mobile apps are broken and are missing features that this subreddit depends on.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "Thank you…I finally found it. Had to switch pharmacies from CVS to Publix. I guess only certain pharmacies carry it"
  },
  {
    "medication": "Jornay PM",
    "comment": "Hi /u/tolearnandunderstand and thanks for posting on /r/ADHD!\n\nIf you haven't already, please take a minute to [read our rules](https://reddit.com/r/adhd/about/rules) - we will remove your post if it breaks one - and also check out our list of official megathreads [here](https://www.reddit.com/r/ADHD/comments/nu534w/official_list_of_radhd_megathreads_please_check/). If your post fits into one of them, it is likely to be removed; if you think this might happen you can delete your post here and resubmit it there instead.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*"
  },
  {
    "medication": "Jornay PM",
    "comment": "I don’t believe it is 24 hours. It slowly starts to release after about 8 hours after ingestion. If you are already taking Adderall XR and 2 Adderall IR, then I don’t think this would make any difference for you. Your best bet would be to try Adzeny’s. It’s a triple bead, 16 hour stimulant made my the same company who makes Adderall XR and Vyvanse. I’ve never tried it, but I’ve heard good things."
  },
  {
    "medication": "Jornay PM",
    "comment": "Whaaat? I can’t find the triple bead anywhere"
  }
]